[Killed] BlockStatement
extension/src/background-helpers.ts:11:83
 // Function to get icon paths for different themes - using chrome.runtime.getURL for proper extension URL resolution
 export function getActionIconPaths(): Record<Theme, Record<string, string>> {
   // Check if chrome and chrome.runtime.getURL are available
-  if (typeof chrome === "undefined" || !chrome.runtime || !chrome.runtime.getURL) {
-    // Return fallback paths when chrome API is not available (e.g., in tests)
-    return {
-      light: {
-        "16": "extension/icons/icon16.png",
-        "48": "extension/icons/icon48.png",
-        "128": "extension/icons/icon128.png",
-      },
-      dark: {
-        "16": "extension/icons/darkicon16.png",
-        "48": "extension/icons/darkicon48.png",
-        "128": "extension/icons/darkicon128.png",
-      },
-      auto: {
-        "16": "extension/icons/icon16.png",
-        "48": "extension/icons/icon48.png",
-        "128": "extension/icons/icon128.png",
-      },
-    };
-  }
+  if (typeof chrome === "undefined" || !chrome.runtime || !chrome.runtime.getURL) {}
 
   return {
killedBy: background-helpers applyThemeToActionIcon Chrome API availability should handle when chrome is undefined
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "Cannot read properties of undefined (reading 'runtime')"

      86 |     return stryMutAct_9fa48("25") ? {} : (stryCov_9fa48("25"), {
      87 |       light: stryMutAct_9fa48("26") ? {} : (stryCov_9fa48("26"), {
    > 88 |         "16": chrome.runtime.getURL(stryMutAct_9fa48("27") ? "" : (stryCov_9fa48("27"), "extens

[Killed] BooleanLiteral
extension/src/background-helpers.ts:11:59
 // Function to get icon paths for different themes - using chrome.runtime.getURL for proper extension URL resolution
 export function getActionIconPaths(): Record<Theme, Record<string, string>> {
   // Check if chrome and chrome.runtime.getURL are available
-  if (typeof chrome === "undefined" || !chrome.runtime || !chrome.runtime.getURL) {
+  if (typeof chrome === "undefined" || !chrome.runtime || chrome.runtime.getURL) {
     // Return fallback paths when chrome API is not available (e.g., in tests)
     return {
killedBy: background-helpers actionIconPaths should have correct light theme icon paths
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/resolved/extension/icons/icon16.png"
Received: "extension/icons/icon16.png"

[Survived] ObjectLiteral
extension/src/background-helpers.ts:14:14
   if (typeof chrome === "undefined" || !chrome.runtime || !chrome.runtime.getURL) {
     // Return fallback paths when chrome API is not available (e.g., in tests)
     return {
-      light: {
-        "16": "extension/icons/icon16.png",
-        "48": "extension/icons/icon48.png",
-        "128": "extension/icons/icon128.png",
-      },
+      light: {},
       dark: {
         "16": "extension/icons/darkicon16.png",

[Survived] ObjectLiteral
extension/src/background-helpers.ts:19:13
         "48": "extension/icons/icon48.png",
         "128": "extension/icons/icon128.png",
       },
-      dark: {
-        "16": "extension/icons/darkicon16.png",
-        "48": "extension/icons/darkicon48.png",
-        "128": "extension/icons/darkicon128.png",
-      },
+      dark: {},
       auto: {
         "16": "extension/icons/icon16.png",

[Survived] StringLiteral
extension/src/background-helpers.ts:27:16
       auto: {
         "16": "extension/icons/icon16.png",
         "48": "extension/icons/icon48.png",
-        "128": "extension/icons/icon128.png",
+        "128": "",
       },
     };

[Killed] ObjectLiteral
extension/src/background-helpers.ts:32:10
     };
   }
 
-  return {
-    light: {
-      "16": chrome.runtime.getURL("extension/icons/icon16.png"),
-      "48": chrome.runtime.getURL("extension/icons/icon48.png"),
-      "128": chrome.runtime.getURL("extension/icons/icon128.png"),
-    },
-    dark: {
-      "16": chrome.runtime.getURL("extension/icons/darkicon16.png"),
-      "48": chrome.runtime.getURL("extension/icons/darkicon48.png"),
-      "128": chrome.runtime.getURL("extension/icons/darkicon128.png"),
-    },
-    auto: {
-      "16": chrome.runtime.getURL("extension/icons/icon16.png"),
-      "48": chrome.runtime.getURL("extension/icons/icon48.png"),
-      "128": chrome.runtime.getURL("extension/icons/icon128.png"),
-    },
-  };
+  return {};
 }
 
killedBy: background-helpers actionIconPaths should have correct light theme icon paths
statusReason: TypeError: Cannot read properties of undefined (reading '16')

[Killed] StringLiteral
extension/src/background-helpers.ts:35:35
   return {
     light: {
       "16": chrome.runtime.getURL("extension/icons/icon16.png"),
-      "48": chrome.runtime.getURL("extension/icons/icon48.png"),
+      "48": chrome.runtime.getURL(""),
       "128": chrome.runtime.getURL("extension/icons/icon128.png"),
     },
killedBy: background-helpers actionIconPaths should have correct light theme icon paths
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/resolved/extension/icons/icon48.png"
Received: "/resolved/"

[Survived] ObjectLiteral
extension/src/background-helpers.ts:43:11
       "48": chrome.runtime.getURL("extension/icons/darkicon48.png"),
       "128": chrome.runtime.getURL("extension/icons/darkicon128.png"),
     },
-    auto: {
-      "16": chrome.runtime.getURL("extension/icons/icon16.png"),
-      "48": chrome.runtime.getURL("extension/icons/icon48.png"),
-      "128": chrome.runtime.getURL("extension/icons/icon128.png"),
-    },
+    auto: {},
   };
 }

[Survived] StringLiteral
extension/src/background-helpers.ts:44:35
       "128": chrome.runtime.getURL("extension/icons/darkicon128.png"),
     },
     auto: {
-      "16": chrome.runtime.getURL("extension/icons/icon16.png"),
+      "16": chrome.runtime.getURL(""),
       "48": chrome.runtime.getURL("extension/icons/icon48.png"),
       "128": chrome.runtime.getURL("extension/icons/icon128.png"),

[Survived] StringLiteral
extension/src/background-helpers.ts:46:36
     auto: {
       "16": chrome.runtime.getURL("extension/icons/icon16.png"),
       "48": chrome.runtime.getURL("extension/icons/icon48.png"),
-      "128": chrome.runtime.getURL("extension/icons/icon128.png"),
+      "128": chrome.runtime.getURL(""),
     },
   };

[Killed] BlockStatement
extension/src/background-helpers.ts:58:67
  * Applies the specified theme to the extension action icon
  * @param themeToApply - The theme to apply ('light' or 'dark')
  */
-export function applyThemeToActionIcon(themeToApply: Theme): void {
-  const validTheme = themeToApply === "dark" ? "dark" : "light";
-  const paths = getActionIconPaths()[validTheme];
-
-  if (!paths) {
-    console.warn(
-      "[BG] No icon paths found for theme: " + validTheme + ". Defaulting to light theme icons."
-    );
-  }
-
-  if (typeof chrome !== "undefined" && chrome.action && chrome.action.setIcon) {
-    chrome.action.setIcon({ path: paths || getActionIconPaths().light }, () => {
-      if (typeof chrome !== "undefined" && chrome.runtime && chrome.runtime.lastError) {
-        console.error(
-          "[BG] Error setting action icon for theme " + validTheme + ":",
-          chrome.runtime.lastError.message
-        );
-      }
-    });
-  }
-}
+export function applyThemeToActionIcon(themeToApply: Theme): void {}
 
killedBy: background-helpers applyThemeToActionIcon theme validation and fallback should apply light theme when 'light' is passed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"path": {"128": "/resolved/extension/icons/icon128.png", "16": "/resolved/extension/icons/icon16.png", "48": "/resolved/extension/icons/icon48.png"}}, Any<Function>

Number of calls: 0

[Killed] ConditionalExpression
extension/src/background-helpers.ts:59:22
  * @param themeToApply - The theme to apply ('light' or 'dark')
  */
 export function applyThemeToActionIcon(themeToApply: Theme): void {
-  const validTheme = themeToApply === "dark" ? "dark" : "light";
+  const validTheme = true ? "dark" : "light";
   const paths = getActionIconPaths()[validTheme];
 
killedBy: background-helpers applyThemeToActionIcon theme validation and fallback should apply light theme when 'light' is passed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "path": Object {
-     "128": "/resolved/extension/icons/icon128.png",

[Survived] ConditionalExpression
extension/src/background-helpers.ts:62:7
   const validTheme = themeToApply === "dark" ? "dark" : "light";
   const paths = getActionIconPaths()[validTheme];
 
-  if (!paths) {
+  if (true) {
     console.warn(
       "[BG] No icon paths found for theme: " + validTheme + ". Defaulting to light theme icons."

[Survived] BlockStatement
extension/src/background-helpers.ts:62:15
   const validTheme = themeToApply === "dark" ? "dark" : "light";
   const paths = getActionIconPaths()[validTheme];
 
-  if (!paths) {
-    console.warn(
-      "[BG] No icon paths found for theme: " + validTheme + ". Defaulting to light theme icons."
-    );
-  }
+  if (!paths) {}
 
   if (typeof chrome !== "undefined" && chrome.action && chrome.action.setIcon) {

[Survived] StringLiteral
extension/src/background-helpers.ts:64:61
 
   if (!paths) {
     console.warn(
-      "[BG] No icon paths found for theme: " + validTheme + ". Defaulting to light theme icons."
+      "[BG] No icon paths found for theme: " + validTheme + ""
     );
   }

[Killed] BlockStatement
extension/src/background-helpers.ts:68:80
     );
   }
 
-  if (typeof chrome !== "undefined" && chrome.action && chrome.action.setIcon) {
-    chrome.action.setIcon({ path: paths || getActionIconPaths().light }, () => {
-      if (typeof chrome !== "undefined" && chrome.runtime && chrome.runtime.lastError) {
-        console.error(
-          "[BG] Error setting action icon for theme " + validTheme + ":",
-          chrome.runtime.lastError.message
-        );
-      }
-    });
-  }
+  if (typeof chrome !== "undefined" && chrome.action && chrome.action.setIcon) {}
 }
 
killedBy: background-helpers applyThemeToActionIcon theme validation and fallback should apply light theme when 'light' is passed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"path": {"128": "/resolved/extension/icons/icon128.png", "16": "/resolved/extension/icons/icon16.png", "48": "/resolved/extension/icons/icon48.png"}}, Any<Function>

Number of calls: 0

[Killed] LogicalOperator
extension/src/background-helpers.ts:68:7
     );
   }
 
-  if (typeof chrome !== "undefined" && chrome.action && chrome.action.setIcon) {
+  if (typeof chrome !== "undefined" || chrome.action && chrome.action.setIcon) {
     chrome.action.setIcon({ path: paths || getActionIconPaths().light }, () => {
       if (typeof chrome !== "undefined" && chrome.runtime && chrome.runtime.lastError) {
killedBy: background-helpers applyThemeToActionIcon Chrome API availability should handle when chrome is undefined
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "Cannot read properties of undefined (reading 'action')"

      126 |       }
      127 |     }

[Killed] ConditionalExpression
extension/src/background-helpers.ts:69:35
   }
 
   if (typeof chrome !== "undefined" && chrome.action && chrome.action.setIcon) {
-    chrome.action.setIcon({ path: paths || getActionIconPaths().light }, () => {
+    chrome.action.setIcon({ path: true }, () => {
       if (typeof chrome !== "undefined" && chrome.runtime && chrome.runtime.lastError) {
         console.error(
killedBy: background-helpers applyThemeToActionIcon theme validation and fallback should apply light theme when 'light' is passed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "path": Object {
-     "128": "/resolved/extension/icons/icon128.png",

[Killed] BlockStatement
extension/src/background-helpers.ts:69:80
   }
 
   if (typeof chrome !== "undefined" && chrome.action && chrome.action.setIcon) {
-    chrome.action.setIcon({ path: paths || getActionIconPaths().light }, () => {
-      if (typeof chrome !== "undefined" && chrome.runtime && chrome.runtime.lastError) {
-        console.error(
-          "[BG] Error setting action icon for theme " + validTheme + ":",
-          chrome.runtime.lastError.message
-        );
-      }
-    });
+    chrome.action.setIcon({ path: paths || getActionIconPaths().light }, () => {});
   }
 }
killedBy: background-helpers applyThemeToActionIcon error handling should handle setIcon callback errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "[BG] Error setting action icon for theme light:", "Failed to set icon"

Number of calls: 0

[Killed] ConditionalExpression
extension/src/background-helpers.ts:70:11
 
   if (typeof chrome !== "undefined" && chrome.action && chrome.action.setIcon) {
     chrome.action.setIcon({ path: paths || getActionIconPaths().light }, () => {
-      if (typeof chrome !== "undefined" && chrome.runtime && chrome.runtime.lastError) {
+      if (false) {
         console.error(
           "[BG] Error setting action icon for theme " + validTheme + ":",
killedBy: background-helpers applyThemeToActionIcon error handling should handle setIcon callback errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "[BG] Error setting action icon for theme light:", "Failed to set icon"

Number of calls: 0

[Killed] ConditionalExpression
extension/src/background-helpers.ts:70:11
 
   if (typeof chrome !== "undefined" && chrome.action && chrome.action.setIcon) {
     chrome.action.setIcon({ path: paths || getActionIconPaths().light }, () => {
-      if (typeof chrome !== "undefined" && chrome.runtime && chrome.runtime.lastError) {
+      if (true) {
         console.error(
           "[BG] Error setting action icon for theme " + validTheme + ":",
killedBy: background-helpers applyThemeToActionIcon theme validation and fallback should apply light theme when 'light' is passed
statusReason: TypeError: Cannot read properties of undefined (reading 'message')
