[Killed] BlockStatement
extension/src/background-logic.ts:50:50
   config: Partial<ServerConfig>,
   apiService: ApiService,
   storageService: StorageService
-): Promise<{ status: string; message?: string }> {
-  if (!port) {
-    return { status: "error", message: "Server port not found." };
-  }
-
-  try {
-    // First, try to save to the server
-    const serverSuccess = await apiService.saveConfig(port, config);
-    if (!serverSuccess) {
-      return { status: "error", message: "Failed to save config to server." };
-    }
-
-    // Then, save to local storage
-    await storageService.setConfig(config);
-
-    return { status: "success" };
-  } catch (err) {
-    const errorMessage = err instanceof Error ? err.message : "An unknown error occurred.";
-    console.error("[BG Logic] Error in handleSetConfig:", errorMessage);
-    return { status: "error", message: errorMessage };
-  }
-}
+): Promise<{ status: string; message?: string }> {}
 
 /**
killedBy: handleSetConfig successfully saves config to server and storage
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"status": "success"}
Received: undefined

[Killed] BlockStatement
extension/src/background-logic.ts:66:17
     await storageService.setConfig(config);
 
     return { status: "success" };
-  } catch (err) {
-    const errorMessage = err instanceof Error ? err.message : "An unknown error occurred.";
-    console.error("[BG Logic] Error in handleSetConfig:", errorMessage);
-    return { status: "error", message: errorMessage };
-  }
+  } catch (err) {}
 }
 
killedBy: handleSetConfig handles API service error
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"message": "Network timeout", "status": "error"}
Received: undefined

[Killed] StringLiteral
extension/src/background-logic.ts:68:19
     return { status: "success" };
   } catch (err) {
     const errorMessage = err instanceof Error ? err.message : "An unknown error occurred.";
-    console.error("[BG Logic] Error in handleSetConfig:", errorMessage);
+    console.error("", errorMessage);
     return { status: "error", message: errorMessage };
   }
killedBy: handleSetConfig handles API service error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "[BG Logic] Error in handleSetConfig:", "Network timeout"
Received: "", "Network timeout"

Number of calls: 1

[Killed] ObjectLiteral
extension/src/background-logic.ts:69:12
   } catch (err) {
     const errorMessage = err instanceof Error ? err.message : "An unknown error occurred.";
     console.error("[BG Logic] Error in handleSetConfig:", errorMessage);
-    return { status: "error", message: errorMessage };
+    return {};
   }
 }
killedBy: handleSetConfig handles API service error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Object {
-   "message": "Network timeout",
-   "status": "error",

[Killed] StringLiteral
extension/src/background-logic.ts:69:22
   } catch (err) {
     const errorMessage = err instanceof Error ? err.message : "An unknown error occurred.";
     console.error("[BG Logic] Error in handleSetConfig:", errorMessage);
-    return { status: "error", message: errorMessage };
+    return { status: "", message: errorMessage };
   }
 }
killedBy: handleSetConfig handles API service error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "message": "Network timeout",
-   "status": "error",

[Killed] ConditionalExpression
extension/src/background-logic.ts:123:9
   // Try cached port if not forcing scan
   if (!startScan) {
     const cached = await storageService.getPort();
-    if (cached !== null) {
+    if (false) {
       try {
         const ok = await Promise.race([
killedBy: discoverServerPort returns cached port if valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9091
Received: 9090

[Killed] ConditionalExpression
extension/src/background-logic.ts:131:13
             setTimeout(() => reject(new Error("Timeout")), timeout)
           ),
         ]);
-        if (ok) {
+        if (true) {
           return cached;
         }
killedBy: discoverServerPort scans all ports when cached invalid and caches discovered port
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9090
Received: 9091

[Killed] ArithmeticOperator
extension/src/background-logic.ts:145:66
   }
 
   // Scan port range with timeout and parallel checking for efficiency
-  const portRange = Array.from({ length: totalPorts }, (_, i) => defaultPort + i);
+  const portRange = Array.from({ length: totalPorts }, (_, i) => defaultPort - i);
 
   // Check ports in batches to avoid overwhelming the system
killedBy: discoverServerPort handles batch processing and progress callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9100
Received: null

[Killed] ArrowFunction
extension/src/background-logic.ts:145:56
   }
 
   // Scan port range with timeout and parallel checking for efficiency
-  const portRange = Array.from({ length: totalPorts }, (_, i) => defaultPort + i);
+  const portRange = Array.from({ length: totalPorts }, () => undefined);
 
   // Check ports in batches to avoid overwhelming the system
killedBy: discoverServerPort scans all ports when cached invalid and caches discovered port
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9090
Received: null

[Killed] EqualityOperator
extension/src/background-logic.ts:149:19
 
   // Check ports in batches to avoid overwhelming the system
   const batchSize = 5;
-  for (let i = 0; i < portRange.length; i += batchSize) {
+  for (let i = 0; i >= portRange.length; i += batchSize) {
     const batch = portRange.slice(i, i + batchSize);
 
killedBy: discoverServerPort scans all ports when cached invalid and caches discovered port
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9090
Received: null

[Killed] BlockStatement
extension/src/background-logic.ts:153:46
     const batch = portRange.slice(i, i + batchSize);
 
     // Check ports in parallel within the batch
-    const promises = batch.map(async port => {
-      try {
-        const isAvailable = await Promise.race([
-          checkStatus(port),
-          new Promise<boolean>((_, reject) =>
-            setTimeout(() => reject(new Error("Timeout")), timeout)
-          ),
-        ]);
-        return isAvailable ? port : null;
-      } catch {
-        return null;
-      }
-    });
+    const promises = batch.map(async port => {});
 
     const results = await Promise.all(promises);
killedBy: discoverServerPort scans all ports when cached invalid and caches discovered port
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9090
Received: null

[Killed] BlockStatement
extension/src/background-logic.ts:154:11
 
     // Check ports in parallel within the batch
     const promises = batch.map(async port => {
-      try {
-        const isAvailable = await Promise.race([
-          checkStatus(port),
-          new Promise<boolean>((_, reject) =>
-            setTimeout(() => reject(new Error("Timeout")), timeout)
-          ),
-        ]);
-        return isAvailable ? port : null;
-      } catch {
+      try {} catch {
         return null;
       }
killedBy: discoverServerPort scans all ports when cached invalid and caches discovered port
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9090
Received: null

[Killed] ConditionalExpression
extension/src/background-logic.ts:168:44
     });
 
     const results = await Promise.all(promises);
-    const foundPort = results.find(port => port !== null);
+    const foundPort = results.find(port => true);
 
     if (foundPort !== null && foundPort !== undefined) {
killedBy: discoverServerPort reports progress for exact multiple of batch size without extra iteration
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1009
Received: null

[Killed] ConditionalExpression
extension/src/background-logic.ts:168:44
     });
 
     const results = await Promise.all(promises);
-    const foundPort = results.find(port => port !== null);
+    const foundPort = results.find(port => false);
 
     if (foundPort !== null && foundPort !== undefined) {
killedBy: discoverServerPort scans all ports when cached invalid and caches discovered port
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9090
Received: null

[Killed] ConditionalExpression
extension/src/background-logic.ts:170:31
     const results = await Promise.all(promises);
     const foundPort = results.find(port => port !== null);
 
-    if (foundPort !== null && foundPort !== undefined) {
+    if (foundPort !== null && true) {
       // Cache discovered port
       if (storageService.setPort) {
killedBy: discoverServerPort returns null if no port found
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] ConditionalExpression
extension/src/background-logic.ts:180:9
 
     // Update progress
     scannedPorts += batch.length;
-    if (onProgress) {
+    if (true) {
       onProgress(scannedPorts, totalPorts);
     }
killedBy: discoverServerPort returns null if no port found
statusReason: TypeError: onProgress is not a function
