[Killed] BlockStatement
extension/src/core/validation-service.ts:35:25
   private validators: Map<string, Validator> = new Map();
   private fieldConfigs: Map<string, FieldConfig> = new Map();
 
-  private constructor() {
-    this.registerDefaultValidators();
-  }
+  private constructor() {}
 
   /**
killedBy: Validation Service Tests Port Validation should reject invalid ports
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
extension/src/core/validation-service.ts:43:38
    * Get the singleton instance of the validation service
    */
   static getInstance(): ValidationService {
-    if (!ValidationService.instance) {
-      ValidationService.instance = new ValidationService();
-    }
+    if (!ValidationService.instance) {}
     return ValidationService.instance;
   }
killedBy: Validation Service Tests Port Validation should validate valid ports
statusReason: TypeError: Cannot read properties of undefined (reading 'validate')

[Killed] ObjectLiteral
extension/src/core/validation-service.ts:91:33
     });
 
     // Path validation
-    this.validators.set("path", {
-      validate: (value: any): ValidationResult => {
-        if (!value || value.trim() === "") {
-          return { valid: false, error: "Path is required" };
-        }
-
-        // Basic path validation - can be enhanced based on platform
-        if (value.includes("..") || value.includes("//")) {
-          return { valid: false, error: "Invalid path format" };
-        }
-
-        return { valid: true };
-      },
-    });
+    this.validators.set("path", {});
 
     // Number range validation
killedBy: Validation Service Tests Path Validation should validate valid paths
statusReason: TypeError: validator.validate is not a function

[Killed] StringLiteral
extension/src/core/validation-service.ts:91:25
     });
 
     // Path validation
-    this.validators.set("path", {
+    this.validators.set("", {
       validate: (value: any): ValidationResult => {
         if (!value || value.trim() === "") {
killedBy: Validation Service Tests Path Validation should reject invalid paths
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
extension/src/core/validation-service.ts:108:93
 
     // Number range validation
     this.validators.set("number", {
-      validate: (value: any, context?: { min?: number; max?: number }): ValidationResult => {
-        const num = parseFloat(value);
-
-        if (isNaN(num)) {
-          return { valid: false, error: "Must be a valid number" };
-        }
-
-        if (context?.min !== undefined && num < context.min) {
-          return {
-            valid: false,
-            error: `Value must be at least ${context.min}`,
-          };
-        }
-
-        if (context?.max !== undefined && num > context.max) {
-          return {
-            valid: false,
-            error: `Value must be at most ${context.max}`,
-          };
-        }
-
-        return { valid: true };
-      },
+      validate: (value: any, context?: { min?: number; max?: number }): ValidationResult => {},
     });
 
killedBy: Validation Service Tests Multiple Field Validation should validate multiple fields
statusReason: TypeError: Cannot read properties of undefined (reading 'valid')

[Killed] BlockStatement
extension/src/core/validation-service.ts:111:25
       validate: (value: any, context?: { min?: number; max?: number }): ValidationResult => {
         const num = parseFloat(value);
 
-        if (isNaN(num)) {
-          return { valid: false, error: "Must be a valid number" };
-        }
+        if (isNaN(num)) {}
 
         if (context?.min !== undefined && num < context.min) {
killedBy: Validation Service Tests Built-in Validator Edge Cases should handle number validator without context
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] StringLiteral
extension/src/core/validation-service.ts:112:41
         const num = parseFloat(value);
 
         if (isNaN(num)) {
-          return { valid: false, error: "Must be a valid number" };
+          return { valid: false, error: "" };
         }
 
killedBy: Validation Service Tests Built-in Validator Edge Cases should handle number validator without context
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Must be a valid number"
Received: ""

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:115:13
           return { valid: false, error: "Must be a valid number" };
         }
 
-        if (context?.min !== undefined && num < context.min) {
+        if (true) {
           return {
             valid: false,
killedBy: Validation Service Tests Multiple Field Validation should validate multiple fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
extension/src/core/validation-service.ts:122:13
           };
         }
 
-        if (context?.max !== undefined && num > context.max) {
+        if (context?.max === undefined && num > context.max) {
           return {
             valid: false,
killedBy: Validation Service Tests Multiple Field Validation should identify invalid fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
extension/src/core/validation-service.ts:122:62
           };
         }
 
-        if (context?.max !== undefined && num > context.max) {
-          return {
-            valid: false,
-            error: `Value must be at most ${context.max}`,
-          };
-        }
+        if (context?.max !== undefined && num > context.max) {}
 
         return { valid: true };
killedBy: Validation Service Tests Multiple Field Validation should identify invalid fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:139:13
         value: any,
         context?: { minLength?: number; maxLength?: number; pattern?: RegExp }
       ): ValidationResult => {
-        if (!value || value.trim() === "") {
+        if (true) {
           return { valid: false, error: "Text is required" };
         }
killedBy: Validation Service Tests Field Validation should validate required fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ObjectLiteral
extension/src/core/validation-service.ts:140:18
         context?: { minLength?: number; maxLength?: number; pattern?: RegExp }
       ): ValidationResult => {
         if (!value || value.trim() === "") {
-          return { valid: false, error: "Text is required" };
+          return {};
         }
 
killedBy: Validation Service Tests Edge Cases should handle whitespace-only values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:145:13
 
         const trimmedValue = value.trim();
 
-        if (context?.minLength !== undefined && trimmedValue.length < context.minLength) {
+        if (false) {
           return {
             valid: false,
killedBy: Validation Service Tests Edge Cases should handle exact text length boundaries
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:145:13
 
         const trimmedValue = value.trim();
 
-        if (context?.minLength !== undefined && trimmedValue.length < context.minLength) {
+        if (true) {
           return {
             valid: false,
killedBy: Validation Service Tests Field Validation should validate required fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
extension/src/core/validation-service.ts:152:49
           };
         }
 
-        if (context?.maxLength !== undefined && trimmedValue.length > context.maxLength) {
+        if (context?.maxLength !== undefined && trimmedValue.length >= context.maxLength) {
           return {
             valid: false,
killedBy: Validation Service Tests Edge Cases should handle exact text length boundaries
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:152:13
           };
         }
 
-        if (context?.maxLength !== undefined && trimmedValue.length > context.maxLength) {
+        if (false) {
           return {
             valid: false,
killedBy: Validation Service Tests Edge Cases should handle very long values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
extension/src/core/validation-service.ts:159:70
           };
         }
 
-        if (context?.pattern && !context.pattern.test(trimmedValue)) {
-          return { valid: false, error: "Text format is invalid" };
-        }
+        if (context?.pattern && !context.pattern.test(trimmedValue)) {}
 
         return { valid: true };
killedBy: Validation Service Tests Field Validation should validate field patterns
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:159:13
           };
         }
 
-        if (context?.pattern && !context.pattern.test(trimmedValue)) {
+        if (true) {
           return { valid: false, error: "Text format is invalid" };
         }
killedBy: Validation Service Tests Field Validation should validate required fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
extension/src/core/validation-service.ts:168:25
     });
 
     // Select validation
-    this.validators.set("select", {
+    this.validators.set("", {
       validate: (value: any, context?: { options?: string[] }): ValidationResult => {
         if (!value || value.trim() === "") {
killedBy: Validation Service Tests Built-in Validator Edge Cases should handle select validator edge cases
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ObjectLiteral
extension/src/core/validation-service.ts:168:35
     });
 
     // Select validation
-    this.validators.set("select", {
-      validate: (value: any, context?: { options?: string[] }): ValidationResult => {
-        if (!value || value.trim() === "") {
-          return { valid: false, error: "Selection is required" };
-        }
-
-        if (context?.options && !context.options.includes(value)) {
-          return { valid: false, error: "Invalid selection" };
-        }
-
-        return { valid: true };
-      },
-    });
+    this.validators.set("select", {});
   }
 
killedBy: Validation Service Tests Built-in Validator Edge Cases should handle select validator edge cases
statusReason: TypeError: validator.validate is not a function

[Killed] BlockStatement
extension/src/core/validation-service.ts:169:85
 
     // Select validation
     this.validators.set("select", {
-      validate: (value: any, context?: { options?: string[] }): ValidationResult => {
-        if (!value || value.trim() === "") {
-          return { valid: false, error: "Selection is required" };
-        }
-
-        if (context?.options && !context.options.includes(value)) {
-          return { valid: false, error: "Invalid selection" };
-        }
-
-        return { valid: true };
-      },
+      validate: (value: any, context?: { options?: string[] }): ValidationResult => {},
     });
   }
killedBy: Validation Service Tests Built-in Validator Edge Cases should handle select validator edge cases
statusReason: TypeError: Cannot read properties of undefined (reading 'valid')

[Killed] EqualityOperator
extension/src/core/validation-service.ts:170:23
     // Select validation
     this.validators.set("select", {
       validate: (value: any, context?: { options?: string[] }): ValidationResult => {
-        if (!value || value.trim() === "") {
+        if (!value || value.trim() !== "") {
           return { valid: false, error: "Selection is required" };
         }
killedBy: Validation Service Tests Built-in Validator Edge Cases should handle select validator edge cases
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:170:13
     // Select validation
     this.validators.set("select", {
       validate: (value: any, context?: { options?: string[] }): ValidationResult => {
-        if (!value || value.trim() === "") {
+        if (false) {
           return { valid: false, error: "Selection is required" };
         }
killedBy: Validation Service Tests Built-in Validator Edge Cases should handle select validator edge cases
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
extension/src/core/validation-service.ts:174:33
           return { valid: false, error: "Selection is required" };
         }
 
-        if (context?.options && !context.options.includes(value)) {
+        if (context?.options && context.options.includes(value)) {
           return { valid: false, error: "Invalid selection" };
         }
killedBy: Validation Service Tests Built-in Validator Edge Cases should handle select validator edge cases
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] OptionalChaining
extension/src/core/validation-service.ts:174:13
           return { valid: false, error: "Selection is required" };
         }
 
-        if (context?.options && !context.options.includes(value)) {
+        if (context.options && !context.options.includes(value)) {
           return { valid: false, error: "Invalid selection" };
         }
killedBy: Validation Service Tests Built-in Validator Edge Cases should handle select validator edge cases
statusReason: TypeError: Cannot read properties of undefined (reading 'options')

[Killed] StringLiteral
extension/src/core/validation-service.ts:175:41
         }
 
         if (context?.options && !context.options.includes(value)) {
-          return { valid: false, error: "Invalid selection" };
+          return { valid: false, error: "" };
         }
 
killedBy: Validation Service Tests Built-in Validator Edge Cases should handle select validator edge cases
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Invalid selection"
Received: ""

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:214:9
    */
   validateField(fieldName: string, value: any): ValidationResult {
     const config = this.fieldConfigs.get(fieldName);
-    if (!config) {
+    if (false) {
       return { valid: true }; // Default to valid if no config found
     }
killedBy: Validation Service Tests Error Handling should handle unknown fields
statusReason: TypeError: Cannot read properties of undefined (reading 'required')

[Killed] ObjectLiteral
extension/src/core/validation-service.ts:215:14
   validateField(fieldName: string, value: any): ValidationResult {
     const config = this.fieldConfigs.get(fieldName);
     if (!config) {
-      return { valid: true }; // Default to valid if no config found
+      return {}; // Default to valid if no config found
     }
 
killedBy: Validation Service Tests Error Handling should handle unknown fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:219:9
     }
 
     // Check required
-    if (config.required && (!value || value.toString().trim() === "")) {
+    if (true) {
       return { valid: false, error: `${config.name} is required` };
     }
killedBy: Validation Service Tests Field Validation should validate required fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:219:29
     }
 
     // Check required
-    if (config.required && (!value || value.toString().trim() === "")) {
+    if (config.required && (true)) {
       return { valid: false, error: `${config.name} is required` };
     }
killedBy: Validation Service Tests Field Validation should validate required fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
extension/src/core/validation-service.ts:220:37
 
     // Check required
     if (config.required && (!value || value.toString().trim() === "")) {
-      return { valid: false, error: `${config.name} is required` };
+      return { valid: false, error: `` };
     }
 
killedBy: Validation Service Tests Field Validation should validate required fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Required Field is required"
Received: ""

[Killed] BlockStatement
extension/src/core/validation-service.ts:224:73
     }
 
     // If not required and empty, consider valid
-    if (!config.required && (!value || value.toString().trim() === "")) {
-      return { valid: true };
-    }
+    if (!config.required && (!value || value.toString().trim() === "")) {}
 
     // Get the appropriate validator
killedBy: Validation Service Tests Non-required Field Validation should allow empty values for non-required fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
extension/src/core/validation-service.ts:236:9
 
     // Build context for validation
     const context: any = {};
-    if (config.min !== undefined) {
+    if (config.min === undefined) {
       // For text type, map min/max to minLength/maxLength
       if (config.type === "text") {
killedBy: Validation Service Tests Non-required Field Validation should still validate non-empty values for non-required fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:236:9
 
     // Build context for validation
     const context: any = {};
-    if (config.min !== undefined) {
+    if (false) {
       // For text type, map min/max to minLength/maxLength
       if (config.type === "text") {
killedBy: Validation Service Tests Non-required Field Validation should still validate non-empty values for non-required fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:238:11
     const context: any = {};
     if (config.min !== undefined) {
       // For text type, map min/max to minLength/maxLength
-      if (config.type === "text") {
+      if (false) {
         context.minLength = config.min;
       } else {
killedBy: Validation Service Tests Non-required Field Validation should still validate non-empty values for non-required fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
extension/src/core/validation-service.ts:238:11
     const context: any = {};
     if (config.min !== undefined) {
       // For text type, map min/max to minLength/maxLength
-      if (config.type === "text") {
+      if (config.type !== "text") {
         context.minLength = config.min;
       } else {
killedBy: Validation Service Tests Non-required Field Validation should still validate non-empty values for non-required fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] BlockStatement
extension/src/core/validation-service.ts:240:14
       // For text type, map min/max to minLength/maxLength
       if (config.type === "text") {
         context.minLength = config.min;
-      } else {
-        context.min = config.min;
-      }
+      } else {}
     }
     if (config.max !== undefined) {

[Killed] BlockStatement
extension/src/core/validation-service.ts:244:35
         context.min = config.min;
       }
     }
-    if (config.max !== undefined) {
-      // For text type, map min/max to minLength/maxLength
-      if (config.type === "text") {
-        context.maxLength = config.max;
-      } else {
-        context.max = config.max;
-      }
-    }
+    if (config.max !== undefined) {}
     if (config.pattern) context.pattern = config.pattern;
 
killedBy: Validation Service Tests Multiple Field Validation should identify invalid fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:244:9
         context.min = config.min;
       }
     }
-    if (config.max !== undefined) {
+    if (false) {
       // For text type, map min/max to minLength/maxLength
       if (config.type === "text") {
killedBy: Validation Service Tests Multiple Field Validation should identify invalid fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:246:11
     }
     if (config.max !== undefined) {
       // For text type, map min/max to minLength/maxLength
-      if (config.type === "text") {
+      if (true) {
         context.maxLength = config.max;
       } else {
killedBy: Validation Service Tests Multiple Field Validation should identify invalid fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
extension/src/core/validation-service.ts:246:35
     }
     if (config.max !== undefined) {
       // For text type, map min/max to minLength/maxLength
-      if (config.type === "text") {
-        context.maxLength = config.max;
-      } else {
+      if (config.type === "text") {} else {
         context.max = config.max;
       }
killedBy: Validation Service Tests Non-required Field Validation should still validate non-empty values for non-required fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
extension/src/core/validation-service.ts:248:14
       // For text type, map min/max to minLength/maxLength
       if (config.type === "text") {
         context.maxLength = config.max;
-      } else {
-        context.max = config.max;
-      }
+      } else {}
     }
     if (config.pattern) context.pattern = config.pattern;
killedBy: Validation Service Tests Multiple Field Validation should identify invalid fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:252:9
         context.max = config.max;
       }
     }
-    if (config.pattern) context.pattern = config.pattern;
+    if (false) context.pattern = config.pattern;
 
     // Run validation
killedBy: Validation Service Tests Field Validation should validate field patterns
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] ConditionalExpression
extension/src/core/validation-service.ts:252:9
         context.max = config.max;
       }
     }
-    if (config.pattern) context.pattern = config.pattern;
+    if (true) context.pattern = config.pattern;
 
     // Run validation

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:258:9
     const result = validator.validate(value, context);
 
     // Run custom validator if provided
-    if (config.customValidator && result.valid) {
+    if (true) {
       const customResult = config.customValidator(value);
       if (!customResult.valid) {
killedBy: Validation Service Tests Field Validation should validate required fields
statusReason: TypeError: config.customValidator is not a function

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:260:11
     // Run custom validator if provided
     if (config.customValidator && result.valid) {
       const customResult = config.customValidator(value);
-      if (!customResult.valid) {
+      if (false) {
         return customResult;
       }
killedBy: Validation Service Tests Field Validation should validate field length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
extension/src/core/validation-service.ts:271:81
   /**
    * Validate multiple fields at once
    */
-  validateFields(fields: Record<string, any>): Record<string, ValidationResult> {
-    const results: Record<string, ValidationResult> = {};
-
-    for (const [fieldName, value] of Object.entries(fields)) {
-      results[fieldName] = this.validateField(fieldName, value);
-    }
-
-    return results;
-  }
+  validateFields(fields: Record<string, any>): Record<string, ValidationResult> {}
 
   /**
killedBy: Validation Service Tests Multiple Field Validation should validate multiple fields
statusReason: TypeError: Cannot read properties of undefined (reading 'port')

[Killed] BlockStatement
extension/src/core/validation-service.ts:284:63
   /**
    * Check if all validations pass
    */
-  isValid(results: Record<string, ValidationResult>): boolean {
-    return Object.values(results).every(result => result.valid);
-  }
+  isValid(results: Record<string, ValidationResult>): boolean {}
 
   /**
killedBy: Validation Service Tests Multiple Field Validation should check overall validity
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ArrowFunction
extension/src/core/validation-service.ts:285:41
    * Check if all validations pass
    */
   isValid(results: Record<string, ValidationResult>): boolean {
-    return Object.values(results).every(result => result.valid);
+    return Object.values(results).every(() => undefined);
   }
 
killedBy: Validation Service Tests Multiple Field Validation should check overall validity
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] MethodExpression
extension/src/core/validation-service.ts:285:12
    * Check if all validations pass
    */
   isValid(results: Record<string, ValidationResult>): boolean {
-    return Object.values(results).every(result => result.valid);
+    return Object.values(results).some(result => result.valid);
   }
 

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:295:11
     const errors: Record<string, string> = {};
 
     for (const [fieldName, result] of Object.entries(results)) {
-      if (!result.valid && result.error) {
+      if (true) {
         errors[fieldName] = result.error;
       }
killedBy: Validation Service Tests Error Collection and Aggregation should return empty errors for all valid fields
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 2
Received array:  ["field1", "field2"]
