[Timeout] LogicalOperator
extension/src/background-helpers.ts:12:5
 export function getActionIconPaths(): Record<Theme, Record<string, string>> {
   // Check if chrome and chrome.runtime.getURL are available
   if (
-    typeof chrome === "undefined" ||
-    !chrome.runtime ||
+    typeof chrome === "undefined" && !chrome.runtime ||
     !chrome.runtime.getURL
   ) {

[Timeout] LogicalOperator
extension/src/background-helpers.ts:12:5
 export function getActionIconPaths(): Record<Theme, Record<string, string>> {
   // Check if chrome and chrome.runtime.getURL are available
   if (
-    typeof chrome === "undefined" ||
-    !chrome.runtime ||
-    !chrome.runtime.getURL
+    (typeof chrome === "undefined" || !chrome.runtime) && !chrome.runtime.getURL
   ) {
     // Return fallback paths when chrome API is not available (e.g., in tests)

[Timeout] BooleanLiteral
extension/src/background-helpers.ts:13:5
   // Check if chrome and chrome.runtime.getURL are available
   if (
     typeof chrome === "undefined" ||
-    !chrome.runtime ||
+    chrome.runtime ||
     !chrome.runtime.getURL
   ) {

[Timeout] BooleanLiteral
extension/src/background-helpers.ts:14:5
   if (
     typeof chrome === "undefined" ||
     !chrome.runtime ||
-    !chrome.runtime.getURL
+    chrome.runtime.getURL
   ) {
     // Return fallback paths when chrome API is not available (e.g., in tests)

[Timeout] BlockStatement
extension/src/background-helpers.ts:15:5
     typeof chrome === "undefined" ||
     !chrome.runtime ||
     !chrome.runtime.getURL
-  ) {
-    // Return fallback paths when chrome API is not available (e.g., in tests)
-    return {
-      light: {
-        "16": "extension/icons/icon16.png",
-        "48": "extension/icons/icon48.png",
-        "128": "extension/icons/icon128.png",
-      },
-      dark: {
-        "16": "extension/icons/darkicon16.png",
-        "48": "extension/icons/darkicon48.png",
-        "128": "extension/icons/darkicon128.png",
-      },
-    };
-  }
+  ) {}
 
   return {

[Survived] StringLiteral
extension/src/background-helpers.ts:20:15
     return {
       light: {
         "16": "extension/icons/icon16.png",
-        "48": "extension/icons/icon48.png",
+        "48": "",
         "128": "extension/icons/icon128.png",
       },

[Survived] StringLiteral
extension/src/background-helpers.ts:24:15
         "128": "extension/icons/icon128.png",
       },
       dark: {
-        "16": "extension/icons/darkicon16.png",
+        "16": "",
         "48": "extension/icons/darkicon48.png",
         "128": "extension/icons/darkicon128.png",

[Survived] StringLiteral
extension/src/background-helpers.ts:26:16
       dark: {
         "16": "extension/icons/darkicon16.png",
         "48": "extension/icons/darkicon48.png",
-        "128": "extension/icons/darkicon128.png",
+        "128": "",
       },
     };

[Killed] ObjectLiteral
extension/src/background-helpers.ts:32:12
   }
 
   return {
-    light: {
-      "16": chrome.runtime.getURL("extension/icons/icon16.png"),
-      "48": chrome.runtime.getURL("extension/icons/icon48.png"),
-      "128": chrome.runtime.getURL("extension/icons/icon128.png"),
-    },
+    light: {},
     dark: {
       "16": chrome.runtime.getURL("extension/icons/darkicon16.png"),
killedBy: background-helpers actionIconPaths should have correct light theme icon paths
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/resolved/extension/icons/icon16.png"
Received: undefined

[Killed] StringLiteral
extension/src/background-helpers.ts:33:35
 
   return {
     light: {
-      "16": chrome.runtime.getURL("extension/icons/icon16.png"),
+      "16": chrome.runtime.getURL(""),
       "48": chrome.runtime.getURL("extension/icons/icon48.png"),
       "128": chrome.runtime.getURL("extension/icons/icon128.png"),
killedBy: background-helpers actionIconPaths should have correct light theme icon paths
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/resolved/extension/icons/icon16.png"
Received: "/resolved/"

[Killed] StringLiteral
extension/src/background-helpers.ts:38:35
       "128": chrome.runtime.getURL("extension/icons/icon128.png"),
     },
     dark: {
-      "16": chrome.runtime.getURL("extension/icons/darkicon16.png"),
+      "16": chrome.runtime.getURL(""),
       "48": chrome.runtime.getURL("extension/icons/darkicon48.png"),
       "128": chrome.runtime.getURL("extension/icons/darkicon128.png"),
killedBy: background-helpers actionIconPaths should have correct dark theme icon paths
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/resolved/extension/icons/darkicon16.png"
Received: "/resolved/"

[Killed] StringLiteral
extension/src/background-helpers.ts:40:36
     dark: {
       "16": chrome.runtime.getURL("extension/icons/darkicon16.png"),
       "48": chrome.runtime.getURL("extension/icons/darkicon48.png"),
-      "128": chrome.runtime.getURL("extension/icons/darkicon128.png"),
+      "128": chrome.runtime.getURL(""),
     },
   };
killedBy: background-helpers actionIconPaths should have correct dark theme icon paths
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/resolved/extension/icons/darkicon128.png"
Received: "/resolved/"

[Killed] ConditionalExpression
extension/src/background-helpers.ts:53:22
  * @param themeToApply - The theme to apply ('light' or 'dark')
  */
 export function applyThemeToActionIcon(themeToApply: Theme): void {
-  const validTheme = themeToApply === "dark" ? "dark" : "light";
+  const validTheme = false ? "dark" : "light";
   const paths = getActionIconPaths()[validTheme];
 
killedBy: background-helpers applyThemeToActionIcon theme validation and fallback should apply dark theme when 'dark' is passed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "path": Object {
-     "128": "/resolved/extension/icons/darkicon128.png",

[Killed] EqualityOperator
extension/src/background-helpers.ts:53:22
  * @param themeToApply - The theme to apply ('light' or 'dark')
  */
 export function applyThemeToActionIcon(themeToApply: Theme): void {
-  const validTheme = themeToApply === "dark" ? "dark" : "light";
+  const validTheme = themeToApply !== "dark" ? "dark" : "light";
   const paths = getActionIconPaths()[validTheme];
 
killedBy: background-helpers applyThemeToActionIcon theme validation and fallback should apply light theme when 'light' is passed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "path": Object {
-     "128": "/resolved/extension/icons/icon128.png",

[Survived] BooleanLiteral
extension/src/background-helpers.ts:56:7
   const validTheme = themeToApply === "dark" ? "dark" : "light";
   const paths = getActionIconPaths()[validTheme];
 
-  if (!paths) {
+  if (paths) {
     console.warn(
       "[BG] No icon paths found for theme: " +

[Survived] ConditionalExpression
extension/src/background-helpers.ts:56:7
   const validTheme = themeToApply === "dark" ? "dark" : "light";
   const paths = getActionIconPaths()[validTheme];
 
-  if (!paths) {
+  if (false) {
     console.warn(
       "[BG] No icon paths found for theme: " +

[Killed] LogicalOperator
extension/src/background-helpers.ts:64:7
     );
   }
 
-  if (typeof chrome !== "undefined" && chrome.action && chrome.action.setIcon) {
+  if (typeof chrome !== "undefined" && chrome.action || chrome.action.setIcon) {
     chrome.action.setIcon({ path: paths || getActionIconPaths().light }, () => {
       if (
killedBy: background-helpers applyThemeToActionIcon Chrome API availability should handle when chrome is undefined
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "Cannot read properties of undefined (reading 'action')"

      116 |       }
      117 |     }

[Killed] ConditionalExpression
extension/src/background-helpers.ts:64:7
     );
   }
 
-  if (typeof chrome !== "undefined" && chrome.action && chrome.action.setIcon) {
+  if (false) {
     chrome.action.setIcon({ path: paths || getActionIconPaths().light }, () => {
       if (
killedBy: background-helpers applyThemeToActionIcon theme validation and fallback should apply light theme when 'light' is passed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"path": {"128": "/resolved/extension/icons/icon128.png", "16": "/resolved/extension/icons/icon16.png", "48": "/resolved/extension/icons/icon48.png"}}, Any<Function>

Number of calls: 0

[Killed] ConditionalExpression
extension/src/background-helpers.ts:65:35
   }
 
   if (typeof chrome !== "undefined" && chrome.action && chrome.action.setIcon) {
-    chrome.action.setIcon({ path: paths || getActionIconPaths().light }, () => {
+    chrome.action.setIcon({ path: false }, () => {
       if (
         typeof chrome !== "undefined" &&
killedBy: background-helpers applyThemeToActionIcon theme validation and fallback should apply light theme when 'light' is passed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "path": Object {
-     "128": "/resolved/extension/icons/icon128.png",

[Killed] BlockStatement
extension/src/background-helpers.ts:65:80
   }
 
   if (typeof chrome !== "undefined" && chrome.action && chrome.action.setIcon) {
-    chrome.action.setIcon({ path: paths || getActionIconPaths().light }, () => {
-      if (
-        typeof chrome !== "undefined" &&
-        chrome.runtime &&
-        chrome.runtime.lastError
-      ) {
-        console.error(
-          "[BG] Error setting action icon for theme " + validTheme + ":",
-          chrome.runtime.lastError.message
-        );
-      }
-    });
+    chrome.action.setIcon({ path: paths || getActionIconPaths().light }, () => {});
   }
 }
killedBy: background-helpers applyThemeToActionIcon error handling should handle setIcon callback errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "[BG] Error setting action icon for theme light:", "Failed to set icon"

Number of calls: 0

[Killed] ConditionalExpression
extension/src/background-helpers.ts:67:9
   if (typeof chrome !== "undefined" && chrome.action && chrome.action.setIcon) {
     chrome.action.setIcon({ path: paths || getActionIconPaths().light }, () => {
       if (
-        typeof chrome !== "undefined" &&
-        chrome.runtime &&
-        chrome.runtime.lastError
+        false
       ) {
         console.error(
killedBy: background-helpers applyThemeToActionIcon error handling should handle setIcon callback errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "[BG] Error setting action icon for theme light:", "Failed to set icon"

Number of calls: 0

[Killed] ConditionalExpression
extension/src/background-helpers.ts:67:9
   if (typeof chrome !== "undefined" && chrome.action && chrome.action.setIcon) {
     chrome.action.setIcon({ path: paths || getActionIconPaths().light }, () => {
       if (
-        typeof chrome !== "undefined" &&
-        chrome.runtime &&
-        chrome.runtime.lastError
+        true
       ) {
         console.error(
killedBy: background-helpers applyThemeToActionIcon theme validation and fallback should apply light theme when 'light' is passed
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] BlockStatement
extension/src/background-helpers.ts:70:9
         typeof chrome !== "undefined" &&
         chrome.runtime &&
         chrome.runtime.lastError
-      ) {
-        console.error(
-          "[BG] Error setting action icon for theme " + validTheme + ":",
-          chrome.runtime.lastError.message
-        );
-      }
+      ) {}
     });
   }
killedBy: background-helpers applyThemeToActionIcon error handling should handle setIcon callback errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "[BG] Error setting action icon for theme light:", "Failed to set icon"

Number of calls: 0

[Killed] StringLiteral
extension/src/background-helpers.ts:72:11
         chrome.runtime.lastError
       ) {
         console.error(
-          "[BG] Error setting action icon for theme " + validTheme + ":",
+          "" + validTheme + ":",
           chrome.runtime.lastError.message
         );
killedBy: background-helpers applyThemeToActionIcon error handling should handle setIcon callback errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "[BG] Error setting action icon for theme light:", "Failed to set icon"
Received
       1: "light:", "Failed to set icon"
       2: "light:", "Failed to set icon"

Number of calls: 2
