[Killed] BlockStatement
extension/src/background-logic.ts:50:50
   config: Partial<ServerConfig>,
   apiService: ApiService,
   storageService: StorageService
-): Promise<{ status: string; message?: string }> {
-  if (!port) {
-    return { status: "error", message: "Server port not found." };
-  }
-
-  try {
-    // First, try to save to the server
-    const serverSuccess = await apiService.saveConfig(port, config);
-    if (!serverSuccess) {
-      return { status: "error", message: "Failed to save config to server." };
-    }
-
-    // Then, save to local storage
-    await storageService.setConfig(config);
-
-    return { status: "success" };
-  } catch (err) {
-    const errorMessage =
-      err instanceof Error ? err.message : "An unknown error occurred.";
-    console.error("[BG Logic] Error in handleSetConfig:", errorMessage);
-    return { status: "error", message: errorMessage };
-  }
-}
+): Promise<{ status: string; message?: string }> {}
 
 /**
killedBy: Background Logic: handleSetConfig should return success when both server and storage saves succeed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 5013, {"download_dir": "/new/path"}

Number of calls: 0

[Killed] ConditionalExpression
extension/src/background-logic.ts:51:7
   apiService: ApiService,
   storageService: StorageService
 ): Promise<{ status: string; message?: string }> {
-  if (!port) {
+  if (false) {
     return { status: "error", message: "Server port not found." };
   }
killedBy: Background Logic: handleSetConfig should return an error if the server port is not available
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: null, {"download_dir": "/new/path"}

[Killed] BooleanLiteral
extension/src/background-logic.ts:51:7
   apiService: ApiService,
   storageService: StorageService
 ): Promise<{ status: string; message?: string }> {
-  if (!port) {
+  if (port) {
     return { status: "error", message: "Server port not found." };
   }
killedBy: Background Logic: handleSetConfig should return success when both server and storage saves succeed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 5013, {"download_dir": "/new/path"}

Number of calls: 0

[Killed] BlockStatement
extension/src/background-logic.ts:55:7
     return { status: "error", message: "Server port not found." };
   }
 
-  try {
-    // First, try to save to the server
-    const serverSuccess = await apiService.saveConfig(port, config);
-    if (!serverSuccess) {
-      return { status: "error", message: "Failed to save config to server." };
-    }
-
-    // Then, save to local storage
-    await storageService.setConfig(config);
-
-    return { status: "success" };
-  } catch (err) {
+  try {} catch (err) {
     const errorMessage =
       err instanceof Error ? err.message : "An unknown error occurred.";
killedBy: Background Logic: handleSetConfig should return success when both server and storage saves succeed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 5013, {"download_dir": "/new/path"}

Number of calls: 0

[Killed] BlockStatement
extension/src/background-logic.ts:58:25
   try {
     // First, try to save to the server
     const serverSuccess = await apiService.saveConfig(port, config);
-    if (!serverSuccess) {
-      return { status: "error", message: "Failed to save config to server." };
-    }
+    if (!serverSuccess) {}
 
     // Then, save to local storage
killedBy: Background Logic: handleSetConfig should return an error if saving to the server fails
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"download_dir": "/new/path"}

[Killed] BooleanLiteral
extension/src/background-logic.ts:58:9
   try {
     // First, try to save to the server
     const serverSuccess = await apiService.saveConfig(port, config);
-    if (!serverSuccess) {
+    if (serverSuccess) {
       return { status: "error", message: "Failed to save config to server." };
     }
killedBy: Background Logic: handleSetConfig should return success when both server and storage saves succeed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"download_dir": "/new/path"}

Number of calls: 0

[Killed] StringLiteral
extension/src/background-logic.ts:59:42
     // First, try to save to the server
     const serverSuccess = await apiService.saveConfig(port, config);
     if (!serverSuccess) {
-      return { status: "error", message: "Failed to save config to server." };
+      return { status: "error", message: "" };
     }
 
killedBy: Background Logic: handleSetConfig should return an error if saving to the server fails
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "message": "Failed to save config to server.",
+   "message": "",

[Killed] StringLiteral
extension/src/background-logic.ts:65:22
     // Then, save to local storage
     await storageService.setConfig(config);
 
-    return { status: "success" };
+    return { status: "" };
   } catch (err) {
     const errorMessage =
killedBy: Background Logic: handleSetConfig should return success when both server and storage saves succeed
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "status": "success",
+   "status": "",

[Killed] BlockStatement
extension/src/background-logic.ts:66:17
     await storageService.setConfig(config);
 
     return { status: "success" };
-  } catch (err) {
-    const errorMessage =
-      err instanceof Error ? err.message : "An unknown error occurred.";
-    console.error("[BG Logic] Error in handleSetConfig:", errorMessage);
-    return { status: "error", message: errorMessage };
-  }
+  } catch (err) {}
 }
 
killedBy: Background Logic: handleSetConfig should return an error if saving to storage throws an exception
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"message": "Storage is full", "status": "error"}
Received: undefined

[Killed] StringLiteral
extension/src/background-logic.ts:69:19
   } catch (err) {
     const errorMessage =
       err instanceof Error ? err.message : "An unknown error occurred.";
-    console.error("[BG Logic] Error in handleSetConfig:", errorMessage);
+    console.error("", errorMessage);
     return { status: "error", message: errorMessage };
   }
killedBy: Background Logic: handleSetConfig should return an error if saving to storage throws an exception
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "[BG Logic] Error in handleSetConfig:", "Storage is full"
Received: "", "Storage is full"

Number of calls: 1

[Timeout] BlockStatement
extension/src/background-logic.ts:81:41
  */
 export async function handleGetHistory(
   storageService: StorageService
-): Promise<{ history: HistoryEntry[] }> {
-  const history = await storageService.getHistory();
-  return { history };
-}
+): Promise<{ history: HistoryEntry[] }> {}
 
 /**

[Killed] BlockStatement
extension/src/background-logic.ts:93:32
  */
 export async function handleClearHistory(
   storageService: StorageService
-): Promise<{ status: string }> {
-  await storageService.clearHistory();
-  return { status: "success" };
-}
+): Promise<{ status: string }> {}
 
 /**
killedBy: Background Logic: History Handlers handleClearHistory should call the storage service to clear history
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
extension/src/background-logic.ts:95:20
   storageService: StorageService
 ): Promise<{ status: string }> {
   await storageService.clearHistory();
-  return { status: "success" };
+  return { status: "" };
 }
 
killedBy: Background Logic: History Handlers handleClearHistory should call the storage service to clear history
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "status": "success",
+   "status": "",

[NoCoverage] BooleanLiteral
extension/src/background-logic.ts:114:24
   checkStatus: (port: number) => Promise<boolean>,
   defaultPort: number,
   maxPort: number,
-  startScan: boolean = false,
+  startScan: boolean = true,
   timeout: number = 2000,
   onProgress?: (current: number, total: number) => void

[Killed] ArithmeticOperator
extension/src/background-logic.ts:118:22
   timeout: number = 2000,
   onProgress?: (current: number, total: number) => void
 ): Promise<number | null> {
-  const totalPorts = maxPort - defaultPort + 1;
+  const totalPorts = maxPort - defaultPort - 1;
   let scannedPorts = 0;
 
killedBy: Background Logic: discoverServerPort should scan ports when no cached port exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 5001

Number of calls: 0

[Timeout] ArithmeticOperator
extension/src/background-logic.ts:118:22
   timeout: number = 2000,
   onProgress?: (current: number, total: number) => void
 ): Promise<number | null> {
-  const totalPorts = maxPort - defaultPort + 1;
+  const totalPorts = maxPort + defaultPort + 1;
   let scannedPorts = 0;
 

[Killed] ConditionalExpression
extension/src/background-logic.ts:122:7
   let scannedPorts = 0;
 
   // Try cached port if not forcing scan
-  if (!startScan) {
+  if (false) {
     const cached = await storageService.getPort();
     if (cached !== null) {
killedBy: Background Logic: discoverServerPort should return cached port if it's still valid
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
extension/src/background-logic.ts:122:19
   let scannedPorts = 0;
 
   // Try cached port if not forcing scan
-  if (!startScan) {
-    const cached = await storageService.getPort();
-    if (cached !== null) {
-      try {
-        const ok = await Promise.race([
-          checkStatus(cached),
-          new Promise<boolean>((_, reject) =>
-            setTimeout(() => reject(new Error("Timeout")), timeout)
-          ),
-        ]);
-        if (ok) {
-          return cached;
-        }
-      } catch (error) {
-        // Cached port failed, continue to scan
-      }
-      // Expire cached port
-      if (storageService.setPort) {
-        await storageService.setPort(null);
-      }
-    }
-  }
+  if (!startScan) {}
 
   // Scan port range with timeout and parallel checking for efficiency
killedBy: Background Logic: discoverServerPort should return cached port if it's still valid
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
extension/src/background-logic.ts:124:26
   // Try cached port if not forcing scan
   if (!startScan) {
     const cached = await storageService.getPort();
-    if (cached !== null) {
-      try {
-        const ok = await Promise.race([
-          checkStatus(cached),
-          new Promise<boolean>((_, reject) =>
-            setTimeout(() => reject(new Error("Timeout")), timeout)
-          ),
-        ]);
-        if (ok) {
-          return cached;
-        }
-      } catch (error) {
-        // Cached port failed, continue to scan
-      }
-      // Expire cached port
-      if (storageService.setPort) {
-        await storageService.setPort(null);
-      }
-    }
+    if (cached !== null) {}
   }
 
killedBy: Background Logic: discoverServerPort should return cached port if it's still valid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 5013
Received
       1: 5001
       2: 5002
       3: 5003

[Killed] ConditionalExpression
extension/src/background-logic.ts:124:9
   // Try cached port if not forcing scan
   if (!startScan) {
     const cached = await storageService.getPort();
-    if (cached !== null) {
+    if (true) {
       try {
         const ok = await Promise.race([
killedBy: Background Logic: discoverServerPort should scan ports when no cached port exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5002
Received: 5001

[Killed] BlockStatement
extension/src/background-logic.ts:125:11
   if (!startScan) {
     const cached = await storageService.getPort();
     if (cached !== null) {
-      try {
-        const ok = await Promise.race([
-          checkStatus(cached),
-          new Promise<boolean>((_, reject) =>
-            setTimeout(() => reject(new Error("Timeout")), timeout)
-          ),
-        ]);
-        if (ok) {
-          return cached;
-        }
-      } catch (error) {
+      try {} catch (error) {
         // Cached port failed, continue to scan
       }
killedBy: Background Logic: discoverServerPort should return cached port if it's still valid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 5013
Received
       1: 5001
       2: 5002
       3: 5003

[Timeout] ArrayDeclaration
extension/src/background-logic.ts:126:39
     const cached = await storageService.getPort();
     if (cached !== null) {
       try {
-        const ok = await Promise.race([
-          checkStatus(cached),
-          new Promise<boolean>((_, reject) =>
-            setTimeout(() => reject(new Error("Timeout")), timeout)
-          ),
-        ]);
+        const ok = await Promise.race([]);
         if (ok) {
           return cached;

[Survived] ArrowFunction
extension/src/background-logic.ts:128:32
       try {
         const ok = await Promise.race([
           checkStatus(cached),
-          new Promise<boolean>((_, reject) =>
-            setTimeout(() => reject(new Error("Timeout")), timeout)
+          new Promise<boolean>(() => undefined
           ),
         ]);

[Survived] ArrowFunction
extension/src/background-logic.ts:129:24
         const ok = await Promise.race([
           checkStatus(cached),
           new Promise<boolean>((_, reject) =>
-            setTimeout(() => reject(new Error("Timeout")), timeout)
+            setTimeout(() => undefined, timeout)
           ),
         ]);

[Killed] BlockStatement
extension/src/background-logic.ts:132:17
             setTimeout(() => reject(new Error("Timeout")), timeout)
           ),
         ]);
-        if (ok) {
-          return cached;
-        }
+        if (ok) {}
       } catch (error) {
         // Cached port failed, continue to scan
killedBy: Background Logic: discoverServerPort should return cached port if it's still valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5013
Received: 5001

[Killed] ConditionalExpression
extension/src/background-logic.ts:132:13
             setTimeout(() => reject(new Error("Timeout")), timeout)
           ),
         ]);
-        if (ok) {
+        if (false) {
           return cached;
         }
killedBy: Background Logic: discoverServerPort should return cached port if it's still valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5013
Received: 5001

[Killed] ConditionalExpression
extension/src/background-logic.ts:139:11
         // Cached port failed, continue to scan
       }
       // Expire cached port
-      if (storageService.setPort) {
+      if (false) {
         await storageService.setPort(null);
       }
killedBy: discoverServerPort scans all ports when cached invalid and caches discovered port
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: null
Received: 9090

Number of calls: 1

[Killed] BlockStatement
extension/src/background-logic.ts:139:35
         // Cached port failed, continue to scan
       }
       // Expire cached port
-      if (storageService.setPort) {
-        await storageService.setPort(null);
-      }
+      if (storageService.setPort) {}
     }
   }
killedBy: Background Logic: discoverServerPort should clear cached port if it's no longer valid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: null

Number of calls: 0

[Killed] ArrowFunction
extension/src/background-logic.ts:148:5
   // Scan port range with timeout and parallel checking for efficiency
   const portRange = Array.from(
     { length: totalPorts },
-    (_, i) => defaultPort + i
+    () => undefined
   );
 
killedBy: Background Script - Core Functions Port Discovery findServerPort should return port when server is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9090
Received: null

[Killed] ArithmeticOperator
extension/src/background-logic.ts:148:15
   // Scan port range with timeout and parallel checking for efficiency
   const portRange = Array.from(
     { length: totalPorts },
-    (_, i) => defaultPort + i
+    (_, i) => defaultPort - i
   );
 
killedBy: Background Logic: discoverServerPort should scan ports when no cached port exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 5002
Received
       1: 5001
       2: 5000

Number of calls: 2

[Killed] ConditionalExpression
extension/src/background-logic.ts:153:19
 
   // Check ports in batches to avoid overwhelming the system
   const batchSize = 5;
-  for (let i = 0; i < portRange.length; i += batchSize) {
+  for (let i = 0; false; i += batchSize) {
     const batch = portRange.slice(i, i + batchSize);
 
killedBy: Background Script - Core Functions Port Discovery findServerPort should return port when server is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9090
Received: null

[Survived] EqualityOperator
extension/src/background-logic.ts:153:19
 
   // Check ports in batches to avoid overwhelming the system
   const batchSize = 5;
-  for (let i = 0; i < portRange.length; i += batchSize) {
+  for (let i = 0; i <= portRange.length; i += batchSize) {
     const batch = portRange.slice(i, i + batchSize);
 

[Killed] ArithmeticOperator
extension/src/background-logic.ts:154:38
   // Check ports in batches to avoid overwhelming the system
   const batchSize = 5;
   for (let i = 0; i < portRange.length; i += batchSize) {
-    const batch = portRange.slice(i, i + batchSize);
+    const batch = portRange.slice(i, i - batchSize);
 
     // Check ports in parallel within the batch
killedBy: Background Logic: discoverServerPort should scan ports when no cached port exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 5001

Number of calls: 0

[Killed] MethodExpression
extension/src/background-logic.ts:154:19
   // Check ports in batches to avoid overwhelming the system
   const batchSize = 5;
   for (let i = 0; i < portRange.length; i += batchSize) {
-    const batch = portRange.slice(i, i + batchSize);
+    const batch = portRange;
 
     // Check ports in parallel within the batch
killedBy: Background Logic: discoverServerPort should handle batch processing with remainder ports
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 7
Received number of calls: 14

[Killed] BlockStatement
extension/src/background-logic.ts:157:48
     const batch = portRange.slice(i, i + batchSize);
 
     // Check ports in parallel within the batch
-    const promises = batch.map(async (port) => {
-      try {
-        const isAvailable = await Promise.race([
-          checkStatus(port),
-          new Promise<boolean>((_, reject) =>
-            setTimeout(() => reject(new Error("Timeout")), timeout)
-          ),
-        ]);
-        return isAvailable ? port : null;
-      } catch {
-        return null;
-      }
-    });
+    const promises = batch.map(async (port) => {});
 
     const results = await Promise.all(promises);
killedBy: Background Script - Core Functions Port Discovery findServerPort should return port when server is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9090
Received: null

[Killed] BlockStatement
extension/src/background-logic.ts:158:11
 
     // Check ports in parallel within the batch
     const promises = batch.map(async (port) => {
-      try {
-        const isAvailable = await Promise.race([
-          checkStatus(port),
-          new Promise<boolean>((_, reject) =>
-            setTimeout(() => reject(new Error("Timeout")), timeout)
-          ),
-        ]);
-        return isAvailable ? port : null;
-      } catch {
+      try {} catch {
         return null;
       }
killedBy: Background Logic: discoverServerPort should scan ports when no cached port exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 5001

Number of calls: 0

[Timeout] ArrayDeclaration
extension/src/background-logic.ts:159:48
     // Check ports in parallel within the batch
     const promises = batch.map(async (port) => {
       try {
-        const isAvailable = await Promise.race([
-          checkStatus(port),
-          new Promise<boolean>((_, reject) =>
-            setTimeout(() => reject(new Error("Timeout")), timeout)
-          ),
-        ]);
+        const isAvailable = await Promise.race([]);
         return isAvailable ? port : null;
       } catch {

[Survived] ArrowFunction
extension/src/background-logic.ts:161:32
       try {
         const isAvailable = await Promise.race([
           checkStatus(port),
-          new Promise<boolean>((_, reject) =>
-            setTimeout(() => reject(new Error("Timeout")), timeout)
+          new Promise<boolean>(() => undefined
           ),
         ]);

[NoCoverage] StringLiteral
extension/src/background-logic.ts:162:47
         const isAvailable = await Promise.race([
           checkStatus(port),
           new Promise<boolean>((_, reject) =>
-            setTimeout(() => reject(new Error("Timeout")), timeout)
+            setTimeout(() => reject(new Error("")), timeout)
           ),
         ]);

[Survived] BlockStatement
extension/src/background-logic.ts:166:15
           ),
         ]);
         return isAvailable ? port : null;
-      } catch {
-        return null;
-      }
+      } catch {}
     });
 

[Killed] ConditionalExpression
extension/src/background-logic.ts:172:46
     });
 
     const results = await Promise.all(promises);
-    const foundPort = results.find((port) => port !== null);
+    const foundPort = results.find((port) => true);
 
     if (foundPort !== null && foundPort !== undefined) {
killedBy: Background Logic: discoverServerPort should scan ports when no cached port exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5002
Received: null

[Killed] ConditionalExpression
extension/src/background-logic.ts:172:46
     });
 
     const results = await Promise.all(promises);
-    const foundPort = results.find((port) => port !== null);
+    const foundPort = results.find((port) => false);
 
     if (foundPort !== null && foundPort !== undefined) {
killedBy: Background Script - Core Functions Port Discovery findServerPort should return port when server is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9090
Received: null

[Killed] BlockStatement
extension/src/background-logic.ts:174:56
     const results = await Promise.all(promises);
     const foundPort = results.find((port) => port !== null);
 
-    if (foundPort !== null && foundPort !== undefined) {
-      // Cache discovered port
-      if (storageService.setPort) {
-        await storageService.setPort(foundPort);
-      }
-      return foundPort;
-    }
+    if (foundPort !== null && foundPort !== undefined) {}
 
     // Update progress
killedBy: Background Logic: discoverServerPort should scan ports when no cached port exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5002
Received: null

[Killed] EqualityOperator
extension/src/background-logic.ts:174:9
     const results = await Promise.all(promises);
     const foundPort = results.find((port) => port !== null);
 
-    if (foundPort !== null && foundPort !== undefined) {
+    if (foundPort === null && foundPort !== undefined) {
       // Cache discovered port
       if (storageService.setPort) {
killedBy: discoverServerPort scans all ports when cached invalid and caches discovered port
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9090
Received: null

[Killed] ConditionalExpression
extension/src/background-logic.ts:176:11
 
     if (foundPort !== null && foundPort !== undefined) {
       // Cache discovered port
-      if (storageService.setPort) {
+      if (false) {
         await storageService.setPort(foundPort);
       }
killedBy: discoverServerPort scans all ports when cached invalid and caches discovered port
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 9090
Received: null

Number of calls: 1

[Killed] BlockStatement
extension/src/background-logic.ts:176:35
 
     if (foundPort !== null && foundPort !== undefined) {
       // Cache discovered port
-      if (storageService.setPort) {
-        await storageService.setPort(foundPort);
-      }
+      if (storageService.setPort) {}
       return foundPort;
     }
killedBy: discoverServerPort scans all ports when cached invalid and caches discovered port
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 9090
Received: null

Number of calls: 1

[Survived] AssignmentOperator
extension/src/background-logic.ts:183:5
     }
 
     // Update progress
-    scannedPorts += batch.length;
+    scannedPorts -= batch.length;
     if (onProgress) {
       onProgress(scannedPorts, totalPorts);

[Killed] BlockStatement
extension/src/background-logic.ts:184:21
 
     // Update progress
     scannedPorts += batch.length;
-    if (onProgress) {
-      onProgress(scannedPorts, totalPorts);
-    }
+    if (onProgress) {}
   }
 
killedBy: Background Logic: discoverServerPort should call onProgress callback during scanning
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
extension/src/background-logic.ts:184:9
 
     // Update progress
     scannedPorts += batch.length;
-    if (onProgress) {
+    if (false) {
       onProgress(scannedPorts, totalPorts);
     }
killedBy: Background Logic: discoverServerPort should call onProgress callback during scanning
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
