[NoCoverage] EqualityOperator
extension/src/background.ts:63:34
 // Initialize background script when loaded (skip in Jest)
 const isTestEnvironment =
   typeof process !== "undefined" &&
-  (process.env.JEST_WORKER_ID || process.env.NODE_ENV === "test");
+  (process.env.JEST_WORKER_ID || process.env.NODE_ENV !== "test");
 // --- END CONSTANTS AND STORAGE KEYS ---
 

[NoCoverage] ConditionalExpression
extension/src/background.ts:63:34
 // Initialize background script when loaded (skip in Jest)
 const isTestEnvironment =
   typeof process !== "undefined" &&
-  (process.env.JEST_WORKER_ID || process.env.NODE_ENV === "test");
+  (process.env.JEST_WORKER_ID || false);
 // --- END CONSTANTS AND STORAGE KEYS ---
 

[Killed] BlockStatement
extension/src/background.ts:67:39
 // --- END CONSTANTS AND STORAGE KEYS ---
 
 // Utility logging functions - now using centralized logger
-const log = (...args: any[]): void => {
-  logger.info(args.join(" "), { component: "background" });
-};
+const log = (...args: any[]): void => {};
 const warn = (...args: any[]): void => {
   logger.warn(args.join(" "), { component: "background" });
killedBy: log, warn, error log calls logger.info with background component
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "hello", {"component": "background"}

Number of calls: 0

[Survived] StringLiteral
extension/src/background.ts:68:25
 
 // Utility logging functions - now using centralized logger
 const log = (...args: any[]): void => {
-  logger.info(args.join(" "), { component: "background" });
+  logger.info(args.join(""), { component: "background" });
 };
 const warn = (...args: any[]): void => {

[Killed] BlockStatement
extension/src/background.ts:70:40
 const log = (...args: any[]): void => {
   logger.info(args.join(" "), { component: "background" });
 };
-const warn = (...args: any[]): void => {
-  logger.warn(args.join(" "), { component: "background" });
-};
+const warn = (...args: any[]): void => {};
 const error = (...args: any[]): void => {
   logger.error(args.join(" "), { component: "background" });
killedBy: log, warn, error warn calls logger.warn with background component
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "warn", {"component": "background"}

Number of calls: 0

[Killed] BlockStatement
extension/src/background.ts:73:41
 const warn = (...args: any[]): void => {
   logger.warn(args.join(" "), { component: "background" });
 };
-const error = (...args: any[]): void => {
-  logger.error(args.join(" "), { component: "background" });
-};
+const error = (...args: any[]): void => {};
 
 // --- START SERVICE IMPLEMENTATIONS ---
killedBy: log, warn, error error calls logger.error with background component
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "oops", {"component": "background"}

Number of calls: 0

[Killed] StringLiteral
extension/src/background.ts:74:45
   logger.warn(args.join(" "), { component: "background" });
 };
 const error = (...args: any[]): void => {
-  logger.error(args.join(" "), { component: "background" });
+  logger.error(args.join(" "), { component: "" });
 };
 
killedBy: log, warn, error error calls logger.error with background component
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "oops",
  Object {
-   "component": "background",

[NoCoverage] BlockStatement
extension/src/background.ts:80:67
 // --- START SERVICE IMPLEMENTATIONS ---
 
 const apiService: ApiService = {
-  async fetchConfig(port: number): Promise<Partial<ServerConfig>> {
-    const response = await fetch("http://127.0.0.1:" + port + "/api/config");
-    if (!response.ok) {
-      throw new Error(
-        "Failed to fetch config from server: " + response.statusText
-      );
-    }
-    return response.json();
-  },
+  async fetchConfig(port: number): Promise<Partial<ServerConfig>> {},
   async saveConfig(
     port: number,

[NoCoverage] BooleanLiteral
extension/src/background.ts:82:9
 const apiService: ApiService = {
   async fetchConfig(port: number): Promise<Partial<ServerConfig>> {
     const response = await fetch("http://127.0.0.1:" + port + "/api/config");
-    if (!response.ok) {
+    if (response.ok) {
       throw new Error(
         "Failed to fetch config from server: " + response.statusText

[NoCoverage] ConditionalExpression
extension/src/background.ts:82:9
 const apiService: ApiService = {
   async fetchConfig(port: number): Promise<Partial<ServerConfig>> {
     const response = await fetch("http://127.0.0.1:" + port + "/api/config");
-    if (!response.ok) {
+    if (true) {
       throw new Error(
         "Failed to fetch config from server: " + response.statusText

[NoCoverage] BlockStatement
extension/src/background.ts:92:23
   async saveConfig(
     port: number,
     config: Partial<ServerConfig>
-  ): Promise<boolean> {
-    const response = await fetch("http://127.0.0.1:" + port + "/api/config", {
-      method: "POST",
-      headers: { "Content-Type": "application/json" },
-      body: JSON.stringify(config),
-    });
-    return response.ok;
-  },
+  ): Promise<boolean> {},
 };
 

[NoCoverage] StringLiteral
extension/src/background.ts:93:63
     port: number,
     config: Partial<ServerConfig>
   ): Promise<boolean> {
-    const response = await fetch("http://127.0.0.1:" + port + "/api/config", {
+    const response = await fetch("http://127.0.0.1:" + port + "", {
       method: "POST",
       headers: { "Content-Type": "application/json" },

[NoCoverage] BlockStatement
extension/src/background.ts:103:53
 };
 
 const storageService: StorageService = {
-  async getConfig(): Promise<Partial<ServerConfig>> {
-    const result = await chrome.storage.local.get(_configStorageKey);
-    return result[_configStorageKey] || {};
-  },
+  async getConfig(): Promise<Partial<ServerConfig>> {},
   async setConfig(config: Partial<ServerConfig>): Promise<void> {
     const currentConfig = await this.getConfig();

[NoCoverage] LogicalOperator
extension/src/background.ts:105:12
 const storageService: StorageService = {
   async getConfig(): Promise<Partial<ServerConfig>> {
     const result = await chrome.storage.local.get(_configStorageKey);
-    return result[_configStorageKey] || {};
+    return result[_configStorageKey] && {};
   },
   async setConfig(config: Partial<ServerConfig>): Promise<void> {

[NoCoverage] ConditionalExpression
extension/src/background.ts:105:12
 const storageService: StorageService = {
   async getConfig(): Promise<Partial<ServerConfig>> {
     const result = await chrome.storage.local.get(_configStorageKey);
-    return result[_configStorageKey] || {};
+    return true;
   },
   async setConfig(config: Partial<ServerConfig>): Promise<void> {

[NoCoverage] BlockStatement
extension/src/background.ts:107:65
     const result = await chrome.storage.local.get(_configStorageKey);
     return result[_configStorageKey] || {};
   },
-  async setConfig(config: Partial<ServerConfig>): Promise<void> {
-    const currentConfig = await this.getConfig();
-    const newConfig = { ...currentConfig, ...config };
-    return chrome.storage.local.set({ [_configStorageKey]: newConfig });
-  },
+  async setConfig(config: Partial<ServerConfig>): Promise<void> {},
   async getPort(): Promise<number | null> {
     const result = await chrome.storage.local.get(_portStorageKey);

[NoCoverage] ObjectLiteral
extension/src/background.ts:109:23
   },
   async setConfig(config: Partial<ServerConfig>): Promise<void> {
     const currentConfig = await this.getConfig();
-    const newConfig = { ...currentConfig, ...config };
+    const newConfig = {};
     return chrome.storage.local.set({ [_configStorageKey]: newConfig });
   },

[Survived] BlockStatement
extension/src/background.ts:112:43
     const newConfig = { ...currentConfig, ...config };
     return chrome.storage.local.set({ [_configStorageKey]: newConfig });
   },
-  async getPort(): Promise<number | null> {
-    const result = await chrome.storage.local.get(_portStorageKey);
-    return result[_portStorageKey] || null;
-  },
+  async getPort(): Promise<number | null> {},
   async setPort(port: number | null): Promise<void> {
     try {

[Killed] ConditionalExpression
extension/src/background.ts:114:12
   },
   async getPort(): Promise<number | null> {
     const result = await chrome.storage.local.get(_portStorageKey);
-    return result[_portStorageKey] || null;
+    return true;
   },
   async setPort(port: number | null): Promise<void> {
killedBy: Background Script - Core Functions Port Discovery findServerPort should return port when server is found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9090
Received: true

[Survived] ConditionalExpression
extension/src/background.ts:114:12
   },
   async getPort(): Promise<number | null> {
     const result = await chrome.storage.local.get(_portStorageKey);
-    return result[_portStorageKey] || null;
+    return false;
   },
   async setPort(port: number | null): Promise<void> {

[Survived] BlockStatement
extension/src/background.ts:116:53
     const result = await chrome.storage.local.get(_portStorageKey);
     return result[_portStorageKey] || null;
   },
-  async setPort(port: number | null): Promise<void> {
-    try {
-      await chrome.storage.local.set({ [_portStorageKey]: port });
-    } catch (e) {
-      warn("Failed to cache server port:", e);
-    }
-  },
+  async setPort(port: number | null): Promise<void> {},
   async getHistory(): Promise<HistoryEntry[]> {
     const result = await chrome.storage.local.get({ [_historyStorageKey]: [] });

[Survived] BlockStatement
extension/src/background.ts:117:9
     return result[_portStorageKey] || null;
   },
   async setPort(port: number | null): Promise<void> {
-    try {
-      await chrome.storage.local.set({ [_portStorageKey]: port });
-    } catch (e) {
+    try {} catch (e) {
       warn("Failed to cache server port:", e);
     }

[Survived] ObjectLiteral
extension/src/background.ts:118:38
   },
   async setPort(port: number | null): Promise<void> {
     try {
-      await chrome.storage.local.set({ [_portStorageKey]: port });
+      await chrome.storage.local.set({});
     } catch (e) {
       warn("Failed to cache server port:", e);

[NoCoverage] BlockStatement
extension/src/background.ts:119:17
   async setPort(port: number | null): Promise<void> {
     try {
       await chrome.storage.local.set({ [_portStorageKey]: port });
-    } catch (e) {
-      warn("Failed to cache server port:", e);
-    }
+    } catch (e) {}
   },
   async getHistory(): Promise<HistoryEntry[]> {

[NoCoverage] StringLiteral
extension/src/background.ts:120:12
     try {
       await chrome.storage.local.set({ [_portStorageKey]: port });
     } catch (e) {
-      warn("Failed to cache server port:", e);
+      warn("", e);
     }
   },

[NoCoverage] BlockStatement
extension/src/background.ts:123:47
       warn("Failed to cache server port:", e);
     }
   },
-  async getHistory(): Promise<HistoryEntry[]> {
-    const result = await chrome.storage.local.get({ [_historyStorageKey]: [] });
-    return result[_historyStorageKey];
-  },
+  async getHistory(): Promise<HistoryEntry[]> {},
   async clearHistory(): Promise<void> {
     return chrome.storage.local.set({ [_historyStorageKey]: [] });

[NoCoverage] BlockStatement
extension/src/background.ts:127:39
     const result = await chrome.storage.local.get({ [_historyStorageKey]: [] });
     return result[_historyStorageKey];
   },
-  async clearHistory(): Promise<void> {
-    return chrome.storage.local.set({ [_historyStorageKey]: [] });
-  },
+  async clearHistory(): Promise<void> {},
 };
 

[NoCoverage] ArrayDeclaration
extension/src/background.ts:128:61
     return result[_historyStorageKey];
   },
   async clearHistory(): Promise<void> {
-    return chrome.storage.local.set({ [_historyStorageKey]: [] });
+    return chrome.storage.local.set({ [_historyStorageKey]: ["Stryker was here"] });
   },
 };

[NoCoverage] BlockStatement
extension/src/background.ts:137:7
 // --- START NETWORK STATUS MONITORING ---
 /** Handle changes in network connectivity */
 const handleNetworkChange = async (online: boolean): Promise<void> => {
-  try {
-    await chrome.storage.local.set({ [networkStatusKey]: online });
-  } catch (err) {
+  try {} catch (err) {
     log("Failed to update network status in storage:", err);
   }

[NoCoverage] ObjectLiteral
extension/src/background.ts:138:36
 /** Handle changes in network connectivity */
 const handleNetworkChange = async (online: boolean): Promise<void> => {
   try {
-    await chrome.storage.local.set({ [networkStatusKey]: online });
+    await chrome.storage.local.set({});
   } catch (err) {
     log("Failed to update network status in storage:", err);

[NoCoverage] BlockStatement
extension/src/background.ts:139:17
 const handleNetworkChange = async (online: boolean): Promise<void> => {
   try {
     await chrome.storage.local.set({ [networkStatusKey]: online });
-  } catch (err) {
-    log("Failed to update network status in storage:", err);
-  }
+  } catch (err) {}
 
   // Notify the user

[NoCoverage] StringLiteral
extension/src/background.ts:140:9
   try {
     await chrome.storage.local.set({ [networkStatusKey]: online });
   } catch (err) {
-    log("Failed to update network status in storage:", err);
+    log("", err);
   }
 

[NoCoverage] ConditionalExpression
extension/src/background.ts:144:7
   }
 
   // Notify the user
-  if (online) {
+  if (false) {
     showNotification(
       "Network Connected",

[NoCoverage] ConditionalExpression
extension/src/background.ts:144:7
   }
 
   // Notify the user
-  if (online) {
+  if (true) {
     showNotification(
       "Network Connected",

[NoCoverage] StringLiteral
extension/src/background.ts:147:7
   if (online) {
     showNotification(
       "Network Connected",
-      "Browser is back online. Extension functions are restored."
+      ""
     );
     // Automatically attempt server reconnection on network restore

[NoCoverage] BlockStatement
extension/src/background.ts:152:49
     // Automatically attempt server reconnection on network restore
     try {
       // Show scanning indicator
-      if ((chrome.action as any)?.setBadgeText) {
-        try {
-          (chrome.action as any).setBadgeBackgroundColor({
-            color: "#ffc107",
-          });
-          (chrome.action as any).setBadgeText({ text: "SCAN" }); // Use plain ASCII string
-        } catch (e) {
-          /* ignore errors setting badge */
-        }
-      }
+      if ((chrome.action as any)?.setBadgeText) {}
 
       const port = await findServerPort(true);

[NoCoverage] OptionalChaining
extension/src/background.ts:152:11
     // Automatically attempt server reconnection on network restore
     try {
       // Show scanning indicator
-      if ((chrome.action as any)?.setBadgeText) {
+      if ((chrome.action as any).setBadgeText) {
         try {
           (chrome.action as any).setBadgeBackgroundColor({

[NoCoverage] BlockStatement
extension/src/background.ts:153:13
     try {
       // Show scanning indicator
       if ((chrome.action as any)?.setBadgeText) {
-        try {
-          (chrome.action as any).setBadgeBackgroundColor({
-            color: "#ffc107",
-          });
-          (chrome.action as any).setBadgeText({ text: "SCAN" }); // Use plain ASCII string
-        } catch (e) {
+        try {} catch (e) {
           /* ignore errors setting badge */
         }

[NoCoverage] ObjectLiteral
extension/src/background.ts:154:58
       // Show scanning indicator
       if ((chrome.action as any)?.setBadgeText) {
         try {
-          (chrome.action as any).setBadgeBackgroundColor({
-            color: "#ffc107",
-          });
+          (chrome.action as any).setBadgeBackgroundColor({});
           (chrome.action as any).setBadgeText({ text: "SCAN" }); // Use plain ASCII string
         } catch (e) {

[NoCoverage] BooleanLiteral
extension/src/background.ts:163:41
         }
       }
 
-      const port = await findServerPort(true);
+      const port = await findServerPort(false);
       if (port !== null) {
         log("Server reconnected on port " + port);

[NoCoverage] EqualityOperator
extension/src/background.ts:164:11
       }
 
       const port = await findServerPort(true);
-      if (port !== null) {
+      if (port === null) {
         log("Server reconnected on port " + port);
         showNotification(

[NoCoverage] BlockStatement
extension/src/background.ts:164:26
       }
 
       const port = await findServerPort(true);
-      if (port !== null) {
-        log("Server reconnected on port " + port);
-        showNotification(
-          "Server Reconnected",
-          "Enhanced Video Downloader server is back online on port " +
-            port +
-            "."
-        );
-        // Broadcast server status after reconnection
-        broadcastServerStatus();
-      } else {
+      if (port !== null) {} else {
         log("Server reconnection failed upon network restore.");
         showNotification(

[NoCoverage] StringLiteral
extension/src/background.ts:168:11
         log("Server reconnected on port " + port);
         showNotification(
           "Server Reconnected",
-          "Enhanced Video Downloader server is back online on port " +
+          "" +
             port +
             "."

[NoCoverage] StringLiteral
extension/src/background.ts:170:13
           "Server Reconnected",
           "Enhanced Video Downloader server is back online on port " +
             port +
-            "."
+            ""
         );
         // Broadcast server status after reconnection

[NoCoverage] BlockStatement
extension/src/background.ts:174:14
         );
         // Broadcast server status after reconnection
         broadcastServerStatus();
-      } else {
-        log("Server reconnection failed upon network restore.");
-        showNotification(
-          "Server Unavailable",
-          "Could not reconnect to the Enhanced Video Downloader server. Please check if it's running."
-        );
-        // Broadcast disconnected status
-        broadcastServerStatus();
-      }
+      } else {}
     } catch (reconnectErr) {
       log("Error during server reconnection attempt:", reconnectErr);

[NoCoverage] StringLiteral
extension/src/background.ts:178:11
         log("Server reconnection failed upon network restore.");
         showNotification(
           "Server Unavailable",
-          "Could not reconnect to the Enhanced Video Downloader server. Please check if it's running."
+          ""
         );
         // Broadcast disconnected status

[NoCoverage] BlockStatement
extension/src/background.ts:183:28
         // Broadcast disconnected status
         broadcastServerStatus();
       }
-    } catch (reconnectErr) {
-      log("Error during server reconnection attempt:", reconnectErr);
-    }
+    } catch (reconnectErr) {}
   } else {
     showNotification(

[NoCoverage] StringLiteral
extension/src/background.ts:184:11
         broadcastServerStatus();
       }
     } catch (reconnectErr) {
-      log("Error during server reconnection attempt:", reconnectErr);
+      log("", reconnectErr);
     }
   } else {

[NoCoverage] BlockStatement
extension/src/background.ts:186:10
     } catch (reconnectErr) {
       log("Error during server reconnection attempt:", reconnectErr);
     }
-  } else {
-    showNotification(
-      "Network Disconnected",
-      "Browser is offline. Download functionality may be unavailable."
-    );
-
-    // Persist current state when going offline
-    try {
-      await persistQueue();
-      // Also persist active downloads
-      await chrome.storage.local.set({
-        activeDownloads: activeDownloads,
-      });
-      log("Persisted queue and active downloads due to network disconnect");
-    } catch (persistErr) {
-      warn("Failed to persist state during network disconnect:", persistErr);
-    }
-
-    // Broadcast disconnected status when going offline
-    broadcastServerStatus();
-  }
+  } else {}
 };
 // Initialize network status in storage

[NoCoverage] StringLiteral
extension/src/background.ts:188:7
     }
   } else {
     showNotification(
-      "Network Disconnected",
+      "",
       "Browser is offline. Download functionality may be unavailable."
     );

[NoCoverage] BlockStatement
extension/src/background.ts:193:9
     );
 
     // Persist current state when going offline
-    try {
-      await persistQueue();
-      // Also persist active downloads
-      await chrome.storage.local.set({
-        activeDownloads: activeDownloads,
-      });
-      log("Persisted queue and active downloads due to network disconnect");
-    } catch (persistErr) {
+    try {} catch (persistErr) {
       warn("Failed to persist state during network disconnect:", persistErr);
     }

[NoCoverage] BlockStatement
extension/src/background.ts:200:26
         activeDownloads: activeDownloads,
       });
       log("Persisted queue and active downloads due to network disconnect");
-    } catch (persistErr) {
-      warn("Failed to persist state during network disconnect:", persistErr);
-    }
+    } catch (persistErr) {}
 
     // Broadcast disconnected status when going offline

[NoCoverage] StringLiteral
extension/src/background.ts:201:12
       });
       log("Persisted queue and active downloads due to network disconnect");
     } catch (persistErr) {
-      warn("Failed to persist state during network disconnect:", persistErr);
+      warn("", persistErr);
     }
 

[NoCoverage] BlockStatement
extension/src/background.ts:209:25
   }
 };
 // Initialize network status in storage
-if (!isTestEnvironment) {
-  chrome.storage.local.get(networkStatusKey, (res) => {
-    const current =
-      typeof res[networkStatusKey] === "boolean"
-        ? res[networkStatusKey]
-        : navigator.onLine;
-    handleNetworkChange(current);
-  });
-  // Listen for browser online/offline events
-  try {
-    self.addEventListener("online", () => handleNetworkChange(true));
-    self.addEventListener("offline", () => handleNetworkChange(false));
-    log("Registered network connectivity listeners");
-  } catch (e) {
-    warn("Could not register network status listeners:", e);
-  }
-}
+if (!isTestEnvironment) {}
 // --- END NETWORK STATUS MONITORING ---
 

[NoCoverage] BlockStatement
extension/src/background.ts:210:55
 };
 // Initialize network status in storage
 if (!isTestEnvironment) {
-  chrome.storage.local.get(networkStatusKey, (res) => {
-    const current =
-      typeof res[networkStatusKey] === "boolean"
-        ? res[networkStatusKey]
-        : navigator.onLine;
-    handleNetworkChange(current);
-  });
+  chrome.storage.local.get(networkStatusKey, (res) => {});
   // Listen for browser online/offline events
   try {

[NoCoverage] EqualityOperator
extension/src/background.ts:212:7
 if (!isTestEnvironment) {
   chrome.storage.local.get(networkStatusKey, (res) => {
     const current =
-      typeof res[networkStatusKey] === "boolean"
+      typeof res[networkStatusKey] !== "boolean"
         ? res[networkStatusKey]
         : navigator.onLine;

[NoCoverage] ConditionalExpression
extension/src/background.ts:212:7
 if (!isTestEnvironment) {
   chrome.storage.local.get(networkStatusKey, (res) => {
     const current =
-      typeof res[networkStatusKey] === "boolean"
+      true
         ? res[networkStatusKey]
         : navigator.onLine;

[NoCoverage] BlockStatement
extension/src/background.ts:218:7
     handleNetworkChange(current);
   });
   // Listen for browser online/offline events
-  try {
-    self.addEventListener("online", () => handleNetworkChange(true));
-    self.addEventListener("offline", () => handleNetworkChange(false));
-    log("Registered network connectivity listeners");
-  } catch (e) {
+  try {} catch (e) {
     warn("Could not register network status listeners:", e);
   }

[NoCoverage] ArrowFunction
extension/src/background.ts:219:37
   });
   // Listen for browser online/offline events
   try {
-    self.addEventListener("online", () => handleNetworkChange(true));
+    self.addEventListener("online", () => undefined);
     self.addEventListener("offline", () => handleNetworkChange(false));
     log("Registered network connectivity listeners");

[NoCoverage] BooleanLiteral
extension/src/background.ts:219:63
   });
   // Listen for browser online/offline events
   try {
-    self.addEventListener("online", () => handleNetworkChange(true));
+    self.addEventListener("online", () => handleNetworkChange(false));
     self.addEventListener("offline", () => handleNetworkChange(false));
     log("Registered network connectivity listeners");

[NoCoverage] BooleanLiteral
extension/src/background.ts:220:64
   // Listen for browser online/offline events
   try {
     self.addEventListener("online", () => handleNetworkChange(true));
-    self.addEventListener("offline", () => handleNetworkChange(false));
+    self.addEventListener("offline", () => handleNetworkChange(true));
     log("Registered network connectivity listeners");
   } catch (e) {

[NoCoverage] ArrowFunction
extension/src/background.ts:220:38
   // Listen for browser online/offline events
   try {
     self.addEventListener("online", () => handleNetworkChange(true));
-    self.addEventListener("offline", () => handleNetworkChange(false));
+    self.addEventListener("offline", () => undefined);
     log("Registered network connectivity listeners");
   } catch (e) {

[NoCoverage] BlockStatement
extension/src/background.ts:222:15
     self.addEventListener("online", () => handleNetworkChange(true));
     self.addEventListener("offline", () => handleNetworkChange(false));
     log("Registered network connectivity listeners");
-  } catch (e) {
-    warn("Could not register network status listeners:", e);
-  }
+  } catch (e) {}
 }
 // --- END NETWORK STATUS MONITORING ---

[Killed] BlockStatement
extension/src/background.ts:235:22
     const result = await chrome.storage.local.get("theme");
     const storedTheme = result.theme as Theme | undefined;
 
-    if (storedTheme) {
-      log("Found stored theme: " + storedTheme);
-      applyThemeToActionIcon(storedTheme);
-    } else {
+    if (storedTheme) {} else {
       log("No theme stored. Checking system preference.");
       if (typeof self !== "undefined" && self.matchMedia) {
killedBy: Background Script - Core Functions Theme Initialization initializeActionIconTheme should set theme from storage
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
extension/src/background.ts:235:9
     const result = await chrome.storage.local.get("theme");
     const storedTheme = result.theme as Theme | undefined;
 
-    if (storedTheme) {
+    if (true) {
       log("Found stored theme: " + storedTheme);
       applyThemeToActionIcon(storedTheme);
killedBy: Background Script - Core Functions Theme Initialization initializeActionIconTheme should handle system preference change listener
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] EqualityOperator
extension/src/background.ts:240:11
       applyThemeToActionIcon(storedTheme);
     } else {
       log("No theme stored. Checking system preference.");
-      if (typeof self !== "undefined" && self.matchMedia) {
+      if (typeof self === "undefined" && self.matchMedia) {
         const darkModeMediaQuery = self.matchMedia(
           "(prefers-color-scheme: dark)"
killedBy: Background Script - Core Functions Theme Initialization initializeActionIconTheme should handle system preference change listener
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
extension/src/background.ts:240:11
       applyThemeToActionIcon(storedTheme);
     } else {
       log("No theme stored. Checking system preference.");
-      if (typeof self !== "undefined" && self.matchMedia) {
+      if (false) {
         const darkModeMediaQuery = self.matchMedia(
           "(prefers-color-scheme: dark)"
killedBy: Background Script - Core Functions Theme Initialization initializeActionIconTheme should handle system preference change listener
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] StringLiteral
extension/src/background.ts:242:11
       log("No theme stored. Checking system preference.");
       if (typeof self !== "undefined" && self.matchMedia) {
         const darkModeMediaQuery = self.matchMedia(
-          "(prefers-color-scheme: dark)"
+          ""
         );
         const systemPrefersDark = darkModeMediaQuery.matches;

[Survived] StringLiteral
extension/src/background.ts:245:13
           "(prefers-color-scheme: dark)"
         );
         const systemPrefersDark = darkModeMediaQuery.matches;
-        log("System prefers dark: " + systemPrefersDark);
+        log("" + systemPrefersDark);
         applyThemeToActionIcon(systemPrefersDark ? "dark" : "light");
 

[NoCoverage] StringLiteral
extension/src/background.ts:246:52
         );
         const systemPrefersDark = darkModeMediaQuery.matches;
         log("System prefers dark: " + systemPrefersDark);
-        applyThemeToActionIcon(systemPrefersDark ? "dark" : "light");
+        applyThemeToActionIcon(systemPrefersDark ? "" : "light");
 
         // Add listener for system theme changes
