[Survived] StringLiteral
extension/src/background.ts:246:61
         );
         const systemPrefersDark = darkModeMediaQuery.matches;
         log("System prefers dark: " + systemPrefersDark);
-        applyThemeToActionIcon(systemPrefersDark ? "dark" : "light");
+        applyThemeToActionIcon(systemPrefersDark ? "dark" : "");
 
         // Add listener for system theme changes

[Survived] BlockStatement
extension/src/background.ts:249:13
         applyThemeToActionIcon(systemPrefersDark ? "dark" : "light");
 
         // Add listener for system theme changes
-        try {
-          darkModeMediaQuery.addEventListener("change", (e) => {
-            const newSystemPrefersDark = e.matches;
-            log(
-              "System theme changed, now prefers dark: " + newSystemPrefersDark
-            );
-
-            // Check if user has manually set a theme
-            chrome.storage.local.get("theme", (themeResult) => {
-              if (!themeResult.theme) {
-                // Only update automatically if user hasn't set a preference
-                applyThemeToActionIcon(newSystemPrefersDark ? "dark" : "light");
-              } else {
-                log(
-                  "Not updating theme automatically as user has set a preference."
-                );
-              }
-            });
-          });
-          log("Added listener for system theme changes");
-        } catch (listenerError) {
+        try {} catch (listenerError) {
           warn(
             "Could not add listener for system theme changes: " +

[NoCoverage] BlockStatement
extension/src/background.ts:250:64
 
         // Add listener for system theme changes
         try {
-          darkModeMediaQuery.addEventListener("change", (e) => {
-            const newSystemPrefersDark = e.matches;
-            log(
-              "System theme changed, now prefers dark: " + newSystemPrefersDark
-            );
-
-            // Check if user has manually set a theme
-            chrome.storage.local.get("theme", (themeResult) => {
-              if (!themeResult.theme) {
-                // Only update automatically if user hasn't set a preference
-                applyThemeToActionIcon(newSystemPrefersDark ? "dark" : "light");
-              } else {
-                log(
-                  "Not updating theme automatically as user has set a preference."
-                );
-              }
-            });
-          });
+          darkModeMediaQuery.addEventListener("change", (e) => {});
           log("Added listener for system theme changes");
         } catch (listenerError) {

[Survived] StringLiteral
extension/src/background.ts:250:47
 
         // Add listener for system theme changes
         try {
-          darkModeMediaQuery.addEventListener("change", (e) => {
+          darkModeMediaQuery.addEventListener("", (e) => {
             const newSystemPrefersDark = e.matches;
             log(

[NoCoverage] StringLiteral
extension/src/background.ts:253:15
           darkModeMediaQuery.addEventListener("change", (e) => {
             const newSystemPrefersDark = e.matches;
             log(
-              "System theme changed, now prefers dark: " + newSystemPrefersDark
+              "" + newSystemPrefersDark
             );
 

[NoCoverage] BlockStatement
extension/src/background.ts:257:64
             );
 
             // Check if user has manually set a theme
-            chrome.storage.local.get("theme", (themeResult) => {
-              if (!themeResult.theme) {
-                // Only update automatically if user hasn't set a preference
-                applyThemeToActionIcon(newSystemPrefersDark ? "dark" : "light");
-              } else {
-                log(
-                  "Not updating theme automatically as user has set a preference."
-                );
-              }
-            });
+            chrome.storage.local.get("theme", (themeResult) => {});
           });
           log("Added listener for system theme changes");

[NoCoverage] StringLiteral
extension/src/background.ts:257:38
             );
 
             // Check if user has manually set a theme
-            chrome.storage.local.get("theme", (themeResult) => {
+            chrome.storage.local.get("", (themeResult) => {
               if (!themeResult.theme) {
                 // Only update automatically if user hasn't set a preference

[NoCoverage] ConditionalExpression
extension/src/background.ts:258:19
 
             // Check if user has manually set a theme
             chrome.storage.local.get("theme", (themeResult) => {
-              if (!themeResult.theme) {
+              if (true) {
                 // Only update automatically if user hasn't set a preference
                 applyThemeToActionIcon(newSystemPrefersDark ? "dark" : "light");

[NoCoverage] BlockStatement
extension/src/background.ts:258:39
 
             // Check if user has manually set a theme
             chrome.storage.local.get("theme", (themeResult) => {
-              if (!themeResult.theme) {
-                // Only update automatically if user hasn't set a preference
-                applyThemeToActionIcon(newSystemPrefersDark ? "dark" : "light");
-              } else {
+              if (!themeResult.theme) {} else {
                 log(
                   "Not updating theme automatically as user has set a preference."

[NoCoverage] StringLiteral
extension/src/background.ts:260:72
             chrome.storage.local.get("theme", (themeResult) => {
               if (!themeResult.theme) {
                 // Only update automatically if user hasn't set a preference
-                applyThemeToActionIcon(newSystemPrefersDark ? "dark" : "light");
+                applyThemeToActionIcon(newSystemPrefersDark ? "dark" : "");
               } else {
                 log(

[NoCoverage] StringLiteral
extension/src/background.ts:260:63
             chrome.storage.local.get("theme", (themeResult) => {
               if (!themeResult.theme) {
                 // Only update automatically if user hasn't set a preference
-                applyThemeToActionIcon(newSystemPrefersDark ? "dark" : "light");
+                applyThemeToActionIcon(newSystemPrefersDark ? "" : "light");
               } else {
                 log(

[NoCoverage] BlockStatement
extension/src/background.ts:261:22
               if (!themeResult.theme) {
                 // Only update automatically if user hasn't set a preference
                 applyThemeToActionIcon(newSystemPrefersDark ? "dark" : "light");
-              } else {
-                log(
-                  "Not updating theme automatically as user has set a preference."
-                );
-              }
+              } else {}
             });
           });

[NoCoverage] StringLiteral
extension/src/background.ts:263:19
                 applyThemeToActionIcon(newSystemPrefersDark ? "dark" : "light");
               } else {
                 log(
-                  "Not updating theme automatically as user has set a preference."
+                  ""
                 );
               }

[Survived] BlockStatement
extension/src/background.ts:269:33
             });
           });
           log("Added listener for system theme changes");
-        } catch (listenerError) {
-          warn(
-            "Could not add listener for system theme changes: " +
-              (listenerError as Error).message
-          );
-        }
+        } catch (listenerError) {}
       } else {
         warn(

[NoCoverage] BlockStatement
extension/src/background.ts:275:14
               (listenerError as Error).message
           );
         }
-      } else {
-        warn(
-          "self.matchMedia not available. " +
-            "Defaulting action icon to light theme."
-        );
-        applyThemeToActionIcon("light"); // Fallback if matchMedia is not available
-      }
+      } else {}
     }
   } catch (e) {

[NoCoverage] StringLiteral
extension/src/background.ts:280:32
           "self.matchMedia not available. " +
             "Defaulting action icon to light theme."
         );
-        applyThemeToActionIcon("light"); // Fallback if matchMedia is not available
+        applyThemeToActionIcon(""); // Fallback if matchMedia is not available
       }
     }

[Killed] BlockStatement
extension/src/background.ts:283:15
         applyThemeToActionIcon("light"); // Fallback if matchMedia is not available
       }
     }
-  } catch (e) {
-    error("Error initializing action icon theme:", e);
-    applyThemeToActionIcon("light"); // Fallback to a default if storage access fails
-  }
+  } catch (e) {}
 };
 
killedBy: Background Script - Core Functions Theme Initialization initializeActionIconTheme should handle matchMedia not available
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] StringLiteral
extension/src/background.ts:285:28
     }
   } catch (e) {
     error("Error initializing action icon theme:", e);
-    applyThemeToActionIcon("light"); // Fallback to a default if storage access fails
+    applyThemeToActionIcon(""); // Fallback to a default if storage access fails
   }
 };

[NoCoverage] BlockStatement
extension/src/background.ts:304:35
 const activeDownloads: Record<string, DownloadStatus> = {}; // Store {url: {status, progress, filename}}
 
 // Define updateQueueUI before it's used by debouncedUpdateQueueUI
-const updateQueueUI = (): void => {
-  // Persist queue to storage
-  persistQueue();
-  chrome.runtime
-    .sendMessage({
-      type: "queueUpdated",
-      queue: downloadQueue,
-      active: activeDownloads,
-    })
-    .catch(() => {
-      // Catch errors if the popup is not open or the receiver doesn't exist.
-    });
-};
+const updateQueueUI = (): void => {};
 
 const debouncedUpdateQueueUI = debounce(updateQueueUI, 300);

[NoCoverage] ObjectLiteral
extension/src/background.ts:308:18
   // Persist queue to storage
   persistQueue();
   chrome.runtime
-    .sendMessage({
-      type: "queueUpdated",
-      queue: downloadQueue,
-      active: activeDownloads,
-    })
+    .sendMessage({})
     .catch(() => {
       // Catch errors if the popup is not open or the receiver doesn't exist.

[NoCoverage] BlockStatement
extension/src/background.ts:321:42
 const debouncedUpdateQueueUI = debounce(updateQueueUI, 300);
 
 // Function to update both badge and queue UI (called frequently)
-const _updateQueueAndBadge = (): void => {
-  updateBadge();
-  debouncedUpdateQueueUI();
-};
+const _updateQueueAndBadge = (): void => {};
 
 // Show a browser notification with optional tag

[Survived] BlockStatement
extension/src/background.ts:331:12
   title: string,
   message: string,
   tag: string | null = null
-): void => {
-  if (!chrome.notifications) {
-    warn("Chrome notifications API not available");
-    return;
-  }
-
-  // Determine icon URL if available
-  const iconUrl =
-    chrome.runtime && typeof chrome.runtime.getURL === "function"
-      ? chrome.runtime.getURL("extension/icons/icon128.png")
-      : "";
-  const options: chrome.NotificationOptions = {
-    type: "basic",
-    iconUrl,
-    title,
-    message,
-  };
-
-  // Use tag as notificationId for grouping, if provided
-  if (tag) {
-    chrome.notifications.create(tag, options);
-  } else {
-    chrome.notifications.create("", options);
-  }
-};
+): void => {};
 
 // Server state variables - now managed by centralized state manager

[Survived] ConditionalExpression
extension/src/background.ts:332:7
   message: string,
   tag: string | null = null
 ): void => {
-  if (!chrome.notifications) {
+  if (false) {
     warn("Chrome notifications API not available");
     return;

[NoCoverage] BlockStatement
extension/src/background.ts:332:30
   message: string,
   tag: string | null = null
 ): void => {
-  if (!chrome.notifications) {
-    warn("Chrome notifications API not available");
-    return;
-  }
+  if (!chrome.notifications) {}
 
   // Determine icon URL if available

[NoCoverage] StringLiteral
extension/src/background.ts:333:10
   tag: string | null = null
 ): void => {
   if (!chrome.notifications) {
-    warn("Chrome notifications API not available");
+    warn("");
     return;
   }

[Survived] EqualityOperator
extension/src/background.ts:339:23
 
   // Determine icon URL if available
   const iconUrl =
-    chrome.runtime && typeof chrome.runtime.getURL === "function"
+    chrome.runtime && typeof chrome.runtime.getURL !== "function"
       ? chrome.runtime.getURL("extension/icons/icon128.png")
       : "";

[Survived] ConditionalExpression
extension/src/background.ts:339:5
 
   // Determine icon URL if available
   const iconUrl =
-    chrome.runtime && typeof chrome.runtime.getURL === "function"
+    true
       ? chrome.runtime.getURL("extension/icons/icon128.png")
       : "";

[Survived] ConditionalExpression
extension/src/background.ts:350:7
   };
 
   // Use tag as notificationId for grouping, if provided
-  if (tag) {
+  if (true) {
     chrome.notifications.create(tag, options);
   } else {

[Survived] ConditionalExpression
extension/src/background.ts:350:7
   };
 
   // Use tag as notificationId for grouping, if provided
-  if (tag) {
+  if (false) {
     chrome.notifications.create(tag, options);
   } else {

[Survived] BlockStatement
extension/src/background.ts:352:10
   // Use tag as notificationId for grouping, if provided
   if (tag) {
     chrome.notifications.create(tag, options);
-  } else {
-    chrome.notifications.create("", options);
-  }
+  } else {}
 };
 

[Survived] StringLiteral
extension/src/background.ts:353:33
   if (tag) {
     chrome.notifications.create(tag, options);
   } else {
-    chrome.notifications.create("", options);
+    chrome.notifications.create("Stryker was here!", options);
   }
 };

[Survived] BlockStatement
extension/src/background.ts:364:38
 const _maxPortBackoffInterval = NETWORK_CONSTANTS.MAX_PORT_BACKOFF_INTERVAL;
 
 // Reset function for testing
-const resetServerState = (): void => {
-  stateManager.updateServerState({
-    status: "disconnected",
-    scanInProgress: false,
-    backoffInterval: 1000,
-  });
-};
+const resetServerState = (): void => {};
 
 // Server Communication

[Survived] ObjectLiteral
extension/src/background.ts:365:34
 
 // Reset function for testing
 const resetServerState = (): void => {
-  stateManager.updateServerState({
-    status: "disconnected",
-    scanInProgress: false,
-    backoffInterval: 1000,
-  });
+  stateManager.updateServerState({});
 };
 

[Survived] BooleanLiteral
extension/src/background.ts:367:21
 const resetServerState = (): void => {
   stateManager.updateServerState({
     status: "disconnected",
-    scanInProgress: false,
+    scanInProgress: true,
     backoffInterval: 1000,
   });

[NoCoverage] BlockStatement
extension/src/background.ts:375:6
 // Server Communication
 const getServerStatus = async (): Promise<
   "connected" | "disconnected" | "checking"
-> => {
-  try {
-    const port = await storageService.getPort();
-    if (!port) {
-      return "disconnected";
-    }
-
-    const response = await fetch(`http://127.0.0.1:${port}/api/health`, {
-      method: "GET",
-      headers: { "Content-Type": "application/json" },
-    });
-
-    if (response.ok) {
-      return "connected";
-    } else {
-      return "disconnected";
-    }
-  } catch (error) {
-    return "disconnected";
-  }
-};
+> => {};
 
 const getCurrentTheme = async (): Promise<Theme> => {

[NoCoverage] BlockStatement
extension/src/background.ts:376:7
 const getServerStatus = async (): Promise<
   "connected" | "disconnected" | "checking"
 > => {
-  try {
-    const port = await storageService.getPort();
-    if (!port) {
-      return "disconnected";
-    }
-
-    const response = await fetch(`http://127.0.0.1:${port}/api/health`, {
-      method: "GET",
-      headers: { "Content-Type": "application/json" },
-    });
-
-    if (response.ok) {
-      return "connected";
-    } else {
-      return "disconnected";
-    }
-  } catch (error) {
+  try {} catch (error) {
     return "disconnected";
   }

[NoCoverage] BlockStatement
extension/src/background.ts:378:16
 > => {
   try {
     const port = await storageService.getPort();
-    if (!port) {
-      return "disconnected";
-    }
+    if (!port) {}
 
     const response = await fetch(`http://127.0.0.1:${port}/api/health`, {

[NoCoverage] ConditionalExpression
extension/src/background.ts:378:9
 > => {
   try {
     const port = await storageService.getPort();
-    if (!port) {
+    if (true) {
       return "disconnected";
     }

[NoCoverage] StringLiteral
extension/src/background.ts:383:15
     }
 
     const response = await fetch(`http://127.0.0.1:${port}/api/health`, {
-      method: "GET",
+      method: "",
       headers: { "Content-Type": "application/json" },
     });

[NoCoverage] StringLiteral
extension/src/background.ts:384:34
 
     const response = await fetch(`http://127.0.0.1:${port}/api/health`, {
       method: "GET",
-      headers: { "Content-Type": "application/json" },
+      headers: { "Content-Type": "" },
     });
 

[NoCoverage] ConditionalExpression
extension/src/background.ts:387:9
       headers: { "Content-Type": "application/json" },
     });
 
-    if (response.ok) {
+    if (false) {
       return "connected";
     } else {

[NoCoverage] ConditionalExpression
extension/src/background.ts:387:9
       headers: { "Content-Type": "application/json" },
     });
 
-    if (response.ok) {
+    if (true) {
       return "connected";
     } else {

[NoCoverage] BlockStatement
extension/src/background.ts:389:12
 
     if (response.ok) {
       return "connected";
-    } else {
-      return "disconnected";
-    }
+    } else {}
   } catch (error) {
     return "disconnected";

[NoCoverage] BlockStatement
extension/src/background.ts:392:19
     } else {
       return "disconnected";
     }
-  } catch (error) {
-    return "disconnected";
-  }
+  } catch (error) {}
 };
 

[NoCoverage] StringLiteral
extension/src/background.ts:393:12
       return "disconnected";
     }
   } catch (error) {
-    return "disconnected";
+    return "";
   }
 };

[NoCoverage] BlockStatement
extension/src/background.ts:397:53
   }
 };
 
-const getCurrentTheme = async (): Promise<Theme> => {
-  try {
-    const result = await chrome.storage.local.get("theme");
-    return (result.theme as Theme) || "light";
-  } catch (error) {
-    return "light";
-  }
-};
+const getCurrentTheme = async (): Promise<Theme> => {};
 
 const broadcastServerStatus = async (): Promise<void> => {

[NoCoverage] BlockStatement
extension/src/background.ts:398:7
 };
 
 const getCurrentTheme = async (): Promise<Theme> => {
-  try {
-    const result = await chrome.storage.local.get("theme");
-    return (result.theme as Theme) || "light";
-  } catch (error) {
+  try {} catch (error) {
     return "light";
   }

[NoCoverage] ConditionalExpression
extension/src/background.ts:400:12
 const getCurrentTheme = async (): Promise<Theme> => {
   try {
     const result = await chrome.storage.local.get("theme");
-    return (result.theme as Theme) || "light";
+    return false;
   } catch (error) {
     return "light";

[NoCoverage] LogicalOperator
extension/src/background.ts:400:12
 const getCurrentTheme = async (): Promise<Theme> => {
   try {
     const result = await chrome.storage.local.get("theme");
-    return (result.theme as Theme) || "light";
+    return result.theme as Theme && "light";
   } catch (error) {
     return "light";

[NoCoverage] BlockStatement
extension/src/background.ts:401:19
   try {
     const result = await chrome.storage.local.get("theme");
     return (result.theme as Theme) || "light";
-  } catch (error) {
-    return "light";
-  }
+  } catch (error) {}
 };
 

[NoCoverage] StringLiteral
extension/src/background.ts:402:12
     const result = await chrome.storage.local.get("theme");
     return (result.theme as Theme) || "light";
   } catch (error) {
-    return "light";
+    return "";
   }
 };

[NoCoverage] BlockStatement
extension/src/background.ts:410:31
   const status = await getServerStatus();
 
   // Update icon based on server status
-  if (status === "connected") {
-    // Use the current theme's icon paths
-    const iconPaths = getActionIconPaths();
-    const currentTheme = await getCurrentTheme();
-    chrome.action.setIcon({ path: iconPaths[currentTheme] });
-    (chrome.action as any).setBadgeText?.({ text: "" });
-  } else {
+  if (status === "connected") {} else {
     // Use error icon (could be a different icon or just the current theme with badge)
     const iconPaths = getActionIconPaths();

[NoCoverage] ConditionalExpression
extension/src/background.ts:410:7
   const status = await getServerStatus();
 
   // Update icon based on server status
-  if (status === "connected") {
+  if (true) {
     // Use the current theme's icon paths
     const iconPaths = getActionIconPaths();

[NoCoverage] OptionalChaining
extension/src/background.ts:415:5
     const iconPaths = getActionIconPaths();
     const currentTheme = await getCurrentTheme();
     chrome.action.setIcon({ path: iconPaths[currentTheme] });
-    (chrome.action as any).setBadgeText?.({ text: "" });
+    (chrome.action as any).setBadgeText({
+  text: ""
+});
   } else {
     // Use error icon (could be a different icon or just the current theme with badge)

[NoCoverage] BlockStatement
extension/src/background.ts:416:10
     const currentTheme = await getCurrentTheme();
     chrome.action.setIcon({ path: iconPaths[currentTheme] });
     (chrome.action as any).setBadgeText?.({ text: "" });
-  } else {
-    // Use error icon (could be a different icon or just the current theme with badge)
-    const iconPaths = getActionIconPaths();
-    const currentTheme = await getCurrentTheme();
-    chrome.action.setIcon({ path: iconPaths[currentTheme] });
-    (chrome.action as any).setBadgeText?.({ text: "!" });
-    (chrome.action as any).setBadgeBackgroundColor?.({ color: "#f44336" });
-  }
+  } else {}
 
   // Broadcast status to all UI components

[NoCoverage] OptionalChaining
extension/src/background.ts:421:5
     const iconPaths = getActionIconPaths();
     const currentTheme = await getCurrentTheme();
     chrome.action.setIcon({ path: iconPaths[currentTheme] });
-    (chrome.action as any).setBadgeText?.({ text: "!" });
+    (chrome.action as any).setBadgeText({
+  text: "!"
+});
     (chrome.action as any).setBadgeBackgroundColor?.({ color: "#f44336" });
   }

[NoCoverage] StringLiteral
extension/src/background.ts:421:51
     const iconPaths = getActionIconPaths();
     const currentTheme = await getCurrentTheme();
     chrome.action.setIcon({ path: iconPaths[currentTheme] });
-    (chrome.action as any).setBadgeText?.({ text: "!" });
+    (chrome.action as any).setBadgeText?.({ text: "" });
     (chrome.action as any).setBadgeBackgroundColor?.({ color: "#f44336" });
   }

[NoCoverage] OptionalChaining
extension/src/background.ts:422:5
     const currentTheme = await getCurrentTheme();
     chrome.action.setIcon({ path: iconPaths[currentTheme] });
     (chrome.action as any).setBadgeText?.({ text: "!" });
-    (chrome.action as any).setBadgeBackgroundColor?.({ color: "#f44336" });
+    (chrome.action as any).setBadgeBackgroundColor({
+  color: "#f44336"
+});
   }
 

[NoCoverage] StringLiteral
extension/src/background.ts:422:63
     const currentTheme = await getCurrentTheme();
     chrome.action.setIcon({ path: iconPaths[currentTheme] });
     (chrome.action as any).setBadgeText?.({ text: "!" });
-    (chrome.action as any).setBadgeBackgroundColor?.({ color: "#f44336" });
+    (chrome.action as any).setBadgeBackgroundColor?.({ color: "" });
   }
 

[NoCoverage] ObjectLiteral
extension/src/background.ts:427:18
 
   // Broadcast status to all UI components
   chrome.runtime
-    .sendMessage({
-      type: "serverStatusUpdate",
-      status,
-    })
+    .sendMessage({})
     .catch(() => {
       // Ignore errors when no listeners are available

[Survived] EqualityOperator
extension/src/background.ts:439:26
 const checkServerStatus = async (port: number): Promise<boolean> =>
   errorHandler.wrap(async () => {
     const serverState = stateManager.getServerState();
-    const oldAvailable = serverState.status === "connected";
+    const oldAvailable = serverState.status !== "connected";
 
     // Skip server status checks when fetch API is unavailable (e.g., non-browser or test env)

[Survived] ConditionalExpression
extension/src/background.ts:439:26
 const checkServerStatus = async (port: number): Promise<boolean> =>
   errorHandler.wrap(async () => {
     const serverState = stateManager.getServerState();
-    const oldAvailable = serverState.status === "connected";
+    const oldAvailable = true;
 
     // Skip server status checks when fetch API is unavailable (e.g., non-browser or test env)

[Killed] BlockStatement
extension/src/background.ts:442:38
     const oldAvailable = serverState.status === "connected";
 
     // Skip server status checks when fetch API is unavailable (e.g., non-browser or test env)
-    if (typeof fetch !== "function") {
-      return false;
-    }
+    if (typeof fetch !== "function") {}
 
     if (!port) {
killedBy: Background Script - Core Functions Server Status Functions checkServerStatus should return false when fetch is not available
statusReason: TypeError: fetch is not a function

[Timeout] EqualityOperator
extension/src/background.ts:442:9
     const oldAvailable = serverState.status === "connected";
 
     // Skip server status checks when fetch API is unavailable (e.g., non-browser or test env)
-    if (typeof fetch !== "function") {
+    if (typeof fetch === "function") {
       return false;
     }

[Killed] BooleanLiteral
extension/src/background.ts:443:14
 
     // Skip server status checks when fetch API is unavailable (e.g., non-browser or test env)
     if (typeof fetch !== "function") {
-      return false;
+      return true;
     }
 
killedBy: Background Script - Core Functions Server Status Functions checkServerStatus should return false when fetch is not available
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
extension/src/background.ts:446:9
       return false;
     }
 
-    if (!port) {
+    if (true) {
       stateManager.updateServerState({ status: "disconnected" });
       await errorHandler.handle(
killedBy: checkServerStatus - Simple Test should return true for successful response
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
extension/src/background.ts:446:9
       return false;
     }
 
-    if (!port) {
+    if (port) {
       stateManager.updateServerState({ status: "disconnected" });
       await errorHandler.handle(
killedBy: checkServerStatus - Simple Test should return true for successful response
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[NoCoverage] ArrowFunction
extension/src/background.ts:449:9
     if (!port) {
       stateManager.updateServerState({ status: "disconnected" });
       await errorHandler.handle(
-        () => chrome.storage.local.set({ [serverStatusKey]: false }),
+        () => undefined,
         CentralizedErrorHandler.contexts.background.serverCheck(port)
       );

[NoCoverage] BooleanLiteral
extension/src/background.ts:449:61
     if (!port) {
       stateManager.updateServerState({ status: "disconnected" });
       await errorHandler.handle(
-        () => chrome.storage.local.set({ [serverStatusKey]: false }),
+        () => chrome.storage.local.set({ [serverStatusKey]: true }),
         CentralizedErrorHandler.contexts.background.serverCheck(port)
       );

[NoCoverage] ConditionalExpression
extension/src/background.ts:454:11
       );
       updateIcon();
       // Notify if availability changed
-      if (oldAvailable) {
+      if (true) {
         showNotification(
           "Server Disconnected",

[NoCoverage] ConditionalExpression
extension/src/background.ts:454:11
       );
       updateIcon();
       // Notify if availability changed
-      if (oldAvailable) {
+      if (false) {
         showNotification(
           "Server Disconnected",

[NoCoverage] StringLiteral
extension/src/background.ts:457:11
       if (oldAvailable) {
         showNotification(
           "Server Disconnected",
-          "The Enhanced Video Downloader server is not available. Downloads won't work until it's reconnected."
+          ""
         );
       }

[Survived] ArrowFunction
extension/src/background.ts:465:34
 
     // Fetch server status with timeout
     const controller = new AbortController();
-    const timeoutId = setTimeout(() => controller.abort(), PORT_CHECK_TIMEOUT);
+    const timeoutId = setTimeout(() => undefined, PORT_CHECK_TIMEOUT);
     let response: Response;
     try {

[Killed] BlockStatement
extension/src/background.ts:467:9
     const controller = new AbortController();
     const timeoutId = setTimeout(() => controller.abort(), PORT_CHECK_TIMEOUT);
     let response: Response;
-    try {
-      response = await fetch("http://127.0.0.1:" + port + "/health", {
-        signal: controller.signal,
-      });
-    } finally {
+    try {} finally {
       clearTimeout(timeoutId);
     }
killedBy: Background Script - Core Functions Server Status Functions checkServerStatus should return true for successful response
statusReason: TypeError: Cannot read properties of undefined (reading 'ok')

[Survived] BlockStatement
extension/src/background.ts:471:15
       response = await fetch("http://127.0.0.1:" + port + "/health", {
         signal: controller.signal,
       });
-    } finally {
-      clearTimeout(timeoutId);
-    }
+    } finally {}
 
     if (response.ok) {
