[Killed] ConditionalExpression
extension/src/background.ts:478:11
     if (response.ok) {
       const data = await response.json();
       // Verify the server is our app by checking app_name
-      if (data.app_name === expectedAppName) {
+      if (true) {
         stateManager.updateServerState({ status: "connected" });
         // If server just came online, refresh config
killedBy: Background Script - Core Functions Server Status Functions checkServerStatus should return false for wrong server app name
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
extension/src/background.ts:478:46
     if (response.ok) {
       const data = await response.json();
       // Verify the server is our app by checking app_name
-      if (data.app_name === expectedAppName) {
-        stateManager.updateServerState({ status: "connected" });
-        // If server just came online, refresh config
-        if (!oldAvailable) {
-          logger.info(
-            "Server now available on port " + port + ", refreshing config",
-            CentralizedLogger.contexts.background.serverCheck(port)
-          );
-          await fetchServerConfig(port);
-        }
-      } else {
+      if (data.app_name === expectedAppName) {} else {
         logger.warn(
           "Wrong server on port " + port + ": " + data.app_name,
killedBy: Background Script - Core Functions Server Status Functions checkServerStatus should return true for successful response
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ConditionalExpression
extension/src/background.ts:481:13
       if (data.app_name === expectedAppName) {
         stateManager.updateServerState({ status: "connected" });
         // If server just came online, refresh config
-        if (!oldAvailable) {
+        if (true) {
           logger.info(
             "Server now available on port " + port + ", refreshing config",

[Survived] BlockStatement
extension/src/background.ts:481:28
       if (data.app_name === expectedAppName) {
         stateManager.updateServerState({ status: "connected" });
         // If server just came online, refresh config
-        if (!oldAvailable) {
-          logger.info(
-            "Server now available on port " + port + ", refreshing config",
-            CentralizedLogger.contexts.background.serverCheck(port)
-          );
-          await fetchServerConfig(port);
-        }
+        if (!oldAvailable) {}
       } else {
         logger.warn(

[Survived] BlockStatement
extension/src/background.ts:488:14
           );
           await fetchServerConfig(port);
         }
-      } else {
-        logger.warn(
-          "Wrong server on port " + port + ": " + data.app_name,
-          CentralizedLogger.contexts.background.serverCheck(port)
-        );
-        stateManager.updateServerState({ status: "disconnected" });
-      }
+      } else {}
     } else {
       logger.warn(

[Survived] StringLiteral
extension/src/background.ts:493:50
           "Wrong server on port " + port + ": " + data.app_name,
           CentralizedLogger.contexts.background.serverCheck(port)
         );
-        stateManager.updateServerState({ status: "disconnected" });
+        stateManager.updateServerState({ status: "" });
       }
     } else {

[Survived] BlockStatement
extension/src/background.ts:495:12
         );
         stateManager.updateServerState({ status: "disconnected" });
       }
-    } else {
-      logger.warn(
-        "Server check failed on port " + port + ": " + response.status,
-        CentralizedLogger.contexts.background.serverCheck(port)
-      );
-      stateManager.updateServerState({ status: "disconnected" });
-    }
+    } else {}
 
     // Update storage

[Survived] ObjectLiteral
extension/src/background.ts:500:38
         "Server check failed on port " + port + ": " + response.status,
         CentralizedLogger.contexts.background.serverCheck(port)
       );
-      stateManager.updateServerState({ status: "disconnected" });
+      stateManager.updateServerState({});
     }
 

[Survived] ArrowFunction
extension/src/background.ts:506:7
     // Update storage
     const currentState = stateManager.getServerState();
     await errorHandler.handle(
-      () =>
-        chrome.storage.local.set({
-          [serverStatusKey]: currentState.status === "connected",
-        }),
+      () => undefined,
       CentralizedErrorHandler.contexts.background.serverCheck(port)
     );

[Survived] ConditionalExpression
extension/src/background.ts:508:30
     await errorHandler.handle(
       () =>
         chrome.storage.local.set({
-          [serverStatusKey]: currentState.status === "connected",
+          [serverStatusKey]: true,
         }),
       CentralizedErrorHandler.contexts.background.serverCheck(port)

[Survived] EqualityOperator
extension/src/background.ts:508:30
     await errorHandler.handle(
       () =>
         chrome.storage.local.set({
-          [serverStatusKey]: currentState.status === "connected",
+          [serverStatusKey]: currentState.status !== "connected",
         }),
       CentralizedErrorHandler.contexts.background.serverCheck(port)

[Killed] EqualityOperator
extension/src/background.ts:517:30
     updateIcon();
 
     // If server availability changed, show notification
-    const currentAvailable = currentState.status === "connected";
+    const currentAvailable = currentState.status !== "connected";
 
     if (currentAvailable !== oldAvailable) {
killedBy: Background Script - Core Functions Server Status Functions checkServerStatus should return true for successful response
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
extension/src/background.ts:517:30
     updateIcon();
 
     // If server availability changed, show notification
-    const currentAvailable = currentState.status === "connected";
+    const currentAvailable = false;
 
     if (currentAvailable !== oldAvailable) {
killedBy: checkServerStatus - Simple Test should return true for successful response
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ConditionalExpression
extension/src/background.ts:519:9
     // If server availability changed, show notification
     const currentAvailable = currentState.status === "connected";
 
-    if (currentAvailable !== oldAvailable) {
+    if (true) {
       if (currentAvailable) {
         showNotification(

[Survived] EqualityOperator
extension/src/background.ts:519:9
     // If server availability changed, show notification
     const currentAvailable = currentState.status === "connected";
 
-    if (currentAvailable !== oldAvailable) {
+    if (currentAvailable === oldAvailable) {
       if (currentAvailable) {
         showNotification(

[Survived] ConditionalExpression
extension/src/background.ts:520:11
     const currentAvailable = currentState.status === "connected";
 
     if (currentAvailable !== oldAvailable) {
-      if (currentAvailable) {
+      if (false) {
         showNotification(
           "Server Connected",

[Survived] ConditionalExpression
extension/src/background.ts:520:11
     const currentAvailable = currentState.status === "connected";
 
     if (currentAvailable !== oldAvailable) {
-      if (currentAvailable) {
+      if (true) {
         showNotification(
           "Server Connected",

[Survived] StringLiteral
extension/src/background.ts:522:11
     if (currentAvailable !== oldAvailable) {
       if (currentAvailable) {
         showNotification(
-          "Server Connected",
+          "",
           "Enhanced Video Downloader server is now online on port " + port + "."
         );

[Survived] ObjectLiteral
extension/src/background.ts:526:40
           "Enhanced Video Downloader server is now online on port " + port + "."
         );
         // Reset backoff interval when server is found
-        stateManager.updateServerState({ backoffInterval: 1000 });
+        stateManager.updateServerState({});
       } else {
         showNotification(

[NoCoverage] BlockStatement
extension/src/background.ts:527:14
         );
         // Reset backoff interval when server is found
         stateManager.updateServerState({ backoffInterval: 1000 });
-      } else {
-        showNotification(
-          "Server Disconnected",
-          "The Enhanced Video Downloader server is not available. Downloads won't work until it's reconnected."
-        );
-      }
+      } else {}
     }
 

[Killed] BlockStatement
extension/src/background.ts:541:38
 // Additional functions (stub implementations to be completed)
 const fetchServerConfig = async (
   port: number
-): Promise<Partial<ServerConfig>> => {
-  try {
-    const response = await fetch(`http://127.0.0.1:${port}/api/config`);
-    if (response.ok) {
-      const config = await response.json();
-      return config;
-    } else {
-      log(`Failed to fetch config from server: ${response.status}`);
-      return {};
-    }
-  } catch (error) {
-    log(`Error fetching server config: ${error}`);
-    return {};
-  }
-};
+): Promise<Partial<ServerConfig>> => {};
 const saveServerConfig = async (
   port: number,
killedBy: Background Script - Core Functions Server Configuration Functions fetchServerConfig should return config from server
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"app_name": "Enhanced Video Downloader"}
Received: undefined

[Killed] BlockStatement
extension/src/background.ts:542:7
 const fetchServerConfig = async (
   port: number
 ): Promise<Partial<ServerConfig>> => {
-  try {
-    const response = await fetch(`http://127.0.0.1:${port}/api/config`);
-    if (response.ok) {
-      const config = await response.json();
-      return config;
-    } else {
-      log(`Failed to fetch config from server: ${response.status}`);
-      return {};
-    }
-  } catch (error) {
+  try {} catch (error) {
     log(`Error fetching server config: ${error}`);
     return {};
killedBy: Background Script - Core Functions Server Configuration Functions fetchServerConfig should return config from server
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"app_name": "Enhanced Video Downloader"}
Received: undefined

[Survived] StringLiteral
extension/src/background.ts:543:34
   port: number
 ): Promise<Partial<ServerConfig>> => {
   try {
-    const response = await fetch(`http://127.0.0.1:${port}/api/config`);
+    const response = await fetch(``);
     if (response.ok) {
       const config = await response.json();

[Killed] ConditionalExpression
extension/src/background.ts:544:9
 ): Promise<Partial<ServerConfig>> => {
   try {
     const response = await fetch(`http://127.0.0.1:${port}/api/config`);
-    if (response.ok) {
+    if (false) {
       const config = await response.json();
       return config;
killedBy: Background Script - Core Functions Server Configuration Functions fetchServerConfig should return config from server
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "app_name": "Enhanced Video Downloader",
- }

[Killed] BlockStatement
extension/src/background.ts:544:22
 ): Promise<Partial<ServerConfig>> => {
   try {
     const response = await fetch(`http://127.0.0.1:${port}/api/config`);
-    if (response.ok) {
-      const config = await response.json();
-      return config;
-    } else {
+    if (response.ok) {} else {
       log(`Failed to fetch config from server: ${response.status}`);
       return {};
killedBy: Background Script - Core Functions Server Configuration Functions fetchServerConfig should return config from server
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"app_name": "Enhanced Video Downloader"}
Received: undefined

[Killed] BlockStatement
extension/src/background.ts:547:12
     if (response.ok) {
       const config = await response.json();
       return config;
-    } else {
-      log(`Failed to fetch config from server: ${response.status}`);
-      return {};
-    }
+    } else {}
   } catch (error) {
     log(`Error fetching server config: ${error}`);
killedBy: Background Script - Core Functions Server Configuration Functions fetchServerConfig should return empty object on non-ok response
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {}
Received: undefined

[Survived] StringLiteral
extension/src/background.ts:548:11
       const config = await response.json();
       return config;
     } else {
-      log(`Failed to fetch config from server: ${response.status}`);
+      log(``);
       return {};
     }

[Killed] BlockStatement
extension/src/background.ts:551:19
       log(`Failed to fetch config from server: ${response.status}`);
       return {};
     }
-  } catch (error) {
-    log(`Error fetching server config: ${error}`);
-    return {};
-  }
+  } catch (error) {}
 };
 const saveServerConfig = async (
killedBy: Background Script - Core Functions Server Configuration Functions fetchServerConfig should return empty object on fetch error
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {}
Received: undefined

[NoCoverage] BlockStatement
extension/src/background.ts:559:24
 const saveServerConfig = async (
   port: number,
   configToSave: Partial<ServerConfig>
-): Promise<boolean> => {
-  try {
-    const response = await fetch(`http://127.0.0.1:${port}/api/config`, {
-      method: "POST",
-      headers: {
-        "Content-Type": "application/json",
-      },
-      body: JSON.stringify(configToSave),
-    });
-
-    if (response.ok) {
-      log(`Config saved successfully to server on port ${port}`);
-      return true;
-    } else {
-      log(`Failed to save config to server: ${response.status}`);
-      return false;
-    }
-  } catch (error) {
-    log(`Error saving server config: ${error}`);
-    return false;
-  }
-};
+): Promise<boolean> => {};
 
 type FindServerPortDeps = {

[NoCoverage] BlockStatement
extension/src/background.ts:560:7
   port: number,
   configToSave: Partial<ServerConfig>
 ): Promise<boolean> => {
-  try {
-    const response = await fetch(`http://127.0.0.1:${port}/api/config`, {
-      method: "POST",
-      headers: {
-        "Content-Type": "application/json",
-      },
-      body: JSON.stringify(configToSave),
-    });
-
-    if (response.ok) {
-      log(`Config saved successfully to server on port ${port}`);
-      return true;
-    } else {
-      log(`Failed to save config to server: ${response.status}`);
-      return false;
-    }
-  } catch (error) {
+  try {} catch (error) {
     log(`Error saving server config: ${error}`);
     return false;

[NoCoverage] ObjectLiteral
extension/src/background.ts:561:73
   configToSave: Partial<ServerConfig>
 ): Promise<boolean> => {
   try {
-    const response = await fetch(`http://127.0.0.1:${port}/api/config`, {
-      method: "POST",
-      headers: {
-        "Content-Type": "application/json",
-      },
-      body: JSON.stringify(configToSave),
-    });
+    const response = await fetch(`http://127.0.0.1:${port}/api/config`, {});
 
     if (response.ok) {

[NoCoverage] StringLiteral
extension/src/background.ts:562:15
 ): Promise<boolean> => {
   try {
     const response = await fetch(`http://127.0.0.1:${port}/api/config`, {
-      method: "POST",
+      method: "",
       headers: {
         "Content-Type": "application/json",

[NoCoverage] BlockStatement
extension/src/background.ts:569:22
       body: JSON.stringify(configToSave),
     });
 
-    if (response.ok) {
-      log(`Config saved successfully to server on port ${port}`);
-      return true;
-    } else {
+    if (response.ok) {} else {
       log(`Failed to save config to server: ${response.status}`);
       return false;

[NoCoverage] StringLiteral
extension/src/background.ts:570:11
     });
 
     if (response.ok) {
-      log(`Config saved successfully to server on port ${port}`);
+      log(``);
       return true;
     } else {

[NoCoverage] BooleanLiteral
extension/src/background.ts:571:14
 
     if (response.ok) {
       log(`Config saved successfully to server on port ${port}`);
-      return true;
+      return false;
     } else {
       log(`Failed to save config to server: ${response.status}`);

[NoCoverage] BlockStatement
extension/src/background.ts:572:12
     if (response.ok) {
       log(`Config saved successfully to server on port ${port}`);
       return true;
-    } else {
-      log(`Failed to save config to server: ${response.status}`);
-      return false;
-    }
+    } else {}
   } catch (error) {
     log(`Error saving server config: ${error}`);

[NoCoverage] BooleanLiteral
extension/src/background.ts:574:14
       return true;
     } else {
       log(`Failed to save config to server: ${response.status}`);
-      return false;
+      return true;
     }
   } catch (error) {

[NoCoverage] BlockStatement
extension/src/background.ts:576:19
       log(`Failed to save config to server: ${response.status}`);
       return false;
     }
-  } catch (error) {
-    log(`Error saving server config: ${error}`);
-    return false;
-  }
+  } catch (error) {}
 };
 

[NoCoverage] StringLiteral
extension/src/background.ts:577:9
       return false;
     }
   } catch (error) {
-    log(`Error saving server config: ${error}`);
+    log(``);
     return false;
   }

[NoCoverage] BooleanLiteral
extension/src/background.ts:578:12
     }
   } catch (error) {
     log(`Error saving server config: ${error}`);
-    return false;
+    return true;
   }
 };

[Survived] BooleanLiteral
extension/src/background.ts:591:15
 };
 
 const findServerPort = async (
-  startScan = false,
+  startScan = true,
   deps?: Partial<FindServerPortDeps>
 ): Promise<number | null> => {

[Killed] LogicalOperator
extension/src/background.ts:600:7
     checkServerStatus: checkStatus = checkServerStatus,
     log: logFn = log,
     warn: warnFn = warn,
-  } = deps || {};
+  } = deps && {};
 
   // Show badge indicator if forcing scan
killedBy: Background Script - Core Functions Port Discovery findServerPort should return port when server is found
statusReason: TypeError: Cannot read properties of undefined (reading 'discoverServerPort')

[Survived] ConditionalExpression
extension/src/background.ts:600:7
     checkServerStatus: checkStatus = checkServerStatus,
     log: logFn = log,
     warn: warnFn = warn,
-  } = deps || {};
+  } = false;
 
   // Show badge indicator if forcing scan

[NoCoverage] BlockStatement
extension/src/background.ts:603:58
   } = deps || {};
 
   // Show badge indicator if forcing scan
-  if (startScan && (chrome.action as any)?.setBadgeText) {
-    try {
-      (chrome.action as any).setBadgeBackgroundColor({
-        color: "#ffc107",
-      });
-      (chrome.action as any).setBadgeText({ text: "SCAN" }); // Use plain ASCII string
-    } catch (e) {
-      /* ignore errors setting badge */
-    }
-  }
+  if (startScan && (chrome.action as any)?.setBadgeText) {}
 
   // Set scanning state

[Survived] OptionalChaining
extension/src/background.ts:603:20
   } = deps || {};
 
   // Show badge indicator if forcing scan
-  if (startScan && (chrome.action as any)?.setBadgeText) {
+  if (startScan && (chrome.action as any).setBadgeText) {
     try {
       (chrome.action as any).setBadgeBackgroundColor({

[NoCoverage] BlockStatement
extension/src/background.ts:604:9
 
   // Show badge indicator if forcing scan
   if (startScan && (chrome.action as any)?.setBadgeText) {
-    try {
-      (chrome.action as any).setBadgeBackgroundColor({
-        color: "#ffc107",
-      });
-      (chrome.action as any).setBadgeText({ text: "SCAN" }); // Use plain ASCII string
-    } catch (e) {
+    try {} catch (e) {
       /* ignore errors setting badge */
     }

[NoCoverage] ObjectLiteral
extension/src/background.ts:608:43
       (chrome.action as any).setBadgeBackgroundColor({
         color: "#ffc107",
       });
-      (chrome.action as any).setBadgeText({ text: "SCAN" }); // Use plain ASCII string
+      (chrome.action as any).setBadgeText({}); // Use plain ASCII string
     } catch (e) {
       /* ignore errors setting badge */

[Survived] BooleanLiteral
extension/src/background.ts:615:52
   }
 
   // Set scanning state
-  stateManager.updateServerState({ scanInProgress: true });
+  stateManager.updateServerState({ scanInProgress: false });
 
   try {

[Survived] BlockStatement
extension/src/background.ts:619:60
 
   try {
     // Progress callback for user feedback
-    const onProgress = (current: number, total: number) => {
-      if (startScan && (chrome.action as any)?.setBadgeText) {
-        try {
-          const percentage = Math.round((current / total) * 100);
-          (chrome.action as any).setBadgeText({
-            text: String(percentage) + "%",
-          }); // Use string concatenation
-        } catch (e) {
-          /* ignore errors setting badge */
-        }
-      }
-    };
+    const onProgress = (current: number, total: number) => {};
 
     // Perform discovery with timeout and progress

[Survived] OptionalChaining
extension/src/background.ts:620:24
   try {
     // Progress callback for user feedback
     const onProgress = (current: number, total: number) => {
-      if (startScan && (chrome.action as any)?.setBadgeText) {
+      if (startScan && (chrome.action as any).setBadgeText) {
         try {
           const percentage = Math.round((current / total) * 100);

[Survived] LogicalOperator
extension/src/background.ts:620:11
   try {
     // Progress callback for user feedback
     const onProgress = (current: number, total: number) => {
-      if (startScan && (chrome.action as any)?.setBadgeText) {
+      if (startScan || (chrome.action as any)?.setBadgeText) {
         try {
           const percentage = Math.round((current / total) * 100);

[NoCoverage] BlockStatement
extension/src/background.ts:621:13
     // Progress callback for user feedback
     const onProgress = (current: number, total: number) => {
       if (startScan && (chrome.action as any)?.setBadgeText) {
-        try {
-          const percentage = Math.round((current / total) * 100);
-          (chrome.action as any).setBadgeText({
-            text: String(percentage) + "%",
-          }); // Use string concatenation
-        } catch (e) {
+        try {} catch (e) {
           /* ignore errors setting badge */
         }

[NoCoverage] ArithmeticOperator
extension/src/background.ts:622:42
     const onProgress = (current: number, total: number) => {
       if (startScan && (chrome.action as any)?.setBadgeText) {
         try {
-          const percentage = Math.round((current / total) * 100);
+          const percentage = Math.round((current * total) * 100);
           (chrome.action as any).setBadgeText({
             text: String(percentage) + "%",

[NoCoverage] ArithmeticOperator
extension/src/background.ts:622:41
     const onProgress = (current: number, total: number) => {
       if (startScan && (chrome.action as any)?.setBadgeText) {
         try {
-          const percentage = Math.round((current / total) * 100);
+          const percentage = Math.round(current / total / 100);
           (chrome.action as any).setBadgeText({
             text: String(percentage) + "%",

[NoCoverage] ObjectLiteral
extension/src/background.ts:623:47
       if (startScan && (chrome.action as any)?.setBadgeText) {
         try {
           const percentage = Math.round((current / total) * 100);
-          (chrome.action as any).setBadgeText({
-            text: String(percentage) + "%",
-          }); // Use string concatenation
+          (chrome.action as any).setBadgeText({}); // Use string concatenation
         } catch (e) {
           /* ignore errors setting badge */

[Survived] ConditionalExpression
extension/src/background.ts:643:9
       onProgress
     );
 
-    if (port !== null) {
+    if (true) {
       logFn("Server discovered on port " + port);
       // Reset backoff interval when server is found

[Survived] ConditionalExpression
extension/src/background.ts:643:9
       onProgress
     );
 
-    if (port !== null) {
+    if (false) {
       logFn("Server discovered on port " + port);
       // Reset backoff interval when server is found

[Timeout] StringLiteral
extension/src/background.ts:644:13
     );
 
     if (port !== null) {
-      logFn("Server discovered on port " + port);
+      logFn("" + port);
       // Reset backoff interval when server is found
       stateManager.updateServerState({ backoffInterval: 1000 });

[Survived] BlockStatement
extension/src/background.ts:649:11
       stateManager.updateServerState({ backoffInterval: 1000 });
 
       // Notify options page about server discovery
-      try {
-        chrome.runtime.sendMessage(
-          { type: "serverDiscovered", port },
-          (response) => {
-            // Ignore any errors - this is just a notification
-            if (chrome.runtime.lastError) {
-              // This is expected when options page is not open
-              logFn(
-                "Server discovery notification sent (options page may not be open)"
-              );
-            }
-          }
-        );
-      } catch (e) {
+      try {} catch (e) {
         // Ignore errors if no listeners are available
         logFn(

[Timeout] ObjectLiteral
extension/src/background.ts:651:11
       // Notify options page about server discovery
       try {
         chrome.runtime.sendMessage(
-          { type: "serverDiscovered", port },
+          {},
           (response) => {
             // Ignore any errors - this is just a notification

[Survived] BlockStatement
extension/src/background.ts:652:25
       try {
         chrome.runtime.sendMessage(
           { type: "serverDiscovered", port },
-          (response) => {
-            // Ignore any errors - this is just a notification
-            if (chrome.runtime.lastError) {
-              // This is expected when options page is not open
-              logFn(
-                "Server discovery notification sent (options page may not be open)"
-              );
-            }
-          }
+          (response) => {}
         );
       } catch (e) {

[NoCoverage] BlockStatement
extension/src/background.ts:654:43
           { type: "serverDiscovered", port },
           (response) => {
             // Ignore any errors - this is just a notification
-            if (chrome.runtime.lastError) {
-              // This is expected when options page is not open
-              logFn(
-                "Server discovery notification sent (options page may not be open)"
-              );
-            }
+            if (chrome.runtime.lastError) {}
           }
         );

[Survived] ConditionalExpression
extension/src/background.ts:654:17
           { type: "serverDiscovered", port },
           (response) => {
             // Ignore any errors - this is just a notification
-            if (chrome.runtime.lastError) {
+            if (true) {
               // This is expected when options page is not open
               logFn(

[NoCoverage] StringLiteral
extension/src/background.ts:657:17
             if (chrome.runtime.lastError) {
               // This is expected when options page is not open
               logFn(
-                "Server discovery notification sent (options page may not be open)"
+                ""
               );
             }

[NoCoverage] BlockStatement
extension/src/background.ts:662:19
             }
           }
         );
-      } catch (e) {
-        // Ignore errors if no listeners are available
-        logFn(
-          "Server discovery notification failed (expected if options page not open)"
-        );
-      }
+      } catch (e) {}
     } else {
       warnFn("Server port discovery failed after scanning range."); // No emoji, just text

[Survived] BlockStatement
extension/src/background.ts:668:12
           "Server discovery notification failed (expected if options page not open)"
         );
       }
-    } else {
-      warnFn("Server port discovery failed after scanning range."); // No emoji, just text
-      // Increase backoff interval for next attempt
-      const currentState = stateManager.getServerState();
-      const newBackoffInterval = Math.min(
-        currentState.backoffInterval * 2,
-        _maxPortBackoffInterval
-      );
-      stateManager.updateServerState({ backoffInterval: newBackoffInterval });
-    }
+    } else {}
 
     return port;

[Survived] MethodExpression
extension/src/background.ts:672:34
       warnFn("Server port discovery failed after scanning range."); // No emoji, just text
       // Increase backoff interval for next attempt
       const currentState = stateManager.getServerState();
-      const newBackoffInterval = Math.min(
-        currentState.backoffInterval * 2,
-        _maxPortBackoffInterval
-      );
+      const newBackoffInterval = Math.max(currentState.backoffInterval * 2, _maxPortBackoffInterval);
       stateManager.updateServerState({ backoffInterval: newBackoffInterval });
     }

[Survived] ArithmeticOperator
extension/src/background.ts:673:9
       // Increase backoff interval for next attempt
       const currentState = stateManager.getServerState();
       const newBackoffInterval = Math.min(
-        currentState.backoffInterval * 2,
+        currentState.backoffInterval / 2,
         _maxPortBackoffInterval
       );
