[NoCoverage] BlockStatement
extension/src/background.ts:680:15
     }
 
     return port;
-  } catch (e) {
-    // Handle any errors from the discover function
-    warnFn("Error during server port discovery:", e); // No emoji, just text
-    // Increase backoff interval for next attempt
-    const currentState = stateManager.getServerState();
-    const newBackoffInterval = Math.min(
-      currentState.backoffInterval * 2,
-      _maxPortBackoffInterval
-    );
-    stateManager.updateServerState({ backoffInterval: newBackoffInterval });
-    return null;
-  } finally {
+  } catch (e) {} finally {
     // Clear badge after scanning
     if (startScan && (chrome.action as any)?.setBadgeText) {

[Survived] BlockStatement
extension/src/background.ts:691:13
     );
     stateManager.updateServerState({ backoffInterval: newBackoffInterval });
     return null;
-  } finally {
-    // Clear badge after scanning
-    if (startScan && (chrome.action as any)?.setBadgeText) {
-      try {
-        (chrome.action as any).setBadgeText({ text: "" }); // Clear badge text, no emoji
-      } catch (e) {
-        /* ignore errors clearing badge */
-      }
-    }
-
-    // Clear scanning state
-    stateManager.updateServerState({ scanInProgress: false });
-  }
+  } finally {}
 };
 

[Survived] ConditionalExpression
extension/src/background.ts:693:9
     return null;
   } finally {
     // Clear badge after scanning
-    if (startScan && (chrome.action as any)?.setBadgeText) {
+    if (true) {
       try {
         (chrome.action as any).setBadgeText({ text: "" }); // Clear badge text, no emoji

[Survived] ConditionalExpression
extension/src/background.ts:693:9
     return null;
   } finally {
     // Clear badge after scanning
-    if (startScan && (chrome.action as any)?.setBadgeText) {
+    if (false) {
       try {
         (chrome.action as any).setBadgeText({ text: "" }); // Clear badge text, no emoji

[NoCoverage] BlockStatement
extension/src/background.ts:694:11
   } finally {
     // Clear badge after scanning
     if (startScan && (chrome.action as any)?.setBadgeText) {
-      try {
-        (chrome.action as any).setBadgeText({ text: "" }); // Clear badge text, no emoji
-      } catch (e) {
+      try {} catch (e) {
         /* ignore errors clearing badge */
       }

[Survived] BooleanLiteral
extension/src/background.ts:702:54
     }
 
     // Clear scanning state
-    stateManager.updateServerState({ scanInProgress: false });
+    stateManager.updateServerState({ scanInProgress: true });
   }
 };

[NoCoverage] BlockStatement
extension/src/background.ts:730:57
   // Implementation details
 };
 
-const toggleHistorySetting = async (): Promise<void> => {
-  try {
-    const result = await chrome.storage.local.get("isHistoryEnabled");
-    const enabled = result.isHistoryEnabled as boolean;
-    await chrome.storage.local.set({ isHistoryEnabled: !enabled });
-  } catch (e) {
-    warn("Failed to toggle history setting:", e);
-  }
-};
+const toggleHistorySetting = async (): Promise<void> => {};
 
 const sendDownloadRequest = async (

[NoCoverage] BlockStatement
extension/src/background.ts:731:7
 };
 
 const toggleHistorySetting = async (): Promise<void> => {
-  try {
-    const result = await chrome.storage.local.get("isHistoryEnabled");
-    const enabled = result.isHistoryEnabled as boolean;
-    await chrome.storage.local.set({ isHistoryEnabled: !enabled });
-  } catch (e) {
+  try {} catch (e) {
     warn("Failed to toggle history setting:", e);
   }

[NoCoverage] BooleanLiteral
extension/src/background.ts:734:56
   try {
     const result = await chrome.storage.local.get("isHistoryEnabled");
     const enabled = result.isHistoryEnabled as boolean;
-    await chrome.storage.local.set({ isHistoryEnabled: !enabled });
+    await chrome.storage.local.set({ isHistoryEnabled: enabled });
   } catch (e) {
     warn("Failed to toggle history setting:", e);

[NoCoverage] BlockStatement
extension/src/background.ts:735:15
     const result = await chrome.storage.local.get("isHistoryEnabled");
     const enabled = result.isHistoryEnabled as boolean;
     await chrome.storage.local.set({ isHistoryEnabled: !enabled });
-  } catch (e) {
-    warn("Failed to toggle history setting:", e);
-  }
+  } catch (e) {}
 };
 

[Survived] BooleanLiteral
extension/src/background.ts:743:16
 const sendDownloadRequest = async (
   videoUrl: string,
   tabId?: number,
-  isPlaylist = false,
+  isPlaylist = true,
   quality?: string | null,
   format?: string | null,

[Survived] StringLiteral
extension/src/background.ts:746:15
   isPlaylist = false,
   quality?: string | null,
   format?: string | null,
-  pageTitle = "video",
+  pageTitle = "",
   customDownloadId?: string | null
 ): Promise<any> =>

[NoCoverage] ConditionalExpression
extension/src/background.ts:756:7
 const initializeExtension = async (): Promise<void> => {
   // Prevent multiple simultaneous initializations
   const serverState = stateManager.getServerState();
-  if (serverState.scanInProgress) {
+  if (false) {
     log("Initialization already in progress, skipping...");
     return;

[NoCoverage] ConditionalExpression
extension/src/background.ts:756:7
 const initializeExtension = async (): Promise<void> => {
   // Prevent multiple simultaneous initializations
   const serverState = stateManager.getServerState();
-  if (serverState.scanInProgress) {
+  if (true) {
     log("Initialization already in progress, skipping...");
     return;

[NoCoverage] BooleanLiteral
extension/src/background.ts:761:52
     return;
   }
 
-  stateManager.updateServerState({ scanInProgress: true });
+  stateManager.updateServerState({ scanInProgress: false });
 
   try {

[NoCoverage] BlockStatement
extension/src/background.ts:763:7
 
   stateManager.updateServerState({ scanInProgress: true });
 
-  try {
-    // Initialize action icon theme
-    await initializeActionIconTheme();
-
-    // Perform initial server discovery
-    const port = await findServerPort(true);
-    if (port !== null) {
-      log("Discovered server on port " + port);
-      // Broadcast server status after discovery
-      await broadcastServerStatus();
-    } else {
-      warn("Server port discovery failed after scanning range.");
-      // Broadcast disconnected status
-      await broadcastServerStatus();
-    }
-
-    // Set up periodic server status checks
-    setInterval(broadcastServerStatus, _serverCheckInterval);
-
-    // Initial server status check
-    await broadcastServerStatus();
-  } catch (err: unknown) {
+  try {} catch (err: unknown) {
     error("Error during extension initialization:", err);
   } finally {

[NoCoverage] BooleanLiteral
extension/src/background.ts:768:39
     await initializeActionIconTheme();
 
     // Perform initial server discovery
-    const port = await findServerPort(true);
+    const port = await findServerPort(false);
     if (port !== null) {
       log("Discovered server on port " + port);

[NoCoverage] ConditionalExpression
extension/src/background.ts:769:9
 
     // Perform initial server discovery
     const port = await findServerPort(true);
-    if (port !== null) {
+    if (true) {
       log("Discovered server on port " + port);
       // Broadcast server status after discovery

[NoCoverage] BlockStatement
extension/src/background.ts:769:24
 
     // Perform initial server discovery
     const port = await findServerPort(true);
-    if (port !== null) {
-      log("Discovered server on port " + port);
-      // Broadcast server status after discovery
-      await broadcastServerStatus();
-    } else {
+    if (port !== null) {} else {
       warn("Server port discovery failed after scanning range.");
       // Broadcast disconnected status

[NoCoverage] StringLiteral
extension/src/background.ts:770:11
     // Perform initial server discovery
     const port = await findServerPort(true);
     if (port !== null) {
-      log("Discovered server on port " + port);
+      log("" + port);
       // Broadcast server status after discovery
       await broadcastServerStatus();

[NoCoverage] BlockStatement
extension/src/background.ts:773:12
       log("Discovered server on port " + port);
       // Broadcast server status after discovery
       await broadcastServerStatus();
-    } else {
-      warn("Server port discovery failed after scanning range.");
-      // Broadcast disconnected status
-      await broadcastServerStatus();
-    }
+    } else {}
 
     // Set up periodic server status checks

[NoCoverage] BlockStatement
extension/src/background.ts:784:26
 
     // Initial server status check
     await broadcastServerStatus();
-  } catch (err: unknown) {
-    error("Error during extension initialization:", err);
-  } finally {
+  } catch (err: unknown) {} finally {
     stateManager.updateServerState({ scanInProgress: false });
   }

[NoCoverage] BlockStatement
extension/src/background.ts:786:13
     await broadcastServerStatus();
   } catch (err: unknown) {
     error("Error during extension initialization:", err);
-  } finally {
-    stateManager.updateServerState({ scanInProgress: false });
-  }
+  } finally {}
 };
 

[NoCoverage] BooleanLiteral
extension/src/background.ts:787:54
   } catch (err: unknown) {
     error("Error during extension initialization:", err);
   } finally {
-    stateManager.updateServerState({ scanInProgress: false });
+    stateManager.updateServerState({ scanInProgress: true });
   }
 };

[NoCoverage] BlockStatement
extension/src/background.ts:799:31
       const port = await storageService.getPort();
 
       switch (message.type) {
-        case "downloadVideo": {
-          log("Received download request for:", message.url);
-          const response = await sendDownloadRequest(
-            message.url,
-            sender.tab?.id,
-            message.isPlaylist,
-            message.quality,
-            message.format,
-            message.pageTitle,
-            message.downloadId
-          );
-          sendResponse(response);
-          break;
-        }
+        case "downloadVideo": {}
 
         case "getQueue":

[NoCoverage] ConditionalExpression
extension/src/background.ts:799:9
       const port = await storageService.getPort();
 
       switch (message.type) {
-        case "downloadVideo": {
-          log("Received download request for:", message.url);
-          const response = await sendDownloadRequest(
-            message.url,
-            sender.tab?.id,
-            message.isPlaylist,
-            message.quality,
-            message.format,
-            message.pageTitle,
-            message.downloadId
-          );
-          sendResponse(response);
-          break;
-        }
+        case "downloadVideo":
 
         case "getQueue":

[NoCoverage] OptionalChaining
extension/src/background.ts:803:13
           log("Received download request for:", message.url);
           const response = await sendDownloadRequest(
             message.url,
-            sender.tab?.id,
+            sender.tab.id,
             message.isPlaylist,
             message.quality,

[NoCoverage] ConditionalExpression
extension/src/background.ts:814:9
           break;
         }
 
-        case "getQueue":
-          // This logic remains untouched
-          sendResponse({ queue: downloadQueue, active: activeDownloads });
-          break;
+        case "getQueue":
 
         case "clearHistory": {

[NoCoverage] ConditionalExpression
extension/src/background.ts:819:9
           sendResponse({ queue: downloadQueue, active: activeDownloads });
           break;
 
-        case "clearHistory": {
-          const result = await handleClearHistory(storageService);
-          sendResponse(result);
-          break;
-        }
+        case "clearHistory":
 
         case "toggleHistory": {

[NoCoverage] BlockStatement
extension/src/background.ts:819:30
           sendResponse({ queue: downloadQueue, active: activeDownloads });
           break;
 
-        case "clearHistory": {
-          const result = await handleClearHistory(storageService);
-          sendResponse(result);
-          break;
-        }
+        case "clearHistory": {}
 
         case "toggleHistory": {

[NoCoverage] BlockStatement
extension/src/background.ts:825:31
           break;
         }
 
-        case "toggleHistory": {
-          await toggleHistorySetting();
-          sendResponse({ status: "success" });
-          break;
-        }
+        case "toggleHistory": {}
 
         case "getHistory": {

[NoCoverage] ConditionalExpression
extension/src/background.ts:825:9
           break;
         }
 
-        case "toggleHistory": {
-          await toggleHistorySetting();
-          sendResponse({ status: "success" });
-          break;
-        }
+        case "toggleHistory":
 
         case "getHistory": {

[NoCoverage] BlockStatement
extension/src/background.ts:831:28
           break;
         }
 
-        case "getHistory": {
-          const result = await handleGetHistory(storageService);
-          sendResponse(result);
-          break;
-        }
+        case "getHistory": {}
 
         case "setConfig": {

[NoCoverage] ConditionalExpression
extension/src/background.ts:831:9
           break;
         }
 
-        case "getHistory": {
-          const result = await handleGetHistory(storageService);
-          sendResponse(result);
-          break;
-        }
+        case "getHistory":
 
         case "setConfig": {

[NoCoverage] BlockStatement
extension/src/background.ts:837:27
           break;
         }
 
-        case "setConfig": {
-          // *** This is the new, refactored logic ***
-          const result = await handleSetConfig(
-            port,
-            message.config,
-            apiService,
-            storageService
-          );
-          sendResponse(result);
-          break;
-        }
+        case "setConfig": {}
 
         case "getConfig":

[NoCoverage] ConditionalExpression
extension/src/background.ts:837:9
           break;
         }
 
-        case "setConfig": {
-          // *** This is the new, refactored logic ***
-          const result = await handleSetConfig(
-            port,
-            message.config,
-            apiService,
-            storageService
-          );
-          sendResponse(result);
-          break;
-        }
+        case "setConfig":
 
         case "getConfig":

[NoCoverage] ConditionalExpression
extension/src/background.ts:849:9
           break;
         }
 
-        case "getConfig":
-          // This logic remains untouched for now
-          if (port) {
-            const config = await fetchServerConfig(port);
-            sendResponse({ status: "success", data: config });
-          } else {
-            const serverState = stateManager.getServerState();
-            sendResponse({
-              status: "error",
-              message: "Server not available",
-              data: serverState.config,
-            });
-          }
-          break;
+        case "getConfig":
 
         case "getServerStatus": {

[NoCoverage] ConditionalExpression
extension/src/background.ts:851:15
 
         case "getConfig":
           // This logic remains untouched for now
-          if (port) {
+          if (false) {
             const config = await fetchServerConfig(port);
             sendResponse({ status: "success", data: config });

[NoCoverage] BlockStatement
extension/src/background.ts:851:21
 
         case "getConfig":
           // This logic remains untouched for now
-          if (port) {
-            const config = await fetchServerConfig(port);
-            sendResponse({ status: "success", data: config });
-          } else {
+          if (port) {} else {
             const serverState = stateManager.getServerState();
             sendResponse({

[NoCoverage] BlockStatement
extension/src/background.ts:854:18
           if (port) {
             const config = await fetchServerConfig(port);
             sendResponse({ status: "success", data: config });
-          } else {
-            const serverState = stateManager.getServerState();
-            sendResponse({
-              status: "error",
-              message: "Server not available",
-              data: serverState.config,
-            });
-          }
+          } else {}
           break;
 

[NoCoverage] ObjectLiteral
extension/src/background.ts:856:26
             sendResponse({ status: "success", data: config });
           } else {
             const serverState = stateManager.getServerState();
-            sendResponse({
-              status: "error",
-              message: "Server not available",
-              data: serverState.config,
-            });
+            sendResponse({});
           }
           break;

[NoCoverage] ConditionalExpression
extension/src/background.ts:864:9
           }
           break;
 
-        case "getServerStatus": {
-          const status = await getServerStatus();
-          sendResponse({ status });
-          break;
-        }
+        case "getServerStatus":
 
         case "restartServer":

[NoCoverage] BlockStatement
extension/src/background.ts:864:33
           }
           break;
 
-        case "getServerStatus": {
-          const status = await getServerStatus();
-          sendResponse({ status });
-          break;
-        }
+        case "getServerStatus": {}
 
         case "restartServer":

[NoCoverage] StringLiteral
extension/src/background.ts:872:15
 
         case "restartServer":
           // This logic remains untouched
-          log("Received restart request");
+          log("");
           if (port) {
             try {

[NoCoverage] ConditionalExpression
extension/src/background.ts:873:15
         case "restartServer":
           // This logic remains untouched
           log("Received restart request");
-          if (port) {
+          if (false) {
             try {
               const res = await fetch(

[NoCoverage] ConditionalExpression
extension/src/background.ts:873:15
         case "restartServer":
           // This logic remains untouched
           log("Received restart request");
-          if (port) {
+          if (true) {
             try {
               const res = await fetch(

[NoCoverage] BlockStatement
extension/src/background.ts:874:17
           // This logic remains untouched
           log("Received restart request");
           if (port) {
-            try {
-              const res = await fetch(
-                "http://127.0.0.1:" + port + "/api/restart",
-                {
-                  method: "POST",
-                }
-              );
-              if (res.ok) {
-                sendResponse({ status: "success" });
-                // Server will be gone, so trigger a new scan after a short delay
-                if (!isTestEnvironment) {
-                  setTimeout(() => findServerPort(true), 2000);
-                }
-              } else {
-                sendResponse({
-                  status: "error",
-                  message: "Server returned status " + res.status,
-                });
-              }
-            } catch (e) {
+            try {} catch (e) {
               sendResponse({
                 status: "error",

[NoCoverage] BlockStatement
extension/src/background.ts:881:27
                   method: "POST",
                 }
               );
-              if (res.ok) {
-                sendResponse({ status: "success" });
-                // Server will be gone, so trigger a new scan after a short delay
-                if (!isTestEnvironment) {
-                  setTimeout(() => findServerPort(true), 2000);
-                }
-              } else {
+              if (res.ok) {} else {
                 sendResponse({
                   status: "error",

[NoCoverage] ConditionalExpression
extension/src/background.ts:881:19
                   method: "POST",
                 }
               );
-              if (res.ok) {
+              if (true) {
                 sendResponse({ status: "success" });
                 // Server will be gone, so trigger a new scan after a short delay

[NoCoverage] ObjectLiteral
extension/src/background.ts:882:30
                 }
               );
               if (res.ok) {
-                sendResponse({ status: "success" });
+                sendResponse({});
                 // Server will be gone, so trigger a new scan after a short delay
                 if (!isTestEnvironment) {

[NoCoverage] ConditionalExpression
extension/src/background.ts:884:21
               if (res.ok) {
                 sendResponse({ status: "success" });
                 // Server will be gone, so trigger a new scan after a short delay
-                if (!isTestEnvironment) {
+                if (true) {
                   setTimeout(() => findServerPort(true), 2000);
                 }

[NoCoverage] ConditionalExpression
extension/src/background.ts:884:21
               if (res.ok) {
                 sendResponse({ status: "success" });
                 // Server will be gone, so trigger a new scan after a short delay
-                if (!isTestEnvironment) {
+                if (false) {
                   setTimeout(() => findServerPort(true), 2000);
                 }

[NoCoverage] ArrowFunction
extension/src/background.ts:885:30
                 sendResponse({ status: "success" });
                 // Server will be gone, so trigger a new scan after a short delay
                 if (!isTestEnvironment) {
-                  setTimeout(() => findServerPort(true), 2000);
+                  setTimeout(() => undefined, 2000);
                 }
               } else {

[NoCoverage] BooleanLiteral
extension/src/background.ts:885:51
                 sendResponse({ status: "success" });
                 // Server will be gone, so trigger a new scan after a short delay
                 if (!isTestEnvironment) {
-                  setTimeout(() => findServerPort(true), 2000);
+                  setTimeout(() => findServerPort(false), 2000);
                 }
               } else {

[NoCoverage] BlockStatement
extension/src/background.ts:887:22
                 if (!isTestEnvironment) {
                   setTimeout(() => findServerPort(true), 2000);
                 }
-              } else {
-                sendResponse({
-                  status: "error",
-                  message: "Server returned status " + res.status,
-                });
-              }
+              } else {}
             } catch (e) {
               sendResponse({

[NoCoverage] ObjectLiteral
extension/src/background.ts:888:30
                   setTimeout(() => findServerPort(true), 2000);
                 }
               } else {
-                sendResponse({
-                  status: "error",
-                  message: "Server returned status " + res.status,
-                });
+                sendResponse({});
               }
             } catch (e) {

[NoCoverage] StringLiteral
extension/src/background.ts:889:27
                 }
               } else {
                 sendResponse({
-                  status: "error",
+                  status: "",
                   message: "Server returned status " + res.status,
                 });

[NoCoverage] BlockStatement
extension/src/background.ts:893:25
                   message: "Server returned status " + res.status,
                 });
               }
-            } catch (e) {
-              sendResponse({
-                status: "error",
-                message: (e as Error).message,
-              });
-            }
+            } catch (e) {}
           } else {
             sendResponse({ status: "error", message: "Server not found" });

[NoCoverage] BlockStatement
extension/src/background.ts:899:18
                 message: (e as Error).message,
               });
             }
-          } else {
-            sendResponse({ status: "error", message: "Server not found" });
-          }
+          } else {}
           break;
 

[NoCoverage] StringLiteral
extension/src/background.ts:900:54
               });
             }
           } else {
-            sendResponse({ status: "error", message: "Server not found" });
+            sendResponse({ status: "error", message: "" });
           }
           break;

[NoCoverage] StringLiteral
extension/src/background.ts:900:36
               });
             }
           } else {
-            sendResponse({ status: "error", message: "Server not found" });
+            sendResponse({ status: "", message: "Server not found" });
           }
           break;

[NoCoverage] BlockStatement
extension/src/background.ts:904:31
           }
           break;
 
-        case "pauseDownload": {
-          if (port) {
-            try {
-              const res = await fetch(
-                "http://127.0.0.1:" +
-                  port +
-                  "/api/download/" +
-                  message.downloadId +
-                  "/pause",
-                { method: "POST" }
-              );
-              const json = await res.json();
-              sendResponse(json);
-            } catch (e) {
-              sendResponse({ status: "error", message: (e as Error).message });
-            }
-          } else {
-            sendResponse({ status: "error", message: "Server not available" });
-          }
-          break;
-        }
+        case "pauseDownload": {}
 
         case "resumeDownload": {

[NoCoverage] ConditionalExpression
extension/src/background.ts:904:9
           }
           break;
 
-        case "pauseDownload": {
-          if (port) {
-            try {
-              const res = await fetch(
-                "http://127.0.0.1:" +
-                  port +
-                  "/api/download/" +
-                  message.downloadId +
-                  "/pause",
-                { method: "POST" }
-              );
-              const json = await res.json();
-              sendResponse(json);
-            } catch (e) {
-              sendResponse({ status: "error", message: (e as Error).message });
-            }
-          } else {
-            sendResponse({ status: "error", message: "Server not available" });
-          }
-          break;
-        }
+        case "pauseDownload":
 
         case "resumeDownload": {

[NoCoverage] BlockStatement
extension/src/background.ts:905:21
           break;
 
         case "pauseDownload": {
-          if (port) {
-            try {
-              const res = await fetch(
-                "http://127.0.0.1:" +
-                  port +
-                  "/api/download/" +
-                  message.downloadId +
-                  "/pause",
-                { method: "POST" }
-              );
-              const json = await res.json();
-              sendResponse(json);
-            } catch (e) {
-              sendResponse({ status: "error", message: (e as Error).message });
-            }
-          } else {
+          if (port) {} else {
             sendResponse({ status: "error", message: "Server not available" });
           }

[NoCoverage] ConditionalExpression
extension/src/background.ts:905:15
           break;
 
         case "pauseDownload": {
-          if (port) {
+          if (true) {
             try {
               const res = await fetch(

[NoCoverage] BlockStatement
extension/src/background.ts:906:17
 
         case "pauseDownload": {
           if (port) {
-            try {
-              const res = await fetch(
-                "http://127.0.0.1:" +
-                  port +
-                  "/api/download/" +
-                  message.downloadId +
-                  "/pause",
-                { method: "POST" }
-              );
-              const json = await res.json();
-              sendResponse(json);
-            } catch (e) {
+            try {} catch (e) {
               sendResponse({ status: "error", message: (e as Error).message });
             }

[NoCoverage] BlockStatement
extension/src/background.ts:917:25
               );
               const json = await res.json();
               sendResponse(json);
-            } catch (e) {
-              sendResponse({ status: "error", message: (e as Error).message });
-            }
+            } catch (e) {}
           } else {
             sendResponse({ status: "error", message: "Server not available" });

[NoCoverage] ObjectLiteral
extension/src/background.ts:918:28
               const json = await res.json();
               sendResponse(json);
             } catch (e) {
-              sendResponse({ status: "error", message: (e as Error).message });
+              sendResponse({});
             }
           } else {

[NoCoverage] BlockStatement
extension/src/background.ts:920:18
             } catch (e) {
               sendResponse({ status: "error", message: (e as Error).message });
             }
-          } else {
-            sendResponse({ status: "error", message: "Server not available" });
-          }
+          } else {}
           break;
         }

[NoCoverage] StringLiteral
extension/src/background.ts:921:54
               sendResponse({ status: "error", message: (e as Error).message });
             }
           } else {
-            sendResponse({ status: "error", message: "Server not available" });
+            sendResponse({ status: "error", message: "" });
           }
           break;
