[NoCoverage] BlockStatement
extension/src/background.ts:926:32
           break;
         }
 
-        case "resumeDownload": {
-          if (port) {
-            try {
-              const res = await fetch(
-                "http://127.0.0.1:" +
-                  port +
-                  "/api/download/" +
-                  message.downloadId +
-                  "/resume",
-                { method: "POST" }
-              );
-              const json = await res.json();
-              sendResponse(json);
-            } catch (e) {
-              sendResponse({ status: "error", message: (e as Error).message });
-            }
-          } else {
-            sendResponse({ status: "error", message: "Server not available" });
-          }
-          break;
-        }
+        case "resumeDownload": {}
 
         case "cancelDownload": {

[NoCoverage] ConditionalExpression
extension/src/background.ts:926:9
           break;
         }
 
-        case "resumeDownload": {
-          if (port) {
-            try {
-              const res = await fetch(
-                "http://127.0.0.1:" +
-                  port +
-                  "/api/download/" +
-                  message.downloadId +
-                  "/resume",
-                { method: "POST" }
-              );
-              const json = await res.json();
-              sendResponse(json);
-            } catch (e) {
-              sendResponse({ status: "error", message: (e as Error).message });
-            }
-          } else {
-            sendResponse({ status: "error", message: "Server not available" });
-          }
-          break;
-        }
+        case "resumeDownload":
 
         case "cancelDownload": {

[NoCoverage] ConditionalExpression
extension/src/background.ts:927:15
         }
 
         case "resumeDownload": {
-          if (port) {
+          if (true) {
             try {
               const res = await fetch(

[NoCoverage] BlockStatement
extension/src/background.ts:927:21
         }
 
         case "resumeDownload": {
-          if (port) {
-            try {
-              const res = await fetch(
-                "http://127.0.0.1:" +
-                  port +
-                  "/api/download/" +
-                  message.downloadId +
-                  "/resume",
-                { method: "POST" }
-              );
-              const json = await res.json();
-              sendResponse(json);
-            } catch (e) {
-              sendResponse({ status: "error", message: (e as Error).message });
-            }
-          } else {
+          if (port) {} else {
             sendResponse({ status: "error", message: "Server not available" });
           }

[NoCoverage] BlockStatement
extension/src/background.ts:928:17
 
         case "resumeDownload": {
           if (port) {
-            try {
-              const res = await fetch(
-                "http://127.0.0.1:" +
-                  port +
-                  "/api/download/" +
-                  message.downloadId +
-                  "/resume",
-                { method: "POST" }
-              );
-              const json = await res.json();
-              sendResponse(json);
-            } catch (e) {
+            try {} catch (e) {
               sendResponse({ status: "error", message: (e as Error).message });
             }

[NoCoverage] ObjectLiteral
extension/src/background.ts:935:17
                   "/api/download/" +
                   message.downloadId +
                   "/resume",
-                { method: "POST" }
+                {}
               );
               const json = await res.json();

[NoCoverage] StringLiteral
extension/src/background.ts:935:27
                   "/api/download/" +
                   message.downloadId +
                   "/resume",
-                { method: "POST" }
+                { method: "" }
               );
               const json = await res.json();

[NoCoverage] StringLiteral
extension/src/background.ts:940:38
               const json = await res.json();
               sendResponse(json);
             } catch (e) {
-              sendResponse({ status: "error", message: (e as Error).message });
+              sendResponse({ status: "", message: (e as Error).message });
             }
           } else {

[NoCoverage] BlockStatement
extension/src/background.ts:948:32
           break;
         }
 
-        case "cancelDownload": {
-          if (port) {
-            try {
-              const res = await fetch(
-                "http://127.0.0.1:" +
-                  port +
-                  "/api/download/" +
-                  message.downloadId +
-                  "/cancel",
-                { method: "POST" }
-              );
-              const json = await res.json();
-              sendResponse(json);
-            } catch (e) {
-              sendResponse({ status: "error", message: (e as Error).message });
-            }
-          } else {
-            sendResponse({ status: "error", message: "Server not available" });
-          }
-          break;
-        }
+        case "cancelDownload": {}
 
         case "reorderQueue": {

[NoCoverage] ConditionalExpression
extension/src/background.ts:948:9
           break;
         }
 
-        case "cancelDownload": {
-          if (port) {
-            try {
-              const res = await fetch(
-                "http://127.0.0.1:" +
-                  port +
-                  "/api/download/" +
-                  message.downloadId +
-                  "/cancel",
-                { method: "POST" }
-              );
-              const json = await res.json();
-              sendResponse(json);
-            } catch (e) {
-              sendResponse({ status: "error", message: (e as Error).message });
-            }
-          } else {
-            sendResponse({ status: "error", message: "Server not available" });
-          }
-          break;
-        }
+        case "cancelDownload":
 
         case "reorderQueue": {

[NoCoverage] ConditionalExpression
extension/src/background.ts:949:15
         }
 
         case "cancelDownload": {
-          if (port) {
+          if (true) {
             try {
               const res = await fetch(

[NoCoverage] BlockStatement
extension/src/background.ts:949:21
         }
 
         case "cancelDownload": {
-          if (port) {
-            try {
-              const res = await fetch(
-                "http://127.0.0.1:" +
-                  port +
-                  "/api/download/" +
-                  message.downloadId +
-                  "/cancel",
-                { method: "POST" }
-              );
-              const json = await res.json();
-              sendResponse(json);
-            } catch (e) {
-              sendResponse({ status: "error", message: (e as Error).message });
-            }
-          } else {
+          if (port) {} else {
             sendResponse({ status: "error", message: "Server not available" });
           }

[NoCoverage] BlockStatement
extension/src/background.ts:950:17
 
         case "cancelDownload": {
           if (port) {
-            try {
-              const res = await fetch(
-                "http://127.0.0.1:" +
-                  port +
-                  "/api/download/" +
-                  message.downloadId +
-                  "/cancel",
-                { method: "POST" }
-              );
-              const json = await res.json();
-              sendResponse(json);
-            } catch (e) {
+            try {} catch (e) {
               sendResponse({ status: "error", message: (e as Error).message });
             }

[NoCoverage] ObjectLiteral
extension/src/background.ts:965:26
               sendResponse({ status: "error", message: (e as Error).message });
             }
           } else {
-            sendResponse({ status: "error", message: "Server not available" });
+            sendResponse({});
           }
           break;

[NoCoverage] StringLiteral
extension/src/background.ts:965:36
               sendResponse({ status: "error", message: (e as Error).message });
             }
           } else {
-            sendResponse({ status: "error", message: "Server not available" });
+            sendResponse({ status: "", message: "Server not available" });
           }
           break;

[NoCoverage] ConditionalExpression
extension/src/background.ts:970:9
           break;
         }
 
-        case "reorderQueue": {
-          // Update the download queue order and refresh UI
-          downloadQueue = message.queue;
-          updateQueueUI();
-          sendResponse({ status: "success" });
-          break;
-        }
+        case "reorderQueue":
 
         default:

[NoCoverage] BlockStatement
extension/src/background.ts:970:30
           break;
         }
 
-        case "reorderQueue": {
-          // Update the download queue order and refresh UI
-          downloadQueue = message.queue;
-          updateQueueUI();
-          sendResponse({ status: "success" });
-          break;
-        }
+        case "reorderQueue": {}
 
         default:

[NoCoverage] ConditionalExpression
extension/src/background.ts:978:9
           break;
         }
 
-        default:
-          warn("Received unknown message type:", message.type);
-          sendResponse({ status: "error", message: "Unknown message type" });
-          break;
+        default:
       }
     } catch (e) {

[NoCoverage] StringLiteral
extension/src/background.ts:980:34
 
         default:
           warn("Received unknown message type:", message.type);
-          sendResponse({ status: "error", message: "Unknown message type" });
+          sendResponse({ status: "", message: "Unknown message type" });
           break;
       }

[NoCoverage] BlockStatement
extension/src/background.ts:983:17
           sendResponse({ status: "error", message: "Unknown message type" });
           break;
       }
-    } catch (e) {
-      const errorMessage =
-        e instanceof Error ? e.message : "An unknown error occurred";
-      error("Error processing message " + message.type + ":", errorMessage);
-      sendResponse({ status: "error", message: errorMessage });
-    }
+    } catch (e) {}
   })();
 

[NoCoverage] StringLiteral
extension/src/background.ts:986:13
     } catch (e) {
       const errorMessage =
         e instanceof Error ? e.message : "An unknown error occurred";
-      error("Error processing message " + message.type + ":", errorMessage);
+      error("" + message.type + ":", errorMessage);
       sendResponse({ status: "error", message: errorMessage });
     }

[NoCoverage] ObjectLiteral
extension/src/background.ts:987:20
       const errorMessage =
         e instanceof Error ? e.message : "An unknown error occurred";
       error("Error processing message " + message.type + ":", errorMessage);
-      sendResponse({ status: "error", message: errorMessage });
+      sendResponse({});
     }
   })();

[NoCoverage] BooleanLiteral
extension/src/background.ts:992:10
   })();
 
   // Return true to indicate that sendResponse will be called asynchronously
-  return true;
+  return false;
 });
 

[NoCoverage] BlockStatement
extension/src/background.ts:995:25
   return true;
 });
 
-if (!isTestEnvironment) {
-  // Set up initialization on service worker lifecycle events
-  chrome.runtime.onInstalled.addListener(() => {
-    initializeExtension();
-  });
-
-  chrome.runtime.onStartup.addListener(() => {
-    initializeExtension();
-  });
-}
+if (!isTestEnvironment) {}
 
 // Export functions for testing

[NoCoverage] BlockStatement
extension/src/background.ts:997:48
 
 if (!isTestEnvironment) {
   // Set up initialization on service worker lifecycle events
-  chrome.runtime.onInstalled.addListener(() => {
-    initializeExtension();
-  });
+  chrome.runtime.onInstalled.addListener(() => {});
 
   chrome.runtime.onStartup.addListener(() => {

[NoCoverage] BlockStatement
extension/src/background.ts:1001:46
     initializeExtension();
   });
 
-  chrome.runtime.onStartup.addListener(() => {
-    initializeExtension();
-  });
+  chrome.runtime.onStartup.addListener(() => {});
 }
 

[Killed] BlockStatement
extension/src/background.ts:1026:56
 /**
  * Persist the download queue to storage
  */
-export const persistQueue = async (): Promise<void> => {
-  try {
-    await chrome.storage.local.set({ [_queueStorageKey]: downloadQueue });
-  } catch (e) {
-    warn("Failed to persist download queue:", e);
-  }
-};
+export const persistQueue = async (): Promise<void> => {};
 
 // Initialize persisted queue on startup
killedBy: Background Script - Core Functions Queue Persistence persistQueue should save queue to storage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"downloadQueue": ["video1", "video2"]}

Number of calls: 0

[Killed] BlockStatement
extension/src/background.ts:1027:7
  * Persist the download queue to storage
  */
 export const persistQueue = async (): Promise<void> => {
-  try {
-    await chrome.storage.local.set({ [_queueStorageKey]: downloadQueue });
-  } catch (e) {
+  try {} catch (e) {
     warn("Failed to persist download queue:", e);
   }
killedBy: Background Script - Core Functions Queue Persistence persistQueue should save queue to storage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"downloadQueue": ["video1", "video2"]}

Number of calls: 0

[Killed] ObjectLiteral
extension/src/background.ts:1028:36
  */
 export const persistQueue = async (): Promise<void> => {
   try {
-    await chrome.storage.local.set({ [_queueStorageKey]: downloadQueue });
+    await chrome.storage.local.set({});
   } catch (e) {
     warn("Failed to persist download queue:", e);
killedBy: Background Script - Core Functions Queue Persistence persistQueue should save queue to storage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "downloadQueue": Array [
-     "video1",

[Killed] BlockStatement
extension/src/background.ts:1029:15
 export const persistQueue = async (): Promise<void> => {
   try {
     await chrome.storage.local.set({ [_queueStorageKey]: downloadQueue });
-  } catch (e) {
-    warn("Failed to persist download queue:", e);
-  }
+  } catch (e) {}
 };
 
killedBy: Background Script - Core Functions Queue Persistence persistQueue should handle storage errors gracefully
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[NoCoverage] BlockStatement
extension/src/background.ts:1035:25
 };
 
 // Initialize persisted queue on startup
-if (!isTestEnvironment) {
-  chrome.storage.local.get(_queueStorageKey, (res) => {
-    downloadQueue = res[_queueStorageKey] || [];
-    updateQueueUI();
-  });
-
-  // Initialize persisted active downloads on startup
-  chrome.storage.local.get("activeDownloads", (res) => {
-    if (res.activeDownloads) {
-      Object.assign(activeDownloads, res.activeDownloads);
-      log(
-        "Restored active downloads from storage:",
-        Object.keys(activeDownloads).length
-      );
-      updateQueueUI();
-    }
-  });
-}
+if (!isTestEnvironment) {}
 

[NoCoverage] BlockStatement
extension/src/background.ts:1036:55
 
 // Initialize persisted queue on startup
 if (!isTestEnvironment) {
-  chrome.storage.local.get(_queueStorageKey, (res) => {
-    downloadQueue = res[_queueStorageKey] || [];
-    updateQueueUI();
-  });
+  chrome.storage.local.get(_queueStorageKey, (res) => {});
 
   // Initialize persisted active downloads on startup

[NoCoverage] ConditionalExpression
extension/src/background.ts:1037:21
 // Initialize persisted queue on startup
 if (!isTestEnvironment) {
   chrome.storage.local.get(_queueStorageKey, (res) => {
-    downloadQueue = res[_queueStorageKey] || [];
+    downloadQueue = false;
     updateQueueUI();
   });

[NoCoverage] LogicalOperator
extension/src/background.ts:1037:21
 // Initialize persisted queue on startup
 if (!isTestEnvironment) {
   chrome.storage.local.get(_queueStorageKey, (res) => {
-    downloadQueue = res[_queueStorageKey] || [];
+    downloadQueue = res[_queueStorageKey] && [];
     updateQueueUI();
   });

[NoCoverage] BlockStatement
extension/src/background.ts:1042:56
   });
 
   // Initialize persisted active downloads on startup
-  chrome.storage.local.get("activeDownloads", (res) => {
-    if (res.activeDownloads) {
-      Object.assign(activeDownloads, res.activeDownloads);
-      log(
-        "Restored active downloads from storage:",
-        Object.keys(activeDownloads).length
-      );
-      updateQueueUI();
-    }
-  });
+  chrome.storage.local.get("activeDownloads", (res) => {});
 }
 

[NoCoverage] BlockStatement
extension/src/background.ts:1043:30
 
   // Initialize persisted active downloads on startup
   chrome.storage.local.get("activeDownloads", (res) => {
-    if (res.activeDownloads) {
-      Object.assign(activeDownloads, res.activeDownloads);
-      log(
-        "Restored active downloads from storage:",
-        Object.keys(activeDownloads).length
-      );
-      updateQueueUI();
-    }
+    if (res.activeDownloads) {}
   });
 }

[NoCoverage] ConditionalExpression
extension/src/background.ts:1043:9
 
   // Initialize persisted active downloads on startup
   chrome.storage.local.get("activeDownloads", (res) => {
-    if (res.activeDownloads) {
+    if (false) {
       Object.assign(activeDownloads, res.activeDownloads);
       log(

[NoCoverage] StringLiteral
extension/src/background.ts:1046:9
     if (res.activeDownloads) {
       Object.assign(activeDownloads, res.activeDownloads);
       log(
-        "Restored active downloads from storage:",
+        "",
         Object.keys(activeDownloads).length
       );
