[Killed] ConditionalExpression
extension/src/constants.ts:73:5
 // Get current port configuration
 function getCurrentPortConfig() {
   return (
-    CENTRAL_PORT_CONFIG[
-      CURRENT_ENVIRONMENT as keyof typeof CENTRAL_PORT_CONFIG
-    ] || CENTRAL_PORT_CONFIG.development
+    true
   );
 }
killedBy: Background Script - Core Functions Server Status Functions checkServerStatus should return true for successful response
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
extension/src/constants.ts:73:5
 // Get current port configuration
 function getCurrentPortConfig() {
   return (
-    CENTRAL_PORT_CONFIG[
-      CURRENT_ENVIRONMENT as keyof typeof CENTRAL_PORT_CONFIG
-    ] || CENTRAL_PORT_CONFIG.development
+    false
   );
 }
killedBy: Background Script - Core Functions Server Status Functions checkServerStatus should return true for successful response
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
extension/src/constants.ts:80:41
 }
 
 // Convenience functions for accessing specific ports
-export function getServerPort(): number {
-  const config = getCurrentPortConfig();
-  return config.server_port;
-}
+export function getServerPort(): number {}
 
 export function getClientPort(): number {
killedBy: Background Script - Core Functions Server Status Functions checkServerStatus should return true for successful response
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[NoCoverage] BlockStatement
extension/src/constants.ts:115:52
   return config.docker_port;
 }
 
-export function isValidPort(port: number): boolean {
-  return MIN_PORT <= port && port <= MAX_PORT;
-}
+export function isValidPort(port: number): boolean {}
 
 export function normalizeLegacyPort(port: number): number {

[NoCoverage] EqualityOperator
extension/src/constants.ts:116:10
 }
 
 export function isValidPort(port: number): boolean {
-  return MIN_PORT <= port && port <= MAX_PORT;
+  return MIN_PORT < port && port <= MAX_PORT;
 }
 

[NoCoverage] LogicalOperator
extension/src/constants.ts:116:10
 }
 
 export function isValidPort(port: number): boolean {
-  return MIN_PORT <= port && port <= MAX_PORT;
+  return MIN_PORT <= port || port <= MAX_PORT;
 }
 

[NoCoverage] BlockStatement
extension/src/constants.ts:119:59
   return MIN_PORT <= port && port <= MAX_PORT;
 }
 
-export function normalizeLegacyPort(port: number): number {
-  return LEGACY_PORTS[port.toString()] || port;
-}
+export function normalizeLegacyPort(port: number): number {}
 
 // Backward compatibility - maintain existing constants for gradual migration

[NoCoverage] ConditionalExpression
extension/src/constants.ts:120:10
 }
 
 export function normalizeLegacyPort(port: number): number {
-  return LEGACY_PORTS[port.toString()] || port;
+  return false;
 }
 

[NoCoverage] LogicalOperator
extension/src/constants.ts:120:10
 }
 
 export function normalizeLegacyPort(port: number): number {
-  return LEGACY_PORTS[port.toString()] || port;
+  return LEGACY_PORTS[port.toString()] && port;
 }
 
