[NoCoverage] BlockStatement
extension/src/content.ts:24:70
 } from "./core/constants";
 
 // Skip location redefinition in test environment
-if (!(typeof process !== "undefined" && process.env.JEST_WORKER_ID)) {
-  try {
-    const originalLocation = window.location;
-    try {
-      delete (window as any).location;
-    } catch {
-      // no-op
-    }
-    Object.defineProperty(window, "location", {
-      configurable: true,
-      writable: true,
-      value: originalLocation,
-    });
-  } catch {
-    // no-op if unable to redefine location
-  }
-}
+if (!(typeof process !== "undefined" && process.env.JEST_WORKER_ID)) {}
 
 // Constants for configuration and state management - now using centralized constants

[NoCoverage] BlockStatement
extension/src/content.ts:25:7
 
 // Skip location redefinition in test environment
 if (!(typeof process !== "undefined" && process.env.JEST_WORKER_ID)) {
-  try {
-    const originalLocation = window.location;
-    try {
-      delete (window as any).location;
-    } catch {
-      // no-op
-    }
-    Object.defineProperty(window, "location", {
-      configurable: true,
-      writable: true,
-      value: originalLocation,
-    });
-  } catch {
+  try {} catch {
     // no-op if unable to redefine location
   }

[NoCoverage] BlockStatement
extension/src/content.ts:27:9
 if (!(typeof process !== "undefined" && process.env.JEST_WORKER_ID)) {
   try {
     const originalLocation = window.location;
-    try {
-      delete (window as any).location;
-    } catch {
+    try {} catch {
       // no-op
     }

[NoCoverage] BooleanLiteral
extension/src/content.ts:33:21
       // no-op
     }
     Object.defineProperty(window, "location", {
-      configurable: true,
+      configurable: false,
       writable: true,
       value: originalLocation,

[NoCoverage] BooleanLiteral
extension/src/content.ts:34:17
     }
     Object.defineProperty(window, "location", {
       configurable: true,
-      writable: true,
+      writable: false,
       value: originalLocation,
     });

[Survived] ObjectLiteral
extension/src/content.ts:84:32
 const _warn = (...args: any[]): void =>
   logger.warn(args.join(" "), { component: "content" });
 const error = (...args: any[]): void =>
-  logger.error(args.join(" "), { component: "content" });
+  logger.error(args.join(" "), {});
 
 // Detect if running under Jest tests (skip async observers/logs in test environment)

[Survived] StringLiteral
extension/src/content.ts:84:45
 const _warn = (...args: any[]): void =>
   logger.warn(args.join(" "), { component: "content" });
 const error = (...args: any[]): void =>
-  logger.error(args.join(" "), { component: "content" });
+  logger.error(args.join(" "), { component: "" });
 
 // Detect if running under Jest tests (skip async observers/logs in test environment)

[Killed] BlockStatement
extension/src/content.ts:97:55
  * Uses dynamic window.location.hostname to determine the storage key.
  * @returns A promise that resolves with the button state.
  */
-async function getButtonState(): Promise<ButtonState> {
-  const domain = getHostname();
-  return new Promise((resolve) => {
-    try {
-      chrome.storage.local.get(domain, (result) => {
-        if (chrome.runtime.lastError) {
-          error(
-            "Error getting button state from storage:",
-            chrome.runtime.lastError.message
-          );
-          resolve({ x: 10, y: 10, hidden: false });
-          return;
-        }
-        resolve((result as any)[domain] || { x: 10, y: 10, hidden: false });
-      });
-    } catch (e) {
-      error("Error getting button state from storage:", (e as Error).message);
-      resolve({ x: 10, y: 10, hidden: false });
-    }
-  });
-}
+async function getButtonState(): Promise<ButtonState> {}
 
 /**
killedBy: Content script button behaviors createOrUpdateButton positioning positions main button at stored x/y on generic host
statusReason: TypeError: Cannot read properties of undefined (reading 'x')

[Timeout] BlockStatement
extension/src/content.ts:99:35
  */
 async function getButtonState(): Promise<ButtonState> {
   const domain = getHostname();
-  return new Promise((resolve) => {
-    try {
-      chrome.storage.local.get(domain, (result) => {
-        if (chrome.runtime.lastError) {
-          error(
-            "Error getting button state from storage:",
-            chrome.runtime.lastError.message
-          );
-          resolve({ x: 10, y: 10, hidden: false });
-          return;
-        }
-        resolve((result as any)[domain] || { x: 10, y: 10, hidden: false });
-      });
-    } catch (e) {
-      error("Error getting button state from storage:", (e as Error).message);
-      resolve({ x: 10, y: 10, hidden: false });
-    }
-  });
+  return new Promise((resolve) => {});
 }
 

[Timeout] BlockStatement
extension/src/content.ts:100:9
 async function getButtonState(): Promise<ButtonState> {
   const domain = getHostname();
   return new Promise((resolve) => {
-    try {
-      chrome.storage.local.get(domain, (result) => {
-        if (chrome.runtime.lastError) {
-          error(
-            "Error getting button state from storage:",
-            chrome.runtime.lastError.message
-          );
-          resolve({ x: 10, y: 10, hidden: false });
-          return;
-        }
-        resolve((result as any)[domain] || { x: 10, y: 10, hidden: false });
-      });
-    } catch (e) {
+    try {} catch (e) {
       error("Error getting button state from storage:", (e as Error).message);
       resolve({ x: 10, y: 10, hidden: false });

[Timeout] BlockStatement
extension/src/content.ts:101:52
   const domain = getHostname();
   return new Promise((resolve) => {
     try {
-      chrome.storage.local.get(domain, (result) => {
-        if (chrome.runtime.lastError) {
-          error(
-            "Error getting button state from storage:",
-            chrome.runtime.lastError.message
-          );
-          resolve({ x: 10, y: 10, hidden: false });
-          return;
-        }
-        resolve((result as any)[domain] || { x: 10, y: 10, hidden: false });
-      });
+      chrome.storage.local.get(domain, (result) => {});
     } catch (e) {
       error("Error getting button state from storage:", (e as Error).message);

[Killed] ConditionalExpression
extension/src/content.ts:102:13
   return new Promise((resolve) => {
     try {
       chrome.storage.local.get(domain, (result) => {
-        if (chrome.runtime.lastError) {
+        if (false) {
           error(
             "Error getting button state from storage:",
killedBy: Content Script Tests Button State Management should handle storage errors gracefully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
extension/src/content.ts:102:39
   return new Promise((resolve) => {
     try {
       chrome.storage.local.get(domain, (result) => {
-        if (chrome.runtime.lastError) {
-          error(
-            "Error getting button state from storage:",
-            chrome.runtime.lastError.message
-          );
-          resolve({ x: 10, y: 10, hidden: false });
-          return;
-        }
+        if (chrome.runtime.lastError) {}
         resolve((result as any)[domain] || { x: 10, y: 10, hidden: false });
       });
killedBy: Content Script Tests Button State Management should handle storage errors gracefully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
extension/src/content.ts:107:43
             "Error getting button state from storage:",
             chrome.runtime.lastError.message
           );
-          resolve({ x: 10, y: 10, hidden: false });
+          resolve({ x: 10, y: 10, hidden: true });
           return;
         }
killedBy: Content Script Tests Button State Management should handle storage errors gracefully
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "hidden": false,
+   "hidden": true,

[Killed] ConditionalExpression
extension/src/content.ts:110:17
           resolve({ x: 10, y: 10, hidden: false });
           return;
         }
-        resolve((result as any)[domain] || { x: 10, y: 10, hidden: false });
+        resolve(false);
       });
     } catch (e) {
killedBy: Content Script Tests Button State Management should get button state from storage
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"hidden": false, "x": 50, "y": 60}
Received: false

[Killed] ConditionalExpression
extension/src/content.ts:110:17
           resolve({ x: 10, y: 10, hidden: false });
           return;
         }
-        resolve((result as any)[domain] || { x: 10, y: 10, hidden: false });
+        resolve(true);
       });
     } catch (e) {
killedBy: Content script button behaviors createOrUpdateButton positioning positions main button at stored x/y on generic host
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "50px"
Received: "10px"

[Timeout] BlockStatement
extension/src/content.ts:112:17
         }
         resolve((result as any)[domain] || { x: 10, y: 10, hidden: false });
       });
-    } catch (e) {
-      error("Error getting button state from storage:", (e as Error).message);
-      resolve({ x: 10, y: 10, hidden: false });
-    }
+    } catch (e) {}
   });
 }

[Killed] BooleanLiteral
extension/src/content.ts:114:39
       });
     } catch (e) {
       error("Error getting button state from storage:", (e as Error).message);
-      resolve({ x: 10, y: 10, hidden: false });
+      resolve({ x: 10, y: 10, hidden: true });
     }
   });
killedBy: getButtonState resolves default state when storage returns error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "hidden": false,
+   "hidden": true,

[Killed] BlockStatement
extension/src/content.ts:125:67
  * @param state - The button state to save.
  * @returns A promise that resolves when saving completes.
  */
-async function saveButtonState(state: ButtonState): Promise<void> {
-  const host = getHostname();
-  const data = { [host]: state };
-  return new Promise((resolve) => {
-    chrome.storage.local.set(data, () => {
-      if (chrome.runtime.lastError) {
-        error(
-          "Error saving button state to storage:",
-          chrome.runtime.lastError.message
-        );
-      }
-      resolve();
-    });
-  });
-}
+async function saveButtonState(state: ButtonState): Promise<void> {}
 
 /**
killedBy: Content Script Tests Button State Management should save button state to storage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"localhost": {"hidden": true, "x": 100, "y": 150}}, Any<Function>

Number of calls: 0

[Killed] ObjectLiteral
extension/src/content.ts:127:16
  */
 async function saveButtonState(state: ButtonState): Promise<void> {
   const host = getHostname();
-  const data = { [host]: state };
+  const data = {};
   return new Promise((resolve) => {
     chrome.storage.local.set(data, () => {
killedBy: Content Script Tests Button State Management should save button state to storage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "localhost": Object {
-     "hidden": true,

[Timeout] BlockStatement
extension/src/content.ts:128:35
 async function saveButtonState(state: ButtonState): Promise<void> {
   const host = getHostname();
   const data = { [host]: state };
-  return new Promise((resolve) => {
-    chrome.storage.local.set(data, () => {
-      if (chrome.runtime.lastError) {
-        error(
-          "Error saving button state to storage:",
-          chrome.runtime.lastError.message
-        );
-      }
-      resolve();
-    });
-  });
+  return new Promise((resolve) => {});
 }
 

[Timeout] BlockStatement
extension/src/content.ts:129:42
   const host = getHostname();
   const data = { [host]: state };
   return new Promise((resolve) => {
-    chrome.storage.local.set(data, () => {
-      if (chrome.runtime.lastError) {
-        error(
-          "Error saving button state to storage:",
-          chrome.runtime.lastError.message
-        );
-      }
-      resolve();
-    });
+    chrome.storage.local.set(data, () => {});
   });
 }

[Killed] ConditionalExpression
extension/src/content.ts:130:11
   const data = { [host]: state };
   return new Promise((resolve) => {
     chrome.storage.local.set(data, () => {
-      if (chrome.runtime.lastError) {
+      if (true) {
         error(
           "Error saving button state to storage:",
killedBy: Content Script Tests Button Creation and Management should reset button position
statusReason: TypeError: Cannot read properties of null (reading 'message')

[Killed] ConditionalExpression
extension/src/content.ts:130:11
   const data = { [host]: state };
   return new Promise((resolve) => {
     chrome.storage.local.set(data, () => {
-      if (chrome.runtime.lastError) {
+      if (false) {
         error(
           "Error saving button state to storage:",
killedBy: Content.ts additional branch coverage saveButtonState error handling logs error when saving state fails
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
extension/src/content.ts:146:71
  * @param videoElement - Optional video element.
  * @returns The button ID.
  */
-function getButtonId(videoElement: HTMLElement | null = null): string {
-  if (videoElement) {
-    return BUTTON_ID_PREFIX + Date.now();
-  } else {
-    return "evd-download-button-main";
-  }
-}
+function getButtonId(videoElement: HTMLElement | null = null): string {}
 
 /**
killedBy: content.ts UI functions createOrUpdateButton injects a download button into the DOM when no video element is provided
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /^evd-download-button-/
Received string:  "undefined"

[Killed] BlockStatement
extension/src/content.ts:147:21
  * @returns The button ID.
  */
 function getButtonId(videoElement: HTMLElement | null = null): string {
-  if (videoElement) {
-    return BUTTON_ID_PREFIX + Date.now();
-  } else {
+  if (videoElement) {} else {
     return "evd-download-button-main";
   }
killedBy: Content script button behaviors multiple video button injection should create a button for each video element
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 2
Received:    0

[Killed] ConditionalExpression
extension/src/content.ts:147:7
  * @returns The button ID.
  */
 function getButtonId(videoElement: HTMLElement | null = null): string {
-  if (videoElement) {
+  if (true) {
     return BUTTON_ID_PREFIX + Date.now();
   } else {
killedBy: Content Script Tests Button Creation and Management should create download button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "evd-download-button-main"
Received: "evd-download-button-1754552474255"

[Killed] ArithmeticOperator
extension/src/content.ts:148:12
  */
 function getButtonId(videoElement: HTMLElement | null = null): string {
   if (videoElement) {
-    return BUTTON_ID_PREFIX + Date.now();
+    return BUTTON_ID_PREFIX - Date.now();
   } else {
     return "evd-download-button-main";
killedBy: Content script button behaviors multiple video button injection should create a button for each video element
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 2
Received:    0

[Killed] BlockStatement
extension/src/content.ts:149:10
 function getButtonId(videoElement: HTMLElement | null = null): string {
   if (videoElement) {
     return BUTTON_ID_PREFIX + Date.now();
-  } else {
-    return "evd-download-button-main";
-  }
+  } else {}
 }
 
killedBy: Content script button behaviors createOrUpdateButton positioning positions main button at stored x/y on generic host
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BlockStatement
extension/src/content.ts:161:78
  * @returns {void}
  */
 function ensureDownloadButtonStyle(buttonElement: HTMLElement): void {
-  if (!document || !document.body || !document.body.contains(buttonElement)) {
-    return;
-  }
+  if (!document || !document.body || !document.body.contains(buttonElement)) {}
   const computedStyle = window.getComputedStyle(buttonElement);
   let _styleAdjusted = false; // For logging
killedBy: Content script button behaviors createOrUpdateButton positioning pins button to top-right on fresh YouTube page
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "20px"
Received: ""

[Killed] BooleanLiteral
extension/src/content.ts:161:20
  * @returns {void}
  */
 function ensureDownloadButtonStyle(buttonElement: HTMLElement): void {
-  if (!document || !document.body || !document.body.contains(buttonElement)) {
+  if (!document || document.body || !document.body.contains(buttonElement)) {
     return;
   }
killedBy: Content script button behaviors ensureDownloadButtonStyle should force display to block and opacity to 1 if needed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "block"
Received: "none"

[Survived] BooleanLiteral
extension/src/content.ts:165:24
     return;
   }
   const computedStyle = window.getComputedStyle(buttonElement);
-  let _styleAdjusted = false; // For logging
+  let _styleAdjusted = true; // For logging
 
   // Phase 1: Ensure critical visibility (display, opacity) regardless of state

[Killed] BlockStatement
extension/src/content.ts:168:41
   let _styleAdjusted = false; // For logging
 
   // Phase 1: Ensure critical visibility (display, opacity) regardless of state
-  if (computedStyle.display === "none") {
-    buttonElement.style.display = "block";
-    _styleAdjusted = true;
-    log('EVD button computed display was "none", forced to "block".');
-  }
+  if (computedStyle.display === "none") {}
   if (parseFloat(computedStyle.opacity) < 0.8) {
     buttonElement.style.opacity = "1";
killedBy: Content script button behaviors ensureDownloadButtonStyle should force display to block and opacity to 1 if needed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "block"
Received: "none"

[Killed] EqualityOperator
extension/src/content.ts:168:7
   let _styleAdjusted = false; // For logging
 
   // Phase 1: Ensure critical visibility (display, opacity) regardless of state
-  if (computedStyle.display === "none") {
+  if (computedStyle.display !== "none") {
     buttonElement.style.display = "block";
     _styleAdjusted = true;
killedBy: Content script button behaviors ensureDownloadButtonStyle should force display to block and opacity to 1 if needed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "block"
Received: "none"

[Survived] BooleanLiteral
extension/src/content.ts:170:22
   // Phase 1: Ensure critical visibility (display, opacity) regardless of state
   if (computedStyle.display === "none") {
     buttonElement.style.display = "block";
-    _styleAdjusted = true;
+    _styleAdjusted = false;
     log('EVD button computed display was "none", forced to "block".');
   }

[Survived] StringLiteral
extension/src/content.ts:171:9
   if (computedStyle.display === "none") {
     buttonElement.style.display = "block";
     _styleAdjusted = true;
-    log('EVD button computed display was "none", forced to "block".');
+    log("");
   }
   if (parseFloat(computedStyle.opacity) < 0.8) {

[Killed] BlockStatement
extension/src/content.ts:173:48
     _styleAdjusted = true;
     log('EVD button computed display was "none", forced to "block".');
   }
-  if (parseFloat(computedStyle.opacity) < 0.8) {
-    buttonElement.style.opacity = "1";
-    _styleAdjusted = true;
-    log('EVD button computed opacity was low, forced to "1".');
-  }
+  if (parseFloat(computedStyle.opacity) < 0.8) {}
 
   // Phase 2: Enforce guideline styles for the button's DEFAULT state
killedBy: Content script button behaviors ensureDownloadButtonStyle should force display to block and opacity to 1 if needed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1"
Received: "0.5"

[Killed] EqualityOperator
extension/src/content.ts:173:7
     _styleAdjusted = true;
     log('EVD button computed display was "none", forced to "block".');
   }
-  if (parseFloat(computedStyle.opacity) < 0.8) {
+  if (parseFloat(computedStyle.opacity) >= 0.8) {
     buttonElement.style.opacity = "1";
     _styleAdjusted = true;
killedBy: Content script button behaviors ensureDownloadButtonStyle should force display to block and opacity to 1 if needed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1"
Received: "0.5"

[Survived] BooleanLiteral
extension/src/content.ts:175:22
   }
   if (parseFloat(computedStyle.opacity) < 0.8) {
     buttonElement.style.opacity = "1";
-    _styleAdjusted = true;
+    _styleAdjusted = false;
     log('EVD button computed opacity was low, forced to "1".');
   }

[Killed] MethodExpression
extension/src/content.ts:181:36
 
   // Phase 2: Enforce guideline styles for the button's DEFAULT state
   const currentInlineBg = buttonElement.style.backgroundColor;
-  const isTemporaryFeedbackState = EVD_BUTTON_TEMPORARY_BACKGROUNDS.some(
-    (tmpBg) => {
-      const normalizedInline = currentInlineBg.replace(/\s/g, "");
-      const normalizedTmp = tmpBg.replace(/\s/g, "");
-      return normalizedInline === normalizedTmp;
-    }
-  );
+  const isTemporaryFeedbackState = EVD_BUTTON_TEMPORARY_BACKGROUNDS.every(tmpBg => {
+  const normalizedInline = currentInlineBg.replace(/\s/g, "");
+  const normalizedTmp = tmpBg.replace(/\s/g, "");
+  return normalizedInline === normalizedTmp;
+});
 
   if (!isTemporaryFeedbackState) {
killedBy: Content script button behaviors ensureDownloadButtonStyle should not override temporary feedback backgrounds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rgba(255,0,0,0.7)"
Received: "rgba(0,0,0,0.3)"

[Killed] BlockStatement
extension/src/content.ts:182:16
   // Phase 2: Enforce guideline styles for the button's DEFAULT state
   const currentInlineBg = buttonElement.style.backgroundColor;
   const isTemporaryFeedbackState = EVD_BUTTON_TEMPORARY_BACKGROUNDS.some(
-    (tmpBg) => {
-      const normalizedInline = currentInlineBg.replace(/\s/g, "");
-      const normalizedTmp = tmpBg.replace(/\s/g, "");
-      return normalizedInline === normalizedTmp;
-    }
+    (tmpBg) => {}
   );
 
killedBy: Content script button behaviors ensureDownloadButtonStyle should not override temporary feedback backgrounds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rgba(255,0,0,0.7)"
Received: "rgba(0,0,0,0.3)"

[Killed] StringLiteral
extension/src/content.ts:183:63
   const currentInlineBg = buttonElement.style.backgroundColor;
   const isTemporaryFeedbackState = EVD_BUTTON_TEMPORARY_BACKGROUNDS.some(
     (tmpBg) => {
-      const normalizedInline = currentInlineBg.replace(/\s/g, "");
+      const normalizedInline = currentInlineBg.replace(/\s/g, "Stryker was here!");
       const normalizedTmp = tmpBg.replace(/\s/g, "");
       return normalizedInline === normalizedTmp;
killedBy: Content script button behaviors ensureDownloadButtonStyle should not override temporary feedback backgrounds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rgba(255,0,0,0.7)"
Received: "rgba(0,0,0,0.3)"

[Killed] EqualityOperator
extension/src/content.ts:185:14
     (tmpBg) => {
       const normalizedInline = currentInlineBg.replace(/\s/g, "");
       const normalizedTmp = tmpBg.replace(/\s/g, "");
-      return normalizedInline === normalizedTmp;
+      return normalizedInline !== normalizedTmp;
     }
   );
killedBy: Content script button behaviors ensureDownloadButtonStyle should apply guideline styles if not in temporary feedback state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "4px"
Received: ""

[Killed] ConditionalExpression
extension/src/content.ts:185:14
     (tmpBg) => {
       const normalizedInline = currentInlineBg.replace(/\s/g, "");
       const normalizedTmp = tmpBg.replace(/\s/g, "");
-      return normalizedInline === normalizedTmp;
+      return false;
     }
   );
killedBy: Content script button behaviors ensureDownloadButtonStyle should not override temporary feedback backgrounds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rgba(255,0,0,0.7)"
Received: "rgba(0,0,0,0.3)"

[Killed] ConditionalExpression
extension/src/content.ts:189:7
     }
   );
 
-  if (!isTemporaryFeedbackState) {
+  if (false) {
     // Apply guideline styles
     Object.entries(EVD_BUTTON_GUIDELINE_STYLES).forEach(([prop, value]) => {
killedBy: Content script button behaviors ensureDownloadButtonStyle should apply guideline styles if not in temporary feedback state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "4px"
Received: ""

[Killed] BooleanLiteral
extension/src/content.ts:189:7
     }
   );
 
-  if (!isTemporaryFeedbackState) {
+  if (isTemporaryFeedbackState) {
     // Apply guideline styles
     Object.entries(EVD_BUTTON_GUIDELINE_STYLES).forEach(([prop, value]) => {
killedBy: Content script button behaviors ensureDownloadButtonStyle should apply guideline styles if not in temporary feedback state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "4px"
Received: ""

[Killed] BlockStatement
extension/src/content.ts:191:76
 
   if (!isTemporaryFeedbackState) {
     // Apply guideline styles
-    Object.entries(EVD_BUTTON_GUIDELINE_STYLES).forEach(([prop, value]) => {
-      if ((computedStyle as any)[prop] !== value) {
-        (buttonElement.style as any)[prop] = value;
-        _styleAdjusted = true;
-      }
-    });
+    Object.entries(EVD_BUTTON_GUIDELINE_STYLES).forEach(([prop, value]) => {});
   }
 }
killedBy: Content script button behaviors ensureDownloadButtonStyle should apply guideline styles if not in temporary feedback state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "4px"
Received: ""

[Killed] ConditionalExpression
extension/src/content.ts:192:11
   if (!isTemporaryFeedbackState) {
     // Apply guideline styles
     Object.entries(EVD_BUTTON_GUIDELINE_STYLES).forEach(([prop, value]) => {
-      if ((computedStyle as any)[prop] !== value) {
+      if (false) {
         (buttonElement.style as any)[prop] = value;
         _styleAdjusted = true;
killedBy: Content script button behaviors ensureDownloadButtonStyle should apply guideline styles if not in temporary feedback state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "4px"
Received: ""

[Killed] BlockStatement
extension/src/content.ts:192:51
   if (!isTemporaryFeedbackState) {
     // Apply guideline styles
     Object.entries(EVD_BUTTON_GUIDELINE_STYLES).forEach(([prop, value]) => {
-      if ((computedStyle as any)[prop] !== value) {
-        (buttonElement.style as any)[prop] = value;
-        _styleAdjusted = true;
-      }
+      if ((computedStyle as any)[prop] !== value) {}
     });
   }
killedBy: Content script button behaviors ensureDownloadButtonStyle should apply guideline styles if not in temporary feedback state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "4px"
Received: ""

[Survived] BooleanLiteral
extension/src/content.ts:194:26
     Object.entries(EVD_BUTTON_GUIDELINE_STYLES).forEach(([prop, value]) => {
       if ((computedStyle as any)[prop] !== value) {
         (buttonElement.style as any)[prop] = value;
-        _styleAdjusted = true;
+        _styleAdjusted = false;
       }
     });

[Killed] ConditionalExpression
extension/src/content.ts:209:7
   videoElement: HTMLElement | null = null
 ): Promise<HTMLElement> {
   // If we already have a button and no video is specified, return existing button
-  if (downloadButton && !videoElement) {
+  if (true) {
     ensureDownloadButtonStyle(downloadButton);
     return downloadButton;
killedBy: Content script button behaviors createOrUpdateButton positioning positions main button at stored x/y on generic host
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BooleanLiteral
extension/src/content.ts:209:25
   videoElement: HTMLElement | null = null
 ): Promise<HTMLElement> {
   // If we already have a button and no video is specified, return existing button
-  if (downloadButton && !videoElement) {
+  if (downloadButton && videoElement) {
     ensureDownloadButtonStyle(downloadButton);
     return downloadButton;
killedBy: Content.ts additional branch coverage createOrUpdateButton existing instance reuses the same button and reapplies styles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: <button class="evd-drag-handle download-button" id="evd-download-button-main" style="position: fixed; z-index: 2147483647; left: 10px; top: 10px; padding: 4px 8px; border-radius: 4px; background-color: rgba(0, 0, 0, 0.3); border-width: 1px; border-style

[Survived] LogicalOperator
extension/src/content.ts:215:7
   }
 
   // If we have a video and already injected a button for it, return that button
-  if (videoElement && injectedButtons.has(videoElement)) {
+  if (videoElement || injectedButtons.has(videoElement)) {
     const existingButton = injectedButtons.get(videoElement);
     if (existingButton && document.body.contains(existingButton)) {
