[Survived] ConditionalExpression
extension/src/content.ts:215:7
   }
 
   // If we have a video and already injected a button for it, return that button
-  if (videoElement && injectedButtons.has(videoElement)) {
+  if (true) {
     const existingButton = injectedButtons.get(videoElement);
     if (existingButton && document.body.contains(existingButton)) {

[NoCoverage] LogicalOperator
extension/src/content.ts:217:9
   // If we have a video and already injected a button for it, return that button
   if (videoElement && injectedButtons.has(videoElement)) {
     const existingButton = injectedButtons.get(videoElement);
-    if (existingButton && document.body.contains(existingButton)) {
+    if (existingButton || document.body.contains(existingButton)) {
       ensureDownloadButtonStyle(existingButton);
       return existingButton;

[NoCoverage] ConditionalExpression
extension/src/content.ts:217:9
   // If we have a video and already injected a button for it, return that button
   if (videoElement && injectedButtons.has(videoElement)) {
     const existingButton = injectedButtons.get(videoElement);
-    if (existingButton && document.body.contains(existingButton)) {
+    if (false) {
       ensureDownloadButtonStyle(existingButton);
       return existingButton;

[Killed] StringLiteral
extension/src/content.ts:224:38
   }
 
   // Create a new button
-  const btn = document.createElement("button");
+  const btn = document.createElement("");
   btn.id = getButtonId(videoElement);
   btn.textContent = BUTTON_TEXT;
killedBy: Content script button behaviors createOrUpdateButton positioning positions main button at stored x/y on generic host
statusReason: InvalidCharacterError: "" did not match the Name production

[Killed] BlockStatement
extension/src/content.ts:238:67
   const state = await getButtonState();
 
   // Apply position (respect hidden state later)
-  if (typeof state.x === "number" && typeof state.y === "number") {
-    btn.style.left = String(state.x) + "px";
-    btn.style.top = String(state.y) + "px";
-  } else {
+  if (typeof state.x === "number" && typeof state.y === "number") {} else {
     // Default position in top-left
     btn.style.left = "10px";
killedBy: Content script button behaviors createOrUpdateButton positioning positions main button at stored x/y on generic host
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "50px"
Received: ""

[Killed] EqualityOperator
extension/src/content.ts:238:38
   const state = await getButtonState();
 
   // Apply position (respect hidden state later)
-  if (typeof state.x === "number" && typeof state.y === "number") {
+  if (typeof state.x === "number" && typeof state.y !== "number") {
     btn.style.left = String(state.x) + "px";
     btn.style.top = String(state.y) + "px";
killedBy: Content script button behaviors createOrUpdateButton positioning positions main button at stored x/y on generic host
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "50px"
Received: "10px"

[Killed] StringLiteral
extension/src/content.ts:240:39
   // Apply position (respect hidden state later)
   if (typeof state.x === "number" && typeof state.y === "number") {
     btn.style.left = String(state.x) + "px";
-    btn.style.top = String(state.y) + "px";
+    btn.style.top = String(state.y) + "";
   } else {
     // Default position in top-left
killedBy: Content script button behaviors createOrUpdateButton positioning positions main button at stored x/y on generic host
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "60px"
Received: ""

[NoCoverage] BlockStatement
extension/src/content.ts:241:10
   if (typeof state.x === "number" && typeof state.y === "number") {
     btn.style.left = String(state.x) + "px";
     btn.style.top = String(state.y) + "px";
-  } else {
-    // Default position in top-left
-    btn.style.left = "10px";
-    btn.style.top = "10px";
-  }
+  } else {}
 
   // Add to document

[NoCoverage] StringLiteral
extension/src/content.ts:244:21
   } else {
     // Default position in top-left
     btn.style.left = "10px";
-    btn.style.top = "10px";
+    btn.style.top = "";
   }
 

[Killed] BlockStatement
extension/src/content.ts:257:44
   ensureDownloadButtonStyle(btn);
 
   // Add event listeners for dragging
-  btn.addEventListener("mousedown", (e) => {
-    if (e.button !== 0) return; // Only left mouse button
-
-    const rect = btn.getBoundingClientRect();
-    stateManager.updateUIState({
-      isDragging: true,
-      buttonPosition: {
-        x: e.clientX - rect.left,
-        y: e.clientY - rect.top,
-      },
-    });
-
-    // Add document-level listeners
-    document.addEventListener("mousemove", onDrag);
-    document.addEventListener("mouseup", onDragEnd);
-
-    // Prevent text selection during drag
-    e.preventDefault();
-  });
+  btn.addEventListener("mousedown", (e) => {});
 
   // Add click listener for download action
killedBy: Content script button behaviors Button Drag and Drop should move the button on mousemove
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not "10px"

[Killed] EqualityOperator
extension/src/content.ts:258:9
 
   // Add event listeners for dragging
   btn.addEventListener("mousedown", (e) => {
-    if (e.button !== 0) return; // Only left mouse button
+    if (e.button === 0) return; // Only left mouse button
 
     const rect = btn.getBoundingClientRect();
killedBy: Content script button behaviors Button Drag and Drop should move the button on mousemove
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not "10px"

[Killed] ConditionalExpression
extension/src/content.ts:258:9
 
   // Add event listeners for dragging
   btn.addEventListener("mousedown", (e) => {
-    if (e.button !== 0) return; // Only left mouse button
+    if (true) return; // Only left mouse button
 
     const rect = btn.getBoundingClientRect();
killedBy: Content script button behaviors Button Drag and Drop should move the button on mousemove
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not "10px"

[Killed] BooleanLiteral
extension/src/content.ts:262:19
 
     const rect = btn.getBoundingClientRect();
     stateManager.updateUIState({
-      isDragging: true,
+      isDragging: false,
       buttonPosition: {
         x: e.clientX - rect.left,
killedBy: Content script button behaviors Button Drag and Drop should move the button on mousemove
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not "10px"

[Killed] ObjectLiteral
extension/src/content.ts:263:23
     const rect = btn.getBoundingClientRect();
     stateManager.updateUIState({
       isDragging: true,
-      buttonPosition: {
-        x: e.clientX - rect.left,
-        y: e.clientY - rect.top,
-      },
+      buttonPosition: {},
     });
 
killedBy: Content script button behaviors Button Drag and Drop should move the button on mousemove
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not "10px"

[Survived] ArithmeticOperator
extension/src/content.ts:264:12
     stateManager.updateUIState({
       isDragging: true,
       buttonPosition: {
-        x: e.clientX - rect.left,
+        x: e.clientX + rect.left,
         y: e.clientY - rect.top,
       },

[Survived] ArithmeticOperator
extension/src/content.ts:265:12
       isDragging: true,
       buttonPosition: {
         x: e.clientX - rect.left,
-        y: e.clientY - rect.top,
+        y: e.clientY + rect.top,
       },
     });

[Killed] StringLiteral
extension/src/content.ts:271:31
 
     // Add document-level listeners
     document.addEventListener("mousemove", onDrag);
-    document.addEventListener("mouseup", onDragEnd);
+    document.addEventListener("", onDragEnd);
 
     // Prevent text selection during drag
killedBy: Content script button behaviors Button Drag and Drop should stop dragging on mouseup and save the new position
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"example.com": {"hidden": false, "x": Any<Number>, "y": Any<Number>}}, Any<Function>

Number of calls: 0

[Survived] StringLiteral
extension/src/content.ts:278:24
   });
 
   // Add click listener for download action
-  btn.addEventListener("click", async (e) => {
+  btn.addEventListener("", async (e) => {
     // Only handle as click if not dragged significantly
     const currentState = stateManager.getUIState();

[NoCoverage] ArithmeticOperator
extension/src/content.ts:282:32
     // Only handle as click if not dragged significantly
     const currentState = stateManager.getUIState();
     const now = Date.now();
-    const timeSinceLastClick = now - currentState.lastClickTime;
+    const timeSinceLastClick = now + currentState.lastClickTime;
 
     if (!currentState.isDragging && timeSinceLastClick > CLICK_THRESHOLD) {

[NoCoverage] ConditionalExpression
extension/src/content.ts:284:37
     const now = Date.now();
     const timeSinceLastClick = now - currentState.lastClickTime;
 
-    if (!currentState.isDragging && timeSinceLastClick > CLICK_THRESHOLD) {
+    if (!currentState.isDragging && true) {
       // Update last click time
       stateManager.updateUIState({ lastClickTime: now });

[NoCoverage] ConditionalExpression
extension/src/content.ts:284:9
     const now = Date.now();
     const timeSinceLastClick = now - currentState.lastClickTime;
 
-    if (!currentState.isDragging && timeSinceLastClick > CLICK_THRESHOLD) {
+    if (true) {
       // Update last click time
       stateManager.updateUIState({ lastClickTime: now });

[NoCoverage] ConditionalExpression
extension/src/content.ts:296:11
       try {
         // Determine download URL, avoid blob URLs by falling back to page URL
         const rawUrl =
-          videoElement &&
-          videoElement.tagName === "VIDEO" &&
-          (videoElement as HTMLVideoElement).src
+          false
             ? (videoElement as HTMLVideoElement).src
             : window.location.href;

[NoCoverage] LogicalOperator
extension/src/content.ts:296:11
       try {
         // Determine download URL, avoid blob URLs by falling back to page URL
         const rawUrl =
-          videoElement &&
-          videoElement.tagName === "VIDEO" &&
+          videoElement || videoElement.tagName === "VIDEO" &&
           (videoElement as HTMLVideoElement).src
             ? (videoElement as HTMLVideoElement).src

[NoCoverage] ConditionalExpression
extension/src/content.ts:297:11
         // Determine download URL, avoid blob URLs by falling back to page URL
         const rawUrl =
           videoElement &&
-          videoElement.tagName === "VIDEO" &&
+          true &&
           (videoElement as HTMLVideoElement).src
             ? (videoElement as HTMLVideoElement).src

[NoCoverage] EqualityOperator
extension/src/content.ts:297:11
         // Determine download URL, avoid blob URLs by falling back to page URL
         const rawUrl =
           videoElement &&
-          videoElement.tagName === "VIDEO" &&
+          videoElement.tagName !== "VIDEO" &&
           (videoElement as HTMLVideoElement).src
             ? (videoElement as HTMLVideoElement).src

[NoCoverage] MethodExpression
extension/src/content.ts:301:21
           (videoElement as HTMLVideoElement).src
             ? (videoElement as HTMLVideoElement).src
             : window.location.href;
-        const url = rawUrl.startsWith("blob:") ? window.location.href : rawUrl;
+        const url = rawUrl.endsWith("blob:") ? window.location.href : rawUrl;
 
         // Send message to background script

[NoCoverage] ObjectLiteral
extension/src/content.ts:305:11
 
         // Send message to background script
         chrome.runtime.sendMessage(
-          { type: "downloadVideo", url: url },
+          {},
           (response) => {
             if (chrome.runtime.lastError) {

[NoCoverage] BlockStatement
extension/src/content.ts:307:43
         chrome.runtime.sendMessage(
           { type: "downloadVideo", url: url },
           (response) => {
-            if (chrome.runtime.lastError) {
-              error(
-                "Error sending download request:",
-                chrome.runtime.lastError.message
-              );
-              btn.classList.remove("download-sending");
-              btn.classList.add("download-error");
-              setTimeout(() => {
-                btn.classList.remove("download-error");
-              }, 2000);
-              return;
-            }
+            if (chrome.runtime.lastError) {}
 
             if (response && response.status === "success") {

[NoCoverage] ConditionalExpression
extension/src/content.ts:307:17
         chrome.runtime.sendMessage(
           { type: "downloadVideo", url: url },
           (response) => {
-            if (chrome.runtime.lastError) {
+            if (true) {
               error(
                 "Error sending download request:",

[NoCoverage] StringLiteral
extension/src/content.ts:309:17
           (response) => {
             if (chrome.runtime.lastError) {
               error(
-                "Error sending download request:",
+                "",
                 chrome.runtime.lastError.message
               );

[NoCoverage] BlockStatement
extension/src/content.ts:314:32
               );
               btn.classList.remove("download-sending");
               btn.classList.add("download-error");
-              setTimeout(() => {
-                btn.classList.remove("download-error");
-              }, 2000);
+              setTimeout(() => {}, 2000);
               return;
             }

[NoCoverage] StringLiteral
extension/src/content.ts:315:38
               btn.classList.remove("download-sending");
               btn.classList.add("download-error");
               setTimeout(() => {
-                btn.classList.remove("download-error");
+                btn.classList.remove("");
               }, 2000);
               return;

[NoCoverage] BlockStatement
extension/src/content.ts:320:60
               return;
             }
 
-            if (response && response.status === "success") {
-              // Success feedback
-              btn.classList.remove("download-sending");
-              btn.classList.add("download-success");
-              setTimeout(() => {
-                btn.classList.remove("download-success");
-              }, 2000);
-            } else {
+            if (response && response.status === "success") {} else {
               // Error feedback
               btn.classList.remove("download-sending");

[NoCoverage] LogicalOperator
extension/src/content.ts:320:17
               return;
             }
 
-            if (response && response.status === "success") {
+            if (response || response.status === "success") {
               // Success feedback
               btn.classList.remove("download-sending");

[NoCoverage] BlockStatement
extension/src/content.ts:324:32
               // Success feedback
               btn.classList.remove("download-sending");
               btn.classList.add("download-success");
-              setTimeout(() => {
-                btn.classList.remove("download-success");
-              }, 2000);
+              setTimeout(() => {}, 2000);
             } else {
               // Error feedback

[NoCoverage] BlockStatement
extension/src/content.ts:327:20
               setTimeout(() => {
                 btn.classList.remove("download-success");
               }, 2000);
-            } else {
-              // Error feedback
-              btn.classList.remove("download-sending");
-              btn.classList.add("download-error");
-              setTimeout(() => {
-                btn.classList.remove("download-error");
-              }, 2000);
-            }
+            } else {}
           }
         );

[NoCoverage] StringLiteral
extension/src/content.ts:329:36
               }, 2000);
             } else {
               // Error feedback
-              btn.classList.remove("download-sending");
+              btn.classList.remove("");
               btn.classList.add("download-error");
               setTimeout(() => {

[NoCoverage] BlockStatement
extension/src/content.ts:337:21
             }
           }
         );
-      } catch (err) {
-        error("Error initiating download:", err);
-        btn.classList.remove("download-sending");
-        btn.classList.add("download-error");
-        setTimeout(() => {
-          btn.classList.remove("download-error");
-        }, 2000);
-      }
+      } catch (err) {}
     }
   });

[NoCoverage] StringLiteral
extension/src/content.ts:338:15
           }
         );
       } catch (err) {
-        error("Error initiating download:", err);
+        error("", err);
         btn.classList.remove("download-sending");
         btn.classList.add("download-error");

[NoCoverage] StringLiteral
extension/src/content.ts:339:30
         );
       } catch (err) {
         error("Error initiating download:", err);
-        btn.classList.remove("download-sending");
+        btn.classList.remove("");
         btn.classList.add("download-error");
         setTimeout(() => {

[Killed] ConditionalExpression
extension/src/content.ts:349:7
   });
 
   // If this is for a specific video, store in our map
-  if (videoElement) {
+  if (true) {
     injectedButtons.set(videoElement, btn);
   } else {
killedBy: Content script button behaviors Button Drag and Drop should stop dragging on mouseup and save the new position
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"example.com": {"hidden": false, "x": Any<Number>, "y": Any<Number>}}, Any<Function>

Number of calls: 0

[Survived] ConditionalExpression
extension/src/content.ts:349:7
   });
 
   // If this is for a specific video, store in our map
-  if (videoElement) {
+  if (false) {
     injectedButtons.set(videoElement, btn);
   } else {

[Killed] BlockStatement
extension/src/content.ts:351:10
   // If this is for a specific video, store in our map
   if (videoElement) {
     injectedButtons.set(videoElement, btn);
-  } else {
-    // Store in centralized state and assign to global button
-    stateManager.updateUIState({ buttonPosition: { x: 10, y: 10 } });
-    downloadButton = btn;
-  }
+  } else {}
 
   // Apply hidden state if needed
killedBy: Content script button behaviors Button Drag and Drop should stop dragging on mouseup and save the new position
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"example.com": {"hidden": false, "x": Any<Number>, "y": Any<Number>}}, Any<Function>

Number of calls: 0

[NoCoverage] BlockStatement
extension/src/content.ts:358:21
   }
 
   // Apply hidden state if needed
-  if (state.hidden) {
-    btn.style.display = "none";
-  }
+  if (state.hidden) {}
 
   // Set up observer to detect button removal

[Survived] ConditionalExpression
extension/src/content.ts:358:7
   }
 
   // Apply hidden state if needed
-  if (state.hidden) {
+  if (false) {
     btn.style.display = "none";
   }

[Survived] ConditionalExpression
extension/src/content.ts:363:7
   }
 
   // Set up observer to detect button removal
-  if (!buttonObserver && !isJest) {
+  if (false) {
     // Only observe DOM mutations outside of Jest tests to avoid async logs
     buttonObserver = new MutationObserver((mutations) => {

[Survived] BooleanLiteral
extension/src/content.ts:363:26
   }
 
   // Set up observer to detect button removal
-  if (!buttonObserver && !isJest) {
+  if (!buttonObserver && isJest) {
     // Only observe DOM mutations outside of Jest tests to avoid async logs
     buttonObserver = new MutationObserver((mutations) => {

[NoCoverage] BlockStatement
extension/src/content.ts:365:58
   // Set up observer to detect button removal
   if (!buttonObserver && !isJest) {
     // Only observe DOM mutations outside of Jest tests to avoid async logs
-    buttonObserver = new MutationObserver((mutations) => {
-      for (const mutation of mutations) {
-        for (const node of Array.from(mutation.removedNodes)) {
-          if (
-            node instanceof HTMLElement &&
-            node.id &&
-            node.id.startsWith(BUTTON_ID_PREFIX)
-          ) {
-            log("Button was removed, re-adding");
-            createOrUpdateButton();
-            return;
-          }
-        }
-      }
-    });
+    buttonObserver = new MutationObserver((mutations) => {});
 
     buttonObserver.observe(document.body, {

[NoCoverage] BlockStatement
extension/src/content.ts:366:41
   if (!buttonObserver && !isJest) {
     // Only observe DOM mutations outside of Jest tests to avoid async logs
     buttonObserver = new MutationObserver((mutations) => {
-      for (const mutation of mutations) {
-        for (const node of Array.from(mutation.removedNodes)) {
-          if (
-            node instanceof HTMLElement &&
-            node.id &&
-            node.id.startsWith(BUTTON_ID_PREFIX)
-          ) {
-            log("Button was removed, re-adding");
-            createOrUpdateButton();
-            return;
-          }
-        }
-      }
+      for (const mutation of mutations) {}
     });
 

[NoCoverage] BlockStatement
extension/src/content.ts:367:63
     // Only observe DOM mutations outside of Jest tests to avoid async logs
     buttonObserver = new MutationObserver((mutations) => {
       for (const mutation of mutations) {
-        for (const node of Array.from(mutation.removedNodes)) {
-          if (
-            node instanceof HTMLElement &&
-            node.id &&
-            node.id.startsWith(BUTTON_ID_PREFIX)
-          ) {
-            log("Button was removed, re-adding");
-            createOrUpdateButton();
-            return;
-          }
-        }
+        for (const node of Array.from(mutation.removedNodes)) {}
       }
     });

[NoCoverage] ConditionalExpression
extension/src/content.ts:369:13
       for (const mutation of mutations) {
         for (const node of Array.from(mutation.removedNodes)) {
           if (
-            node instanceof HTMLElement &&
-            node.id &&
-            node.id.startsWith(BUTTON_ID_PREFIX)
+            true
           ) {
             log("Button was removed, re-adding");

[NoCoverage] ConditionalExpression
extension/src/content.ts:369:13
       for (const mutation of mutations) {
         for (const node of Array.from(mutation.removedNodes)) {
           if (
-            node instanceof HTMLElement &&
-            node.id &&
+            true &&
             node.id.startsWith(BUTTON_ID_PREFIX)
           ) {

[NoCoverage] MethodExpression
extension/src/content.ts:371:13
           if (
             node instanceof HTMLElement &&
             node.id &&
-            node.id.startsWith(BUTTON_ID_PREFIX)
+            node.id.endsWith(BUTTON_ID_PREFIX)
           ) {
             log("Button was removed, re-adding");

[NoCoverage] BlockStatement
extension/src/content.ts:372:13
             node instanceof HTMLElement &&
             node.id &&
             node.id.startsWith(BUTTON_ID_PREFIX)
-          ) {
-            log("Button was removed, re-adding");
-            createOrUpdateButton();
-            return;
-          }
+          ) {}
         }
       }

[NoCoverage] StringLiteral
extension/src/content.ts:373:17
             node.id &&
             node.id.startsWith(BUTTON_ID_PREFIX)
           ) {
-            log("Button was removed, re-adding");
+            log("");
             createOrUpdateButton();
             return;

[NoCoverage] ObjectLiteral
extension/src/content.ts:381:43
       }
     });
 
-    buttonObserver.observe(document.body, {
-      childList: true,
-      subtree: true,
-    });
+    buttonObserver.observe(document.body, {});
   }
 

[NoCoverage] BooleanLiteral
extension/src/content.ts:382:18
     });
 
     buttonObserver.observe(document.body, {
-      childList: true,
+      childList: false,
       subtree: true,
     });

[NoCoverage] BooleanLiteral
extension/src/content.ts:383:16
 
     buttonObserver.observe(document.body, {
       childList: true,
-      subtree: true,
+      subtree: false,
     });
   }

[Killed] BlockStatement
extension/src/content.ts:394:42
  * Handle dragging of the button
  * @param event - The mouse move event
  */
-function onDrag(event: MouseEvent): void {
-  const uiState = stateManager.getUIState();
-  if (!uiState.isDragging || !downloadButton) return;
-
-  event.preventDefault();
-
-  // Calculate new position using centralized state
-  const x = event.clientX - uiState.buttonPosition.x;
-  const y = event.clientY - uiState.buttonPosition.y;
-
-  // Update button position
-  downloadButton.style.left = String(x) + "px";
-  downloadButton.style.top = String(y) + "px";
-}
+function onDrag(event: MouseEvent): void {}
 
 /**
killedBy: Content script button behaviors Button Drag and Drop should move the button on mousemove
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not "10px"

[Killed] BooleanLiteral
extension/src/content.ts:396:30
  */
 function onDrag(event: MouseEvent): void {
   const uiState = stateManager.getUIState();
-  if (!uiState.isDragging || !downloadButton) return;
+  if (!uiState.isDragging || downloadButton) return;
 
   event.preventDefault();
killedBy: Content script button behaviors Button Drag and Drop should move the button on mousemove
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not "10px"

[Killed] BooleanLiteral
extension/src/content.ts:396:7
  */
 function onDrag(event: MouseEvent): void {
   const uiState = stateManager.getUIState();
-  if (!uiState.isDragging || !downloadButton) return;
+  if (uiState.isDragging || !downloadButton) return;
 
   event.preventDefault();
killedBy: Content script button behaviors Button Drag and Drop should move the button on mousemove
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not "10px"

[Timeout] ArithmeticOperator
extension/src/content.ts:401:13
   event.preventDefault();
 
   // Calculate new position using centralized state
-  const x = event.clientX - uiState.buttonPosition.x;
+  const x = event.clientX + uiState.buttonPosition.x;
   const y = event.clientY - uiState.buttonPosition.y;
 

[Survived] ArithmeticOperator
extension/src/content.ts:402:13
 
   // Calculate new position using centralized state
   const x = event.clientX - uiState.buttonPosition.x;
-  const y = event.clientY - uiState.buttonPosition.y;
+  const y = event.clientY + uiState.buttonPosition.y;
 
   // Update button position

[Timeout] StringLiteral
extension/src/content.ts:405:43
   const y = event.clientY - uiState.buttonPosition.y;
 
   // Update button position
-  downloadButton.style.left = String(x) + "px";
+  downloadButton.style.left = String(x) + "";
   downloadButton.style.top = String(y) + "px";
 }

[Killed] StringLiteral
extension/src/content.ts:406:42
 
   // Update button position
   downloadButton.style.left = String(x) + "px";
-  downloadButton.style.top = String(y) + "px";
+  downloadButton.style.top = String(y) + "";
 }
 
killedBy: Content script button behaviors Button Drag and Drop should move the button on mousemove
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not "10px"

[Survived] BooleanLiteral
extension/src/content.ts:417:44
   if (!uiState.isDragging || !downloadButton) return;
 
   // Update centralized state
-  stateManager.updateUIState({ isDragging: false });
+  stateManager.updateUIState({ isDragging: true });
 
   // Remove document-level listeners

[Survived] ObjectLiteral
extension/src/content.ts:417:30
   if (!uiState.isDragging || !downloadButton) return;
 
   // Update centralized state
-  stateManager.updateUIState({ isDragging: false });
+  stateManager.updateUIState({});
 
   // Remove document-level listeners

[Survived] BooleanLiteral
extension/src/content.ts:431:17
   // Update centralized state with new position
   stateManager.updateUIState({
     buttonPosition: { x, y },
-    isDragging: false,
+    isDragging: true,
   });
 

[Killed] BlockStatement
extension/src/content.ts:448:53
 /**
  * Reset button position to default (top-left)
  */
-async function resetButtonPosition(): Promise<void> {
-  if (!downloadButton) return;
-
-  // Reset to default position
-  downloadButton.style.left = "10px";
-  downloadButton.style.top = "10px";
-
-  // Get current hidden state
-  const state = await getButtonState();
-
-  // Save new position
-  await saveButtonState({
-    x: 10,
-    y: 10,
-    hidden: state.hidden,
-  });
-}
+async function resetButtonPosition(): Promise<void> {}
 
 /**
killedBy: Content script button behaviors hidden and reset behavior resets button position via resetButtonPosition
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "10px"
Received: "123px"

[Killed] ConditionalExpression
extension/src/content.ts:449:7
  * Reset button position to default (top-left)
  */
 async function resetButtonPosition(): Promise<void> {
-  if (!downloadButton) return;
+  if (true) return;
 
   // Reset to default position
killedBy: Content script button behaviors hidden and reset behavior resets button position via resetButtonPosition
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "10px"
Received: "123px"
