[Killed] BooleanLiteral
extension/src/content.ts:449:7
  * Reset button position to default (top-left)
  */
 async function resetButtonPosition(): Promise<void> {
-  if (!downloadButton) return;
+  if (downloadButton) return;
 
   // Reset to default position
killedBy: Content Script Tests Button Creation and Management should reset button position
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "10px"
Received: "100px"

[Killed] BlockStatement
extension/src/content.ts:470:69
  * Set whether the button is hidden or shown
  * @param hidden - Whether to hide the button
  */
-async function setButtonHiddenState(hidden: boolean): Promise<void> {
-  if (!downloadButton) return;
-
-  // Set display style
-  downloadButton.style.display = hidden ? "none" : "block";
-
-  // Get current position
-  const rect = downloadButton.getBoundingClientRect();
-  const x = rect.left;
-  const y = rect.top;
-
-  // Save state
-  await saveButtonState({
-    x,
-    y,
-    hidden,
-  });
-}
+async function setButtonHiddenState(hidden: boolean): Promise<void> {}
 
 /**
killedBy: Content script button behaviors hidden and reset behavior hides and shows button via setButtonHiddenState
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "none"
Received: ""

[Killed] BooleanLiteral
extension/src/content.ts:471:7
  * @param hidden - Whether to hide the button
  */
 async function setButtonHiddenState(hidden: boolean): Promise<void> {
-  if (!downloadButton) return;
+  if (downloadButton) return;
 
   // Set display style
killedBy: Content script button behaviors hidden and reset behavior hides and shows button via setButtonHiddenState
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "none"
Received: ""

[Killed] ConditionalExpression
extension/src/content.ts:471:7
  * @param hidden - Whether to hide the button
  */
 async function setButtonHiddenState(hidden: boolean): Promise<void> {
-  if (!downloadButton) return;
+  if (true) return;
 
   // Set display style
killedBy: Content script button behaviors hidden and reset behavior hides and shows button via setButtonHiddenState
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "none"
Received: ""

[Killed] ObjectLiteral
extension/src/content.ts:482:25
   const y = rect.top;
 
   // Save state
-  await saveButtonState({
-    x,
-    y,
-    hidden,
-  });
+  await saveButtonState({});
 }
 
killedBy: Content script button behaviors hidden and reset behavior hides and shows button via setButtonHiddenState
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "example.com": Object {
-     "hidden": true,

[Killed] BlockStatement
extension/src/content.ts:494:58
  * @param video - The video element to check
  * @returns Whether the video is significant
  */
-function isSignificantVideo(video: HTMLElement): boolean {
-  // Only consider HTMLVideoElement and IFrameElement
-  if (video instanceof HTMLVideoElement) {
-    // Exclude ad containers
-    const parent = video.parentElement;
-    if (parent && parent.classList.contains("ad-banner")) {
-      return false;
-    }
-    const rect = video.getBoundingClientRect();
-    const isVisible = rect.width > 0 && rect.height > 0;
-    const isSignificantSize = rect.width >= 200 && rect.height >= 150;
-    const hasSrc = !!(video as HTMLVideoElement).src;
-    return isVisible && isSignificantSize && hasSrc;
-  } else if (video instanceof HTMLIFrameElement) {
-    // Always consider iframes significant
-    return true;
-  }
-  return false;
-}
+function isSignificantVideo(video: HTMLElement): boolean {}
 
 /**
killedBy: Content Script Tests Video Detection should detect significant video elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
extension/src/content.ts:496:42
  */
 function isSignificantVideo(video: HTMLElement): boolean {
   // Only consider HTMLVideoElement and IFrameElement
-  if (video instanceof HTMLVideoElement) {
-    // Exclude ad containers
-    const parent = video.parentElement;
-    if (parent && parent.classList.contains("ad-banner")) {
-      return false;
-    }
-    const rect = video.getBoundingClientRect();
-    const isVisible = rect.width > 0 && rect.height > 0;
-    const isSignificantSize = rect.width >= 200 && rect.height >= 150;
-    const hasSrc = !!(video as HTMLVideoElement).src;
-    return isVisible && isSignificantSize && hasSrc;
-  } else if (video instanceof HTMLIFrameElement) {
+  if (video instanceof HTMLVideoElement) {} else if (video instanceof HTMLIFrameElement) {
     // Always consider iframes significant
     return true;
killedBy: Content Script Tests Video Detection should detect significant video elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
extension/src/content.ts:496:7
  */
 function isSignificantVideo(video: HTMLElement): boolean {
   // Only consider HTMLVideoElement and IFrameElement
-  if (video instanceof HTMLVideoElement) {
+  if (false) {
     // Exclude ad containers
     const parent = video.parentElement;
killedBy: Content Script Tests Video Detection should detect significant video elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
extension/src/content.ts:499:59
   if (video instanceof HTMLVideoElement) {
     // Exclude ad containers
     const parent = video.parentElement;
-    if (parent && parent.classList.contains("ad-banner")) {
-      return false;
-    }
+    if (parent && parent.classList.contains("ad-banner")) {}
     const rect = video.getBoundingClientRect();
     const isVisible = rect.width > 0 && rect.height > 0;
killedBy: isSignificantVideo returns false for ad video inside ad container
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
extension/src/content.ts:499:9
   if (video instanceof HTMLVideoElement) {
     // Exclude ad containers
     const parent = video.parentElement;
-    if (parent && parent.classList.contains("ad-banner")) {
+    if (false) {
       return false;
     }
killedBy: isSignificantVideo returns false for ad video inside ad container
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
extension/src/content.ts:500:14
     // Exclude ad containers
     const parent = video.parentElement;
     if (parent && parent.classList.contains("ad-banner")) {
-      return false;
+      return true;
     }
     const rect = video.getBoundingClientRect();
killedBy: isSignificantVideo returns false if video parent has ad-banner class
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
extension/src/content.ts:503:23
       return false;
     }
     const rect = video.getBoundingClientRect();
-    const isVisible = rect.width > 0 && rect.height > 0;
+    const isVisible = rect.width <= 0 && rect.height > 0;
     const isSignificantSize = rect.width >= 200 && rect.height >= 150;
     const hasSrc = !!(video as HTMLVideoElement).src;
killedBy: isSignificantVideo returns true for visible video with sufficient dimensions and src
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
extension/src/content.ts:503:41
       return false;
     }
     const rect = video.getBoundingClientRect();
-    const isVisible = rect.width > 0 && rect.height > 0;
+    const isVisible = rect.width > 0 && rect.height <= 0;
     const isSignificantSize = rect.width >= 200 && rect.height >= 150;
     const hasSrc = !!(video as HTMLVideoElement).src;
killedBy: isSignificantVideo returns true for significant video elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
extension/src/content.ts:504:31
     }
     const rect = video.getBoundingClientRect();
     const isVisible = rect.width > 0 && rect.height > 0;
-    const isSignificantSize = rect.width >= 200 && rect.height >= 150;
+    const isSignificantSize = rect.width < 200 && rect.height >= 150;
     const hasSrc = !!(video as HTMLVideoElement).src;
     return isVisible && isSignificantSize && hasSrc;
killedBy: isSignificantVideo returns true for visible video with sufficient dimensions and src
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
extension/src/content.ts:504:31
     }
     const rect = video.getBoundingClientRect();
     const isVisible = rect.width > 0 && rect.height > 0;
-    const isSignificantSize = rect.width >= 200 && rect.height >= 150;
+    const isSignificantSize = rect.width >= 200 || rect.height >= 150;
     const hasSrc = !!(video as HTMLVideoElement).src;
     return isVisible && isSignificantSize && hasSrc;
killedBy: isSignificantVideo returns false if video is too small (<200x150)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
extension/src/content.ts:505:20
     const rect = video.getBoundingClientRect();
     const isVisible = rect.width > 0 && rect.height > 0;
     const isSignificantSize = rect.width >= 200 && rect.height >= 150;
-    const hasSrc = !!(video as HTMLVideoElement).src;
+    const hasSrc = !(video as HTMLVideoElement).src;
     return isVisible && isSignificantSize && hasSrc;
   } else if (video instanceof HTMLIFrameElement) {
killedBy: isSignificantVideo returns false if video has no src
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
extension/src/content.ts:506:12
     const isVisible = rect.width > 0 && rect.height > 0;
     const isSignificantSize = rect.width >= 200 && rect.height >= 150;
     const hasSrc = !!(video as HTMLVideoElement).src;
-    return isVisible && isSignificantSize && hasSrc;
+    return false;
   } else if (video instanceof HTMLIFrameElement) {
     // Always consider iframes significant
killedBy: isSignificantVideo returns true for significant video elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
extension/src/content.ts:506:12
     const isVisible = rect.width > 0 && rect.height > 0;
     const isSignificantSize = rect.width >= 200 && rect.height >= 150;
     const hasSrc = !!(video as HTMLVideoElement).src;
-    return isVisible && isSignificantSize && hasSrc;
+    return true;
   } else if (video instanceof HTMLIFrameElement) {
     // Always consider iframes significant
killedBy: isSignificantVideo returns false if video is not visible (width or height zero)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
extension/src/content.ts:507:14
     const isSignificantSize = rect.width >= 200 && rect.height >= 150;
     const hasSrc = !!(video as HTMLVideoElement).src;
     return isVisible && isSignificantSize && hasSrc;
-  } else if (video instanceof HTMLIFrameElement) {
+  } else if (true) {
     // Always consider iframes significant
     return true;
killedBy: isSignificantVideo returns false for non-video and non-iframe elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
extension/src/content.ts:507:14
     const isSignificantSize = rect.width >= 200 && rect.height >= 150;
     const hasSrc = !!(video as HTMLVideoElement).src;
     return isVisible && isSignificantSize && hasSrc;
-  } else if (video instanceof HTMLIFrameElement) {
+  } else if (false) {
     // Always consider iframes significant
     return true;
killedBy: isSignificantVideo returns true for an iframe
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
extension/src/content.ts:509:12
     return isVisible && isSignificantSize && hasSrc;
   } else if (video instanceof HTMLIFrameElement) {
     // Always consider iframes significant
-    return true;
+    return false;
   }
   return false;
killedBy: isSignificantVideo returns true for an iframe
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[NoCoverage] BlockStatement
extension/src/content.ts:519:61
  */
 async function findVideosAndInjectButtons(): Promise<void> {
   // Don't run on extension pages
-  if (window.location.href.includes("chrome-extension://")) {
-    return;
-  }
+  if (window.location.href.includes("chrome-extension://")) {}
 
   // Create global button if not already present

[NoCoverage] ConditionalExpression
extension/src/content.ts:519:7
  */
 async function findVideosAndInjectButtons(): Promise<void> {
   // Don't run on extension pages
-  if (window.location.href.includes("chrome-extension://")) {
+  if (true) {
     return;
   }

[NoCoverage] ConditionalExpression
extension/src/content.ts:524:7
   }
 
   // Create global button if not already present
-  if (!downloadButton) {
+  if (true) {
     downloadButton = await createOrUpdateButton();
     const currentState = stateManager.getUIState();

[NoCoverage] BlockStatement
extension/src/content.ts:524:24
   }
 
   // Create global button if not already present
-  if (!downloadButton) {
-    downloadButton = await createOrUpdateButton();
-    const currentState = stateManager.getUIState();
-    stateManager.updateUIState({ checksDone: currentState.checksDone + 1 });
-  }
+  if (!downloadButton) {}
 
   // Find all video elements and significant iframes

[NoCoverage] ArithmeticOperator
extension/src/content.ts:527:46
   if (!downloadButton) {
     downloadButton = await createOrUpdateButton();
     const currentState = stateManager.getUIState();
-    stateManager.updateUIState({ checksDone: currentState.checksDone + 1 });
+    stateManager.updateUIState({ checksDone: currentState.checksDone - 1 });
   }
 

[NoCoverage] BooleanLiteral
extension/src/content.ts:532:31
 
   // Find all video elements and significant iframes
   const videos = document.querySelectorAll<HTMLElement>(VIDEO_SELECTOR);
-  let foundSignificantVideo = false;
+  let foundSignificantVideo = true;
 
   for (const video of Array.from(videos)) {

[NoCoverage] BlockStatement
extension/src/content.ts:534:43
   const videos = document.querySelectorAll<HTMLElement>(VIDEO_SELECTOR);
   let foundSignificantVideo = false;
 
-  for (const video of Array.from(videos)) {
-    if (isSignificantVideo(video)) {
-      foundSignificantVideo = true;
-      // Only inject if we haven't already for this video
-      if (!injectedButtons.has(video)) {
-        await createOrUpdateButton(video);
-      }
-    }
-  }
+  for (const video of Array.from(videos)) {}
 
   // Clean up removed videos from our map

[NoCoverage] ConditionalExpression
extension/src/content.ts:535:9
   let foundSignificantVideo = false;
 
   for (const video of Array.from(videos)) {
-    if (isSignificantVideo(video)) {
+    if (true) {
       foundSignificantVideo = true;
       // Only inject if we haven't already for this video

[NoCoverage] BlockStatement
extension/src/content.ts:535:36
   let foundSignificantVideo = false;
 
   for (const video of Array.from(videos)) {
-    if (isSignificantVideo(video)) {
-      foundSignificantVideo = true;
-      // Only inject if we haven't already for this video
-      if (!injectedButtons.has(video)) {
-        await createOrUpdateButton(video);
-      }
-    }
+    if (isSignificantVideo(video)) {}
   }
 

[NoCoverage] BooleanLiteral
extension/src/content.ts:536:31
 
   for (const video of Array.from(videos)) {
     if (isSignificantVideo(video)) {
-      foundSignificantVideo = true;
+      foundSignificantVideo = false;
       // Only inject if we haven't already for this video
       if (!injectedButtons.has(video)) {

[NoCoverage] ConditionalExpression
extension/src/content.ts:538:11
     if (isSignificantVideo(video)) {
       foundSignificantVideo = true;
       // Only inject if we haven't already for this video
-      if (!injectedButtons.has(video)) {
+      if (true) {
         await createOrUpdateButton(video);
       }

[NoCoverage] BooleanLiteral
extension/src/content.ts:538:11
     if (isSignificantVideo(video)) {
       foundSignificantVideo = true;
       // Only inject if we haven't already for this video
-      if (!injectedButtons.has(video)) {
+      if (injectedButtons.has(video)) {
         await createOrUpdateButton(video);
       }

[NoCoverage] BlockStatement
extension/src/content.ts:545:42
   }
 
   // Clean up removed videos from our map
-  for (const [video] of injectedButtons) {
-    if (!document.body.contains(video)) {
-      const button = injectedButtons.get(video);
-      if (button && document.body.contains(button)) {
-        button.remove();
-      }
-      injectedButtons.delete(video);
-    }
-  }
+  for (const [video] of injectedButtons) {}
 
   // If we've checked MAX_CHECKS times and found no videos, clear the interval

[NoCoverage] BooleanLiteral
extension/src/content.ts:546:9
 
   // Clean up removed videos from our map
   for (const [video] of injectedButtons) {
-    if (!document.body.contains(video)) {
+    if (document.body.contains(video)) {
       const button = injectedButtons.get(video);
       if (button && document.body.contains(button)) {

[NoCoverage] ConditionalExpression
extension/src/content.ts:546:9
 
   // Clean up removed videos from our map
   for (const [video] of injectedButtons) {
-    if (!document.body.contains(video)) {
+    if (true) {
       const button = injectedButtons.get(video);
       if (button && document.body.contains(button)) {

[NoCoverage] BlockStatement
extension/src/content.ts:548:53
   for (const [video] of injectedButtons) {
     if (!document.body.contains(video)) {
       const button = injectedButtons.get(video);
-      if (button && document.body.contains(button)) {
-        button.remove();
-      }
+      if (button && document.body.contains(button)) {}
       injectedButtons.delete(video);
     }

[NoCoverage] ConditionalExpression
extension/src/content.ts:548:11
   for (const [video] of injectedButtons) {
     if (!document.body.contains(video)) {
       const button = injectedButtons.get(video);
-      if (button && document.body.contains(button)) {
+      if (false) {
         button.remove();
       }

[NoCoverage] LogicalOperator
extension/src/content.ts:558:5
   // If we've checked MAX_CHECKS times and found no videos, clear the interval
   const currentState = stateManager.getUIState();
   if (
-    !foundSignificantVideo &&
-    currentState.checksDone >= MAX_CHECKS &&
+    !foundSignificantVideo || currentState.checksDone >= MAX_CHECKS &&
     checkIntervalId
   ) {

[NoCoverage] LogicalOperator
extension/src/content.ts:558:5
   // If we've checked MAX_CHECKS times and found no videos, clear the interval
   const currentState = stateManager.getUIState();
   if (
-    !foundSignificantVideo &&
-    currentState.checksDone >= MAX_CHECKS &&
-    checkIntervalId
+    !foundSignificantVideo && currentState.checksDone >= MAX_CHECKS || checkIntervalId
   ) {
     clearInterval(checkIntervalId);

[NoCoverage] EqualityOperator
extension/src/content.ts:559:5
   const currentState = stateManager.getUIState();
   if (
     !foundSignificantVideo &&
-    currentState.checksDone >= MAX_CHECKS &&
+    currentState.checksDone > MAX_CHECKS &&
     checkIntervalId
   ) {

[NoCoverage] EqualityOperator
extension/src/content.ts:559:5
   const currentState = stateManager.getUIState();
   if (
     !foundSignificantVideo &&
-    currentState.checksDone >= MAX_CHECKS &&
+    currentState.checksDone < MAX_CHECKS &&
     checkIntervalId
   ) {

[NoCoverage] BlockStatement
extension/src/content.ts:561:5
     !foundSignificantVideo &&
     currentState.checksDone >= MAX_CHECKS &&
     checkIntervalId
-  ) {
-    clearInterval(checkIntervalId);
-    checkIntervalId = null;
-  }
+  ) {}
 }
 

[NoCoverage] ConditionalExpression
extension/src/content.ts:578:7
   await findVideosAndInjectButtons();
 
   // Set up interval to check for new videos
-  if (!checkIntervalId) {
+  if (false) {
     checkIntervalId = window.setInterval(() => {
       findVideosAndInjectButtons();

[NoCoverage] BlockStatement
extension/src/content.ts:578:25
   await findVideosAndInjectButtons();
 
   // Set up interval to check for new videos
-  if (!checkIntervalId) {
-    checkIntervalId = window.setInterval(() => {
-      findVideosAndInjectButtons();
-    }, CHECK_INTERVAL);
-  }
+  if (!checkIntervalId) {}
 
   // Listen for messages from background script or popup

[NoCoverage] BlockStatement
extension/src/content.ts:579:48
 
   // Set up interval to check for new videos
   if (!checkIntervalId) {
-    checkIntervalId = window.setInterval(() => {
-      findVideosAndInjectButtons();
-    }, CHECK_INTERVAL);
+    checkIntervalId = window.setInterval(() => {}, CHECK_INTERVAL);
   }
 

[NoCoverage] BlockStatement
extension/src/content.ts:585:75
   }
 
   // Listen for messages from background script or popup
-  chrome.runtime.onMessage.addListener((message, sender, sendResponse) => {
-    if (message.type === "resetButtonPosition") {
-      resetButtonPosition().then(() => sendResponse({ success: true }));
-      return true; // Keep channel open for async response
-    } else if (message.type === "toggleButtonVisibility") {
-      const hidden = message.hidden;
-      setButtonHiddenState(hidden).then(() => sendResponse({ success: true }));
-      return true; // Keep channel open for async response
-    }
-    return false;
-  });
+  chrome.runtime.onMessage.addListener((message, sender, sendResponse) => {});
 }
 

[NoCoverage] ConditionalExpression
extension/src/content.ts:586:9
 
   // Listen for messages from background script or popup
   chrome.runtime.onMessage.addListener((message, sender, sendResponse) => {
-    if (message.type === "resetButtonPosition") {
+    if (false) {
       resetButtonPosition().then(() => sendResponse({ success: true }));
       return true; // Keep channel open for async response

[NoCoverage] EqualityOperator
extension/src/content.ts:586:9
 
   // Listen for messages from background script or popup
   chrome.runtime.onMessage.addListener((message, sender, sendResponse) => {
-    if (message.type === "resetButtonPosition") {
+    if (message.type !== "resetButtonPosition") {
       resetButtonPosition().then(() => sendResponse({ success: true }));
       return true; // Keep channel open for async response

[NoCoverage] ArrowFunction
extension/src/content.ts:587:34
   // Listen for messages from background script or popup
   chrome.runtime.onMessage.addListener((message, sender, sendResponse) => {
     if (message.type === "resetButtonPosition") {
-      resetButtonPosition().then(() => sendResponse({ success: true }));
+      resetButtonPosition().then(() => undefined);
       return true; // Keep channel open for async response
     } else if (message.type === "toggleButtonVisibility") {

[NoCoverage] BooleanLiteral
extension/src/content.ts:587:64
   // Listen for messages from background script or popup
   chrome.runtime.onMessage.addListener((message, sender, sendResponse) => {
     if (message.type === "resetButtonPosition") {
-      resetButtonPosition().then(() => sendResponse({ success: true }));
+      resetButtonPosition().then(() => sendResponse({ success: false }));
       return true; // Keep channel open for async response
     } else if (message.type === "toggleButtonVisibility") {

[NoCoverage] BooleanLiteral
extension/src/content.ts:588:14
   chrome.runtime.onMessage.addListener((message, sender, sendResponse) => {
     if (message.type === "resetButtonPosition") {
       resetButtonPosition().then(() => sendResponse({ success: true }));
-      return true; // Keep channel open for async response
+      return false; // Keep channel open for async response
     } else if (message.type === "toggleButtonVisibility") {
       const hidden = message.hidden;

[NoCoverage] ConditionalExpression
extension/src/content.ts:589:16
     if (message.type === "resetButtonPosition") {
       resetButtonPosition().then(() => sendResponse({ success: true }));
       return true; // Keep channel open for async response
-    } else if (message.type === "toggleButtonVisibility") {
+    } else if (false) {
       const hidden = message.hidden;
       setButtonHiddenState(hidden).then(() => sendResponse({ success: true }));

[NoCoverage] BlockStatement
extension/src/content.ts:589:59
     if (message.type === "resetButtonPosition") {
       resetButtonPosition().then(() => sendResponse({ success: true }));
       return true; // Keep channel open for async response
-    } else if (message.type === "toggleButtonVisibility") {
-      const hidden = message.hidden;
-      setButtonHiddenState(hidden).then(() => sendResponse({ success: true }));
-      return true; // Keep channel open for async response
-    }
+    } else if (message.type === "toggleButtonVisibility") {}
     return false;
   });

[NoCoverage] ArrowFunction
extension/src/content.ts:591:41
       return true; // Keep channel open for async response
     } else if (message.type === "toggleButtonVisibility") {
       const hidden = message.hidden;
-      setButtonHiddenState(hidden).then(() => sendResponse({ success: true }));
+      setButtonHiddenState(hidden).then(() => undefined);
       return true; // Keep channel open for async response
     }

[NoCoverage] BooleanLiteral
extension/src/content.ts:591:71
       return true; // Keep channel open for async response
     } else if (message.type === "toggleButtonVisibility") {
       const hidden = message.hidden;
-      setButtonHiddenState(hidden).then(() => sendResponse({ success: true }));
+      setButtonHiddenState(hidden).then(() => sendResponse({ success: false }));
       return true; // Keep channel open for async response
     }

[NoCoverage] BooleanLiteral
extension/src/content.ts:592:14
     } else if (message.type === "toggleButtonVisibility") {
       const hidden = message.hidden;
       setButtonHiddenState(hidden).then(() => sendResponse({ success: true }));
-      return true; // Keep channel open for async response
+      return false; // Keep channel open for async response
     }
     return false;

[Killed] BlockStatement
extension/src/content.ts:602:40
  * For testing purposes only.
  * @private
  */
-function _resetStateForTesting(): void {
-  stateManager.reset();
-  downloadButton = null;
-  injectedButtons.clear();
-  if (buttonObserver) {
-    buttonObserver.disconnect();
-    buttonObserver = null;
-  }
-}
+function _resetStateForTesting(): void {}
 
 // Global listeners - initialize once
killedBy: Content script button behaviors Button Drag and Drop should move the button on mousemove
statusReason: TypeError: Cannot read properties of null (reading 'dispatchEvent')

[Killed] ConditionalExpression
extension/src/content.ts:606:7
   stateManager.reset();
   downloadButton = null;
   injectedButtons.clear();
-  if (buttonObserver) {
+  if (true) {
     buttonObserver.disconnect();
     buttonObserver = null;
killedBy: Content script button behaviors Button Drag and Drop should start dragging on mousedown
statusReason: TypeError: Cannot read properties of null (reading 'disconnect')

[Survived] ConditionalExpression
extension/src/content.ts:606:7
   stateManager.reset();
   downloadButton = null;
   injectedButtons.clear();
-  if (buttonObserver) {
+  if (false) {
     buttonObserver.disconnect();
     buttonObserver = null;

[NoCoverage] BlockStatement
extension/src/content.ts:614:52
 
 // Global listeners - initialize once
 if (typeof window !== "undefined") {
-  document.addEventListener("dragover", (event) => {
-    const uiState = stateManager.getUIState();
-    if (uiState.isDragging) {
-      event.preventDefault();
-    }
-  });
+  document.addEventListener("dragover", (event) => {});
 }
 

[NoCoverage] ConditionalExpression
extension/src/content.ts:616:9
 if (typeof window !== "undefined") {
   document.addEventListener("dragover", (event) => {
     const uiState = stateManager.getUIState();
-    if (uiState.isDragging) {
+    if (false) {
       event.preventDefault();
     }

[NoCoverage] BlockStatement
extension/src/content.ts:616:29
 if (typeof window !== "undefined") {
   document.addEventListener("dragover", (event) => {
     const uiState = stateManager.getUIState();
-    if (uiState.isDragging) {
-      event.preventDefault();
-    }
+    if (uiState.isDragging) {}
   });
 }

[NoCoverage] BlockStatement
extension/src/content.ts:639:70
 };
 
 // Initialize content script
-if (!(typeof process !== "undefined" && process.env.JEST_WORKER_ID)) {
-  init();
-}
+if (!(typeof process !== "undefined" && process.env.JEST_WORKER_ID)) {}
 
