[NoCoverage] BlockStatement
extension/src/core/constants.ts:259:11
 export function getNotificationMessage(
   messageKey: keyof typeof NOTIFICATION_MESSAGES,
   replacements: Record<string, string | number> = {}
-): string {
-  let message = NOTIFICATION_MESSAGES[messageKey] as string;
-
-  for (const [key, value] of Object.entries(replacements)) {
-    message = message.replace(new RegExp(`{${key}}`, "g"), String(value));
-  }
-
-  return message;
-}
+): string {}
 
 /**

[NoCoverage] BlockStatement
extension/src/core/constants.ts:262:60
 ): string {
   let message = NOTIFICATION_MESSAGES[messageKey] as string;
 
-  for (const [key, value] of Object.entries(replacements)) {
-    message = message.replace(new RegExp(`{${key}}`, "g"), String(value));
-  }
+  for (const [key, value] of Object.entries(replacements)) {}
 
   return message;

[NoCoverage] StringLiteral
extension/src/core/constants.ts:263:42
   let message = NOTIFICATION_MESSAGES[messageKey] as string;
 
   for (const [key, value] of Object.entries(replacements)) {
-    message = message.replace(new RegExp(`{${key}}`, "g"), String(value));
+    message = message.replace(new RegExp(``, "g"), String(value));
   }
 

[NoCoverage] BlockStatement
extension/src/core/constants.ts:275:11
 export function getStorageKey(
   key: keyof typeof STORAGE_KEYS,
   prefix?: string
-): string {
-  const storageKey = STORAGE_KEYS[key];
-  return prefix ? `${prefix}_${storageKey}` : storageKey;
-}
+): string {}
 
 /**

[NoCoverage] BlockStatement
extension/src/core/constants.ts:286:11
 export function getCSSSelector(
   selectorKey: keyof typeof DOM_SELECTORS,
   context?: string
-): string {
-  const selector = DOM_SELECTORS[selectorKey];
-  return context ? `${context} ${selector}` : selector;
-}
+): string {}
 
 /**

[NoCoverage] BlockStatement
extension/src/core/constants.ts:297:11
 export function getMessageType(
   typeKey: keyof typeof MESSAGE_TYPES,
   namespace?: string
-): string {
-  const messageType = MESSAGE_TYPES[typeKey];
-  return namespace ? `${namespace}:${messageType}` : messageType;
-}
+): string {}
 
 // ============================================================================

[NoCoverage] StringLiteral
extension/src/core/constants.ts:299:22
   namespace?: string
 ): string {
   const messageType = MESSAGE_TYPES[typeKey];
-  return namespace ? `${namespace}:${messageType}` : messageType;
+  return namespace ? `` : messageType;
 }
 
