[Killed] BlockStatement
extension/src/core/dom-manager.ts:32:36
   /**
    * Get the singleton instance of the DOM manager
    */
-  static getInstance(): DOMManager {
-    if (!DOMManager.instance) {
-      DOMManager.instance = new DOMManager();
-    }
-    return DOMManager.instance;
-  }
+  static getInstance(): DOMManager {}
 
   /**
killedBy: DOM Manager Tests Element Queries should get element by key
statusReason: TypeError: Cannot read properties of undefined (reading 'registerSelector')

[Killed] ConditionalExpression
extension/src/core/dom-manager.ts:33:9
    * Get the singleton instance of the DOM manager
    */
   static getInstance(): DOMManager {
-    if (!DOMManager.instance) {
+    if (false) {
       DOMManager.instance = new DOMManager();
     }
killedBy: DOM Manager Tests Element Queries should get element by key
statusReason: TypeError: Cannot read properties of undefined (reading 'registerSelector')

[Killed] BooleanLiteral
extension/src/core/dom-manager.ts:33:9
    * Get the singleton instance of the DOM manager
    */
   static getInstance(): DOMManager {
-    if (!DOMManager.instance) {
+    if (DOMManager.instance) {
       DOMManager.instance = new DOMManager();
     }
killedBy: DOM Manager Tests Element Queries should get element by key
statusReason: TypeError: Cannot read properties of undefined (reading 'registerSelector')

[Killed] BlockStatement
extension/src/core/dom-manager.ts:85:57
   /**
    * Register a new selector
    */
-  registerSelector(key: string, selector: string): void {
-    this.selectors.set(key, selector);
-  }
+  registerSelector(key: string, selector: string): void {}
 
   /**
killedBy: DOM Manager Tests Element Queries should get element by key
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: HTMLButtonElement

Received value has no prototype
Received value: null

[Killed] BlockStatement
extension/src/core/dom-manager.ts:92:47
   /**
    * Get an element by key (cached)
    */
-  getElement(key: string): HTMLElement | null {
-    // Check cache first
-    if (this.cache[key] !== undefined) {
-      return this.cache[key];
-    }
-
-    // Get selector
-    const selector = this.selectors.get(key);
-    if (!selector) {
-      console.warn(`No selector registered for key: ${key}`);
-      return null;
-    }
-
-    // Query DOM
-    const element = document.querySelector(selector) as HTMLElement | null;
-
-    // Cache result (including null)
-    this.cache[key] = element;
-
-    return element;
-  }
+  getElement(key: string): HTMLElement | null {}
 
   /**
killedBy: DOM Manager Tests Element Queries should get element by key
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: HTMLButtonElement

Received value has no prototype
Received value: undefined

[Killed] EqualityOperator
extension/src/core/dom-manager.ts:94:9
    */
   getElement(key: string): HTMLElement | null {
     // Check cache first
-    if (this.cache[key] !== undefined) {
+    if (this.cache[key] === undefined) {
       return this.cache[key];
     }
killedBy: DOM Manager Tests Element Queries should get element by key
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: HTMLButtonElement

Received value has no prototype
Received value: undefined

[Killed] ConditionalExpression
extension/src/core/dom-manager.ts:94:9
    */
   getElement(key: string): HTMLElement | null {
     // Check cache first
-    if (this.cache[key] !== undefined) {
+    if (true) {
       return this.cache[key];
     }
killedBy: DOM Manager Tests Element Queries should get element by key
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: HTMLButtonElement

Received value has no prototype
Received value: undefined

[Killed] ConditionalExpression
extension/src/core/dom-manager.ts:100:9
 
     // Get selector
     const selector = this.selectors.get(key);
-    if (!selector) {
+    if (true) {
       console.warn(`No selector registered for key: ${key}`);
       return null;
killedBy: DOM Manager Tests Element Queries should get element by key
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: HTMLButtonElement

Received value has no prototype
Received value: null

[Killed] BooleanLiteral
extension/src/core/dom-manager.ts:100:9
 
     // Get selector
     const selector = this.selectors.get(key);
-    if (!selector) {
+    if (selector) {
       console.warn(`No selector registered for key: ${key}`);
       return null;
killedBy: DOM Manager Tests Element Queries should get element by key
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: HTMLButtonElement

Received value has no prototype
Received value: null

[Killed] BlockStatement
extension/src/core/dom-manager.ts:117:43
   /**
    * Get multiple elements by key
    */
-  getElements(key: string): HTMLElement[] {
-    const selector = this.selectors.get(key);
-    if (!selector) {
-      console.warn(`No selector registered for key: ${key}`);
-      return [];
-    }
-
-    return Array.from(document.querySelectorAll(selector)) as HTMLElement[];
-  }
+  getElements(key: string): HTMLElement[] {}
 
   /**
killedBy: DOM Manager Tests Element Queries should get multiple elements by key
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[NoCoverage] StringLiteral
extension/src/core/dom-manager.ts:120:20
   getElements(key: string): HTMLElement[] {
     const selector = this.selectors.get(key);
     if (!selector) {
-      console.warn(`No selector registered for key: ${key}`);
+      console.warn(``);
       return [];
     }

[Killed] BlockStatement
extension/src/core/dom-manager.ts:130:55
   /**
    * Get an element by direct selector (not cached)
    */
-  querySelector(selector: string): HTMLElement | null {
-    return document.querySelector(selector) as HTMLElement | null;
-  }
+  querySelector(selector: string): HTMLElement | null {}
 
   /**
killedBy: DOM Manager Tests Element Queries should query selector directly
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: HTMLButtonElement

Received value has no prototype
Received value: undefined

[Timeout] BlockStatement
extension/src/core/dom-manager.ts:137:53
   /**
    * Get multiple elements by direct selector (not cached)
    */
-  querySelectorAll(selector: string): HTMLElement[] {
-    return Array.from(document.querySelectorAll(selector)) as HTMLElement[];
-  }
+  querySelectorAll(selector: string): HTMLElement[] {}
 
   /**

[Killed] BlockStatement
extension/src/core/dom-manager.ts:148:18
     tag: string,
     attributes: Record<string, string> = {},
     textContent?: string
-  ): HTMLElement {
-    const element = document.createElement(tag);
-
-    // Set attributes
-    for (const [key, value] of Object.entries(attributes)) {
-      element.setAttribute(key, value);
-    }
-
-    // Set text content if provided
-    if (textContent) {
-      element.textContent = textContent;
-    }
-
-    return element;
-  }
+  ): HTMLElement {}
 
   /**
killedBy: DOM Manager Tests Element Creation should create elements with attributes
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: HTMLDivElement

Received value has no prototype
Received value: undefined

[Killed] BlockStatement
extension/src/core/dom-manager.ts:152:60
     const element = document.createElement(tag);
 
     // Set attributes
-    for (const [key, value] of Object.entries(attributes)) {
-      element.setAttribute(key, value);
-    }
+    for (const [key, value] of Object.entries(attributes)) {}
 
     // Set text content if provided
killedBy: DOM Manager Tests Element Creation should create elements with attributes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "new-element"
Received: ""

[Killed] ConditionalExpression
extension/src/core/dom-manager.ts:157:9
     }
 
     // Set text content if provided
-    if (textContent) {
+    if (false) {
       element.textContent = textContent;
     }
killedBy: DOM Manager Tests Element Creation should create elements with attributes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Test content"
Received: ""

[Killed] BlockStatement
extension/src/core/dom-manager.ts:157:22
     }
 
     // Set text content if provided
-    if (textContent) {
-      element.textContent = textContent;
-    }
+    if (textContent) {}
 
     return element;
killedBy: DOM Manager Tests Element Creation should create elements with attributes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Test content"
Received: ""

[Killed] BlockStatement
extension/src/core/dom-manager.ts:171:14
     key: string,
     event: string,
     handler: EventListener
-  ): boolean {
-    const element = this.getElement(key);
-    if (!element) {
-      console.warn(`Element not found for key: ${key}`);
-      return false;
-    }
-
-    element.addEventListener(event, handler);
-    return true;
-  }
+  ): boolean {}
 
   /**
killedBy: DOM Manager Tests Event Handling should add event listeners
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
extension/src/core/dom-manager.ts:173:9
     handler: EventListener
   ): boolean {
     const element = this.getElement(key);
-    if (!element) {
+    if (true) {
       console.warn(`Element not found for key: ${key}`);
       return false;
killedBy: DOM Manager Tests Event Handling should add event listeners
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
extension/src/core/dom-manager.ts:173:19
     handler: EventListener
   ): boolean {
     const element = this.getElement(key);
-    if (!element) {
-      console.warn(`Element not found for key: ${key}`);
-      return false;
-    }
+    if (!element) {}
 
     element.addEventListener(event, handler);
killedBy: DOM Manager Tests Event Handling should handle non-existent elements
statusReason: TypeError: Cannot read properties of null (reading 'addEventListener')

[Killed] BooleanLiteral
extension/src/core/dom-manager.ts:175:14
     const element = this.getElement(key);
     if (!element) {
       console.warn(`Element not found for key: ${key}`);
-      return false;
+      return true;
     }
 
killedBy: DOM Manager Tests Event Handling should handle non-existent elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
extension/src/core/dom-manager.ts:179:12
     }
 
     element.addEventListener(event, handler);
-    return true;
+    return false;
   }
 
killedBy: DOM Manager Tests Event Handling should add event listeners
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
extension/src/core/dom-manager.ts:189:14
     key: string,
     event: string,
     handler: EventListener
-  ): boolean {
-    const element = this.getElement(key);
-    if (!element) {
-      return false;
-    }
-
-    element.removeEventListener(event, handler);
-    return true;
-  }
+  ): boolean {}
 
   /**
killedBy: DOM Manager Tests Event Handling should remove event listeners
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
extension/src/core/dom-manager.ts:191:9
     handler: EventListener
   ): boolean {
     const element = this.getElement(key);
-    if (!element) {
+    if (false) {
       return false;
     }
killedBy: DOM Manager Tests Event Handling should remove event listeners
statusReason: TypeError: Cannot read properties of null (reading 'removeEventListener')

[NoCoverage] BooleanLiteral
extension/src/core/dom-manager.ts:192:14
   ): boolean {
     const element = this.getElement(key);
     if (!element) {
-      return false;
+      return true;
     }
 

[Killed] BooleanLiteral
extension/src/core/dom-manager.ts:196:12
     }
 
     element.removeEventListener(event, handler);
-    return true;
+    return false;
   }
 
killedBy: DOM Manager Tests Event Handling should remove event listeners
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
extension/src/core/dom-manager.ts:202:54
   /**
    * Set text content of an element
    */
-  setTextContent(key: string, text: string): boolean {
-    const element = this.getElement(key);
-    if (!element) {
-      return false;
-    }
-
-    element.textContent = text;
-    return true;
-  }
+  setTextContent(key: string, text: string): boolean {}
 
   /**
killedBy: DOM Manager Tests Content Manipulation should set text content
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BooleanLiteral
extension/src/core/dom-manager.ts:204:9
    */
   setTextContent(key: string, text: string): boolean {
     const element = this.getElement(key);
-    if (!element) {
+    if (element) {
       return false;
     }
killedBy: DOM Manager Tests Content Manipulation should set text content
statusReason: TypeError: Cannot set properties of null (setting 'textContent')

[Killed] BooleanLiteral
extension/src/core/dom-manager.ts:209:12
     }
 
     element.textContent = text;
-    return true;
+    return false;
   }
 
killedBy: DOM Manager Tests Content Manipulation should set text content
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
extension/src/core/dom-manager.ts:215:52
   /**
    * Set inner HTML of an element
    */
-  setInnerHTML(key: string, html: string): boolean {
-    const element = this.getElement(key);
-    if (!element) {
-      return false;
-    }
-
-    element.innerHTML = html;
-    return true;
-  }
+  setInnerHTML(key: string, html: string): boolean {}
 
   /**
killedBy: DOM Manager Tests Content Manipulation should set inner HTML
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BooleanLiteral
extension/src/core/dom-manager.ts:222:12
     }
 
     element.innerHTML = html;
-    return true;
+    return false;
   }
 
killedBy: DOM Manager Tests Content Manipulation should set inner HTML
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
extension/src/core/dom-manager.ts:228:53
   /**
    * Add CSS class to an element
    */
-  addClass(key: string, className: string): boolean {
-    const element = this.getElement(key);
-    if (!element) {
-      return false;
-    }
-
-    element.classList.add(className);
-    return true;
-  }
+  addClass(key: string, className: string): boolean {}
 
   /**
killedBy: DOM Manager Tests Class Management should add classes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BooleanLiteral
extension/src/core/dom-manager.ts:235:12
     }
 
     element.classList.add(className);
-    return true;
+    return false;
   }
 
killedBy: DOM Manager Tests Class Management should add classes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
extension/src/core/dom-manager.ts:241:56
   /**
    * Remove CSS class from an element
    */
-  removeClass(key: string, className: string): boolean {
-    const element = this.getElement(key);
-    if (!element) {
-      return false;
-    }
-
-    element.classList.remove(className);
-    return true;
-  }
+  removeClass(key: string, className: string): boolean {}
 
   /**
killedBy: DOM Manager Tests Class Management should remove classes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BooleanLiteral
extension/src/core/dom-manager.ts:248:12
     }
 
     element.classList.remove(className);
-    return true;
+    return false;
   }
 
killedBy: DOM Manager Tests Class Management should remove classes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
extension/src/core/dom-manager.ts:254:56
   /**
    * Toggle CSS class on an element
    */
-  toggleClass(key: string, className: string): boolean {
-    const element = this.getElement(key);
-    if (!element) {
-      return false;
-    }
-
-    element.classList.toggle(className);
-    return true;
-  }
+  toggleClass(key: string, className: string): boolean {}
 
   /**
killedBy: DOM Manager Tests Class Management should toggle classes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BooleanLiteral
extension/src/core/dom-manager.ts:261:12
     }
 
     element.classList.toggle(className);
-    return true;
+    return false;
   }
 
killedBy: DOM Manager Tests Class Management should toggle classes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
extension/src/core/dom-manager.ts:267:53
   /**
    * Check if element has CSS class
    */
-  hasClass(key: string, className: string): boolean {
-    const element = this.getElement(key);
-    if (!element) {
-      return false;
-    }
-
-    return element.classList.contains(className);
-  }
+  hasClass(key: string, className: string): boolean {}
 
   /**
killedBy: DOM Manager Tests Class Management should check if element has class
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
extension/src/core/dom-manager.ts:279:72
   /**
    * Set attribute on an element
    */
-  setAttribute(key: string, attribute: string, value: string): boolean {
-    const element = this.getElement(key);
-    if (!element) {
-      return false;
-    }
-
-    element.setAttribute(attribute, value);
-    return true;
-  }
+  setAttribute(key: string, attribute: string, value: string): boolean {}
 
   /**
killedBy: DOM Manager Tests Attribute Management should set attributes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BooleanLiteral
extension/src/core/dom-manager.ts:286:12
     }
 
     element.setAttribute(attribute, value);
-    return true;
+    return false;
   }
 
killedBy: DOM Manager Tests Attribute Management should set attributes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
extension/src/core/dom-manager.ts:292:63
   /**
    * Get attribute from an element
    */
-  getAttribute(key: string, attribute: string): string | null {
-    const element = this.getElement(key);
-    if (!element) {
-      return null;
-    }
-
-    return element.getAttribute(attribute);
-  }
+  getAttribute(key: string, attribute: string): string | null {}
 
   /**
killedBy: DOM Manager Tests Attribute Management should get attributes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "value"
Received: undefined

[Killed] BlockStatement
extension/src/core/dom-manager.ts:304:60
   /**
    * Remove attribute from an element
    */
-  removeAttribute(key: string, attribute: string): boolean {
-    const element = this.getElement(key);
-    if (!element) {
-      return false;
-    }
-
-    element.removeAttribute(attribute);
-    return true;
-  }
+  removeAttribute(key: string, attribute: string): boolean {}
 
   /**
killedBy: DOM Manager Tests Attribute Management should remove attributes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BooleanLiteral
extension/src/core/dom-manager.ts:311:12
     }
 
     element.removeAttribute(attribute);
-    return true;
+    return false;
   }
 
killedBy: DOM Manager Tests Attribute Management should remove attributes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
extension/src/core/dom-manager.ts:317:30
   /**
    * Show an element (remove hidden class or style)
    */
-  show(key: string): boolean {
-    const element = this.getElement(key);
-    if (!element) {
-      return false;
-    }
-
-    element.style.display = "";
-    element.classList.remove("hidden");
-    return true;
-  }
+  show(key: string): boolean {}
 
   /**
killedBy: DOM Manager Tests Visibility Management should show elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BooleanLiteral
extension/src/core/dom-manager.ts:325:12
 
     element.style.display = "";
     element.classList.remove("hidden");
-    return true;
+    return false;
   }
 
killedBy: DOM Manager Tests Visibility Management should show elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
extension/src/core/dom-manager.ts:331:30
   /**
    * Hide an element (add hidden class or style)
    */
-  hide(key: string): boolean {
-    const element = this.getElement(key);
-    if (!element) {
-      return false;
-    }
-
-    element.style.display = "none";
-    element.classList.add("hidden");
-    return true;
-  }
+  hide(key: string): boolean {}
 
   /**
killedBy: DOM Manager Tests Visibility Management should hide elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] StringLiteral
extension/src/core/dom-manager.ts:338:27
     }
 
     element.style.display = "none";
-    element.classList.add("hidden");
+    element.classList.add("");
     return true;
   }
killedBy: DOM Manager Tests Visibility Management should hide elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
extension/src/core/dom-manager.ts:339:12
 
     element.style.display = "none";
     element.classList.add("hidden");
-    return true;
+    return false;
   }
 
killedBy: DOM Manager Tests Visibility Management should hide elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
extension/src/core/dom-manager.ts:345:35
   /**
    * Check if element is visible
    */
-  isVisible(key: string): boolean {
-    const element = this.getElement(key);
-    if (!element) {
-      return false;
-    }
-
-    return (
-      element.style.display !== "none" && !element.classList.contains("hidden")
-    );
-  }
+  isVisible(key: string): boolean {}
 
   /**
killedBy: DOM Manager Tests Visibility Management should check visibility
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
extension/src/core/dom-manager.ts:352:7
     }
 
     return (
-      element.style.display !== "none" && !element.classList.contains("hidden")
+      true
     );
   }
killedBy: DOM Manager Tests Visibility Management should check visibility
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
extension/src/core/dom-manager.ts:352:7
     }
 
     return (
-      element.style.display !== "none" && !element.classList.contains("hidden")
+      true && !element.classList.contains("hidden")
     );
   }
killedBy: DOM Manager Tests Visibility Management should check visibility
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
extension/src/core/dom-manager.ts:359:22
   /**
    * Clear the cache
    */
-  clearCache(): void {
-    this.cache = {};
-  }
+  clearCache(): void {}
 
   /**
killedBy: DOM Manager Tests Event Handling should add event listeners
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] BlockStatement
extension/src/core/dom-manager.ts:366:36
   /**
    * Clear cache for a specific key
    */
-  clearCacheKey(key: string): void {
-    delete this.cache[key];
-  }
+  clearCacheKey(key: string): void {}
 
   /**

[Killed] BlockStatement
extension/src/core/dom-manager.ts:373:38
   /**
    * Get all registered selectors
    */
-  getRegisteredSelectors(): string[] {
-    return Array.from(this.selectors.keys());
-  }
+  getRegisteredSelectors(): string[] {}
 
   /**
killedBy: DOM Manager Tests Cache Management should clear cache
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] BlockStatement
extension/src/core/dom-manager.ts:380:37
   /**
    * Check if a selector is registered
    */
-  hasSelector(key: string): boolean {
-    return this.selectors.has(key);
-  }
+  hasSelector(key: string): boolean {}
 }
 
killedBy: DOM Manager Tests Selector Management should register selectors
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined
