[Survived] BlockStatement
extension/src/core/error-handler.ts:50:27
   async handle<T>(
     operation: () => T | Promise<T>,
     context: ErrorContext
-  ): Promise<ErrorResult> {
-    try {
-      const result = await operation();
-      return {
-        success: true,
-        data: result,
-      };
-    } catch (error) {
-      return this.handleError(error as Error, context);
-    }
-  }
+  ): Promise<ErrorResult> {}
 
   /**

[Timeout] BlockStatement
extension/src/core/error-handler.ts:51:9
     operation: () => T | Promise<T>,
     context: ErrorContext
   ): Promise<ErrorResult> {
-    try {
-      const result = await operation();
-      return {
-        success: true,
-        data: result,
-      };
-    } catch (error) {
+    try {} catch (error) {
       return this.handleError(error as Error, context);
     }

[Timeout] BooleanLiteral
extension/src/core/error-handler.ts:54:18
     try {
       const result = await operation();
       return {
-        success: true,
+        success: false,
         data: result,
       };

[NoCoverage] BlockStatement
extension/src/core/error-handler.ts:57:21
         success: true,
         data: result,
       };
-    } catch (error) {
-      return this.handleError(error as Error, context);
-    }
+    } catch (error) {}
   }
 

[NoCoverage] BlockStatement
extension/src/core/error-handler.ts:65:73
   /**
    * Handle sync operations with error handling
    */
-  handleSync<T>(operation: () => T, context: ErrorContext): ErrorResult {
-    try {
-      const result = operation();
-      return {
-        success: true,
-        data: result,
-      };
-    } catch (error) {
-      return this.handleError(error as Error, context);
-    }
-  }
+  handleSync<T>(operation: () => T, context: ErrorContext): ErrorResult {}
 
   /**

[NoCoverage] BlockStatement
extension/src/core/error-handler.ts:66:9
    * Handle sync operations with error handling
    */
   handleSync<T>(operation: () => T, context: ErrorContext): ErrorResult {
-    try {
-      const result = operation();
-      return {
-        success: true,
-        data: result,
-      };
-    } catch (error) {
+    try {} catch (error) {
       return this.handleError(error as Error, context);
     }

[NoCoverage] ObjectLiteral
extension/src/core/error-handler.ts:68:14
   handleSync<T>(operation: () => T, context: ErrorContext): ErrorResult {
     try {
       const result = operation();
-      return {
-        success: true,
-        data: result,
-      };
+      return {};
     } catch (error) {
       return this.handleError(error as Error, context);

[Timeout] BlockStatement
extension/src/core/error-handler.ts:83:17
   async wrap<T>(
     operation: () => T | Promise<T>,
     context: ErrorContext
-  ): Promise<T> {
-    try {
-      return await operation();
-    } catch (error) {
-      this.handleError(error as Error, context);
-      throw error;
-    }
-  }
+  ): Promise<T> {}
 
   /**

[Timeout] BlockStatement
extension/src/core/error-handler.ts:84:9
     operation: () => T | Promise<T>,
     context: ErrorContext
   ): Promise<T> {
-    try {
-      return await operation();
-    } catch (error) {
+    try {} catch (error) {
       this.handleError(error as Error, context);
       throw error;

[Timeout] BlockStatement
extension/src/core/error-handler.ts:86:21
   ): Promise<T> {
     try {
       return await operation();
-    } catch (error) {
-      this.handleError(error as Error, context);
-      throw error;
-    }
+    } catch (error) {}
   }
 

[NoCoverage] BlockStatement
extension/src/core/error-handler.ts:95:61
   /**
    * Wrap sync operations - throws on error
    */
-  wrapSync<T>(operation: () => T, context: ErrorContext): T {
-    try {
-      return operation();
-    } catch (error) {
-      this.handleError(error as Error, context);
-      throw error;
-    }
-  }
+  wrapSync<T>(operation: () => T, context: ErrorContext): T {}
 
   /**

[NoCoverage] BlockStatement
extension/src/core/error-handler.ts:96:9
    * Wrap sync operations - throws on error
    */
   wrapSync<T>(operation: () => T, context: ErrorContext): T {
-    try {
-      return operation();
-    } catch (error) {
+    try {} catch (error) {
       this.handleError(error as Error, context);
       throw error;

[NoCoverage] BlockStatement
extension/src/core/error-handler.ts:98:21
   wrapSync<T>(operation: () => T, context: ErrorContext): T {
     try {
       return operation();
-    } catch (error) {
-      this.handleError(error as Error, context);
-      throw error;
-    }
+    } catch (error) {}
   }
 

[NoCoverage] BlockStatement
extension/src/core/error-handler.ts:107:80
   /**
    * Register error callback for custom error handling
    */
-  onError(callback: (error: Error, context: ErrorContext) => void): () => void {
-    this.errorCallbacks.add(callback);
-    return () => {
-      this.errorCallbacks.delete(callback);
-    };
-  }
+  onError(callback: (error: Error, context: ErrorContext) => void): () => void {}
 
   /**

[NoCoverage] BlockStatement
extension/src/core/error-handler.ts:109:18
    */
   onError(callback: (error: Error, context: ErrorContext) => void): () => void {
     this.errorCallbacks.add(callback);
-    return () => {
-      this.errorCallbacks.delete(callback);
-    };
+    return () => {};
   }
 

[Survived] BlockStatement
extension/src/core/error-handler.ts:117:73
   /**
    * Internal error handling logic
    */
-  private handleError(error: Error, context: ErrorContext): ErrorResult {
-    // Log error with context
-    console.error(`[${context.component}] ${context.operation} failed:`, error);
-    console.error("Context:", context);
-
-    // Notify error callbacks
-    this.errorCallbacks.forEach((callback) => {
-      try {
-        callback(error, context);
-      } catch (callbackError) {
-        console.error("Error in error callback:", callbackError);
-      }
-    });
-
-    // Return error result
-    return {
-      success: false,
-      error: error.message,
-      userMessage:
-        context.userMessage || `Operation failed: ${context.operation}`,
-    };
-  }
+  private handleError(error: Error, context: ErrorContext): ErrorResult {}
 
   /**

[NoCoverage] BlockStatement
extension/src/core/error-handler.ts:123:47
     console.error("Context:", context);
 
     // Notify error callbacks
-    this.errorCallbacks.forEach((callback) => {
-      try {
-        callback(error, context);
-      } catch (callbackError) {
-        console.error("Error in error callback:", callbackError);
-      }
-    });
+    this.errorCallbacks.forEach((callback) => {});
 
     // Return error result

[NoCoverage] BlockStatement
extension/src/core/error-handler.ts:124:11
 
     // Notify error callbacks
     this.errorCallbacks.forEach((callback) => {
-      try {
-        callback(error, context);
-      } catch (callbackError) {
+      try {} catch (callbackError) {
         console.error("Error in error callback:", callbackError);
       }

[NoCoverage] BlockStatement
extension/src/core/error-handler.ts:126:31
     this.errorCallbacks.forEach((callback) => {
       try {
         callback(error, context);
-      } catch (callbackError) {
-        console.error("Error in error callback:", callbackError);
-      }
+      } catch (callbackError) {}
     });
 

[NoCoverage] StringLiteral
extension/src/core/error-handler.ts:127:23
       try {
         callback(error, context);
       } catch (callbackError) {
-        console.error("Error in error callback:", callbackError);
+        console.error("", callbackError);
       }
     });

[Survived] ObjectLiteral
extension/src/core/error-handler.ts:132:12
     });
 
     // Return error result
-    return {
-      success: false,
-      error: error.message,
-      userMessage:
-        context.userMessage || `Operation failed: ${context.operation}`,
-    };
+    return {};
   }
 

[Survived] BooleanLiteral
extension/src/core/error-handler.ts:133:16
 
     // Return error result
     return {
-      success: false,
+      success: true,
       error: error.message,
       userMessage:

[Survived] LogicalOperator
extension/src/core/error-handler.ts:136:9
       success: false,
       error: error.message,
       userMessage:
-        context.userMessage || `Operation failed: ${context.operation}`,
+        context.userMessage && `Operation failed: ${context.operation}`,
     };
   }

[Survived] ConditionalExpression
extension/src/core/error-handler.ts:136:9
       success: false,
       error: error.message,
       userMessage:
-        context.userMessage || `Operation failed: ${context.operation}`,
+        false,
     };
   }

[NoCoverage] ObjectLiteral
extension/src/core/error-handler.ts:156:42
         operation: "portDiscovery",
         userMessage: "Failed to discover server port",
       }),
-      downloadRequest: (url: string) => ({
-        component: "background",
-        operation: "downloadRequest",
-        data: { url },
-        userMessage: "Failed to send download request",
-      }),
+      downloadRequest: (url: string) => ({}),
       configUpdate: (config: any) => ({
         component: "background",

[NoCoverage] StringLiteral
extension/src/core/error-handler.ts:160:22
         component: "background",
         operation: "downloadRequest",
         data: { url },
-        userMessage: "Failed to send download request",
+        userMessage: "",
       }),
       configUpdate: (config: any) => ({

[NoCoverage] ObjectLiteral
extension/src/core/error-handler.ts:162:39
         data: { url },
         userMessage: "Failed to send download request",
       }),
-      configUpdate: (config: any) => ({
-        component: "background",
-        operation: "configUpdate",
-        data: { config },
-        userMessage: "Failed to update configuration",
-      }),
+      configUpdate: (config: any) => ({}),
     },
     content: {

[NoCoverage] ObjectLiteral
extension/src/core/error-handler.ts:165:15
       configUpdate: (config: any) => ({
         component: "background",
         operation: "configUpdate",
-        data: { config },
+        data: {},
         userMessage: "Failed to update configuration",
       }),

[NoCoverage] OptionalChaining
extension/src/core/error-handler.ts:173:31
       buttonInjection: (videoElement?: HTMLElement) => ({
         component: "content",
         operation: "buttonInjection",
-        data: { videoElement: videoElement?.tagName },
+        data: { videoElement: videoElement.tagName },
         userMessage: "Failed to inject download button",
       }),

[NoCoverage] ObjectLiteral
extension/src/core/error-handler.ts:173:15
       buttonInjection: (videoElement?: HTMLElement) => ({
         component: "content",
         operation: "buttonInjection",
-        data: { videoElement: videoElement?.tagName },
+        data: {},
         userMessage: "Failed to inject download button",
       }),

[NoCoverage] StringLiteral
extension/src/core/error-handler.ts:174:22
         component: "content",
         operation: "buttonInjection",
         data: { videoElement: videoElement?.tagName },
-        userMessage: "Failed to inject download button",
+        userMessage: "",
       }),
       videoDetection: () => ({

[NoCoverage] ObjectLiteral
extension/src/core/error-handler.ts:176:30
         data: { videoElement: videoElement?.tagName },
         userMessage: "Failed to inject download button",
       }),
-      videoDetection: () => ({
-        component: "content",
-        operation: "videoDetection",
-        userMessage: "Failed to detect videos on page",
-      }),
+      videoDetection: () => ({}),
       dragOperation: () => ({
         component: "content",

[NoCoverage] StringLiteral
extension/src/core/error-handler.ts:178:20
       }),
       videoDetection: () => ({
         component: "content",
-        operation: "videoDetection",
+        operation: "",
         userMessage: "Failed to detect videos on page",
       }),

[NoCoverage] ObjectLiteral
extension/src/core/error-handler.ts:181:29
         operation: "videoDetection",
         userMessage: "Failed to detect videos on page",
       }),
-      dragOperation: () => ({
-        component: "content",
-        operation: "dragOperation",
-        userMessage: "Failed to handle button drag",
-      }),
+      dragOperation: () => ({}),
     },
     popup: {

[NoCoverage] StringLiteral
extension/src/core/error-handler.ts:184:22
       dragOperation: () => ({
         component: "content",
         operation: "dragOperation",
-        userMessage: "Failed to handle button drag",
+        userMessage: "",
       }),
     },

[NoCoverage] StringLiteral
extension/src/core/error-handler.ts:191:22
       statusCheck: () => ({
         component: "popup",
         operation: "statusCheck",
-        userMessage: "Failed to check server status",
+        userMessage: "",
       }),
       configLoad: () => ({

[NoCoverage] StringLiteral
extension/src/core/error-handler.ts:194:20
         userMessage: "Failed to check server status",
       }),
       configLoad: () => ({
-        component: "popup",
+        component: "",
         operation: "configLoad",
         userMessage: "Failed to load configuration",

[NoCoverage] StringLiteral
extension/src/core/error-handler.ts:195:20
       }),
       configLoad: () => ({
         component: "popup",
-        operation: "configLoad",
+        operation: "",
         userMessage: "Failed to load configuration",
       }),

[NoCoverage] StringLiteral
extension/src/core/error-handler.ts:208:20
     options: {
       configSave: (config: any) => ({
         component: "options",
-        operation: "configSave",
+        operation: "",
         data: { config },
         userMessage: "Failed to save configuration",

[NoCoverage] ObjectLiteral
extension/src/core/error-handler.ts:209:15
       configSave: (config: any) => ({
         component: "options",
         operation: "configSave",
-        data: { config },
+        data: {},
         userMessage: "Failed to save configuration",
       }),

[NoCoverage] ObjectLiteral
extension/src/core/error-handler.ts:212:27
         data: { config },
         userMessage: "Failed to save configuration",
       }),
-      historyLoad: () => ({
-        component: "options",
-        operation: "historyLoad",
-        userMessage: "Failed to load download history",
-      }),
+      historyLoad: () => ({}),
       themeUpdate: (theme: string) => ({
         component: "options",

[NoCoverage] StringLiteral
extension/src/core/error-handler.ts:213:20
         userMessage: "Failed to save configuration",
       }),
       historyLoad: () => ({
-        component: "options",
+        component: "",
         operation: "historyLoad",
         userMessage: "Failed to load download history",

[NoCoverage] StringLiteral
extension/src/core/error-handler.ts:215:22
       historyLoad: () => ({
         component: "options",
         operation: "historyLoad",
-        userMessage: "Failed to load download history",
+        userMessage: "",
       }),
       themeUpdate: (theme: string) => ({

[NoCoverage] StringLiteral
extension/src/core/error-handler.ts:221:22
         component: "options",
         operation: "themeUpdate",
         data: { theme },
-        userMessage: "Failed to update theme",
+        userMessage: "",
       }),
     },
