[NoCoverage] BlockStatement
extension/src/core/logger.ts:45:7
     if (
       typeof process !== "undefined" &&
       process.env.NODE_ENV === "development"
-    ) {
-      this.onLog((entry) => {
-        const prefix = `[${entry.context.component}]`;
-        const timestamp = entry.timestamp.toISOString();
-        const message = `${prefix} ${entry.message}`;
-
-        switch (entry.level) {
-          case "debug":
-            console.debug(message, entry.data);
-            break;
-          case "info":
-            console.info(message, entry.data);
-            break;
-          case "warn":
-            console.warn(message, entry.data);
-            break;
-          case "error":
-            console.error(message, entry.data);
-            break;
-        }
-      });
-    }
+    ) {}
   }
 

[NoCoverage] BlockStatement
extension/src/core/logger.ts:46:29
       typeof process !== "undefined" &&
       process.env.NODE_ENV === "development"
     ) {
-      this.onLog((entry) => {
-        const prefix = `[${entry.context.component}]`;
-        const timestamp = entry.timestamp.toISOString();
-        const message = `${prefix} ${entry.message}`;
-
-        switch (entry.level) {
-          case "debug":
-            console.debug(message, entry.data);
-            break;
-          case "info":
-            console.info(message, entry.data);
-            break;
-          case "warn":
-            console.warn(message, entry.data);
-            break;
-          case "error":
-            console.error(message, entry.data);
-            break;
-        }
-      });
+      this.onLog((entry) => {});
     }
   }

[NoCoverage] StringLiteral
extension/src/core/logger.ts:47:24
       process.env.NODE_ENV === "development"
     ) {
       this.onLog((entry) => {
-        const prefix = `[${entry.context.component}]`;
+        const prefix = ``;
         const timestamp = entry.timestamp.toISOString();
         const message = `${prefix} ${entry.message}`;

[NoCoverage] ConditionalExpression
extension/src/core/logger.ts:52:11
         const message = `${prefix} ${entry.message}`;
 
         switch (entry.level) {
-          case "debug":
-            console.debug(message, entry.data);
-            break;
+          case "debug":
           case "info":
             console.info(message, entry.data);

[NoCoverage] ConditionalExpression
extension/src/core/logger.ts:55:11
           case "debug":
             console.debug(message, entry.data);
             break;
-          case "info":
-            console.info(message, entry.data);
-            break;
+          case "info":
           case "warn":
             console.warn(message, entry.data);

[NoCoverage] StringLiteral
extension/src/core/logger.ts:55:16
           case "debug":
             console.debug(message, entry.data);
             break;
-          case "info":
+          case "":
             console.info(message, entry.data);
             break;

[NoCoverage] ConditionalExpression
extension/src/core/logger.ts:58:11
           case "info":
             console.info(message, entry.data);
             break;
-          case "warn":
-            console.warn(message, entry.data);
-            break;
+          case "warn":
           case "error":
             console.error(message, entry.data);

[NoCoverage] ConditionalExpression
extension/src/core/logger.ts:61:11
           case "warn":
             console.warn(message, entry.data);
             break;
-          case "error":
-            console.error(message, entry.data);
-            break;
+          case "error":
         }
       });

[Killed] BlockStatement
extension/src/core/logger.ts:69:43
     }
   }
 
-  static getInstance(): CentralizedLogger {
-    if (!CentralizedLogger.instance) {
-      CentralizedLogger.instance = new CentralizedLogger();
-    }
-    return CentralizedLogger.instance;
-  }
+  static getInstance(): CentralizedLogger {}
 
   /**
killedBy: Content Script Tests Button Creation and Management should create download button
statusReason: TypeError: Cannot read properties of undefined (reading 'clearLogs')

[Killed] ConditionalExpression
extension/src/core/logger.ts:70:9
   }
 
   static getInstance(): CentralizedLogger {
-    if (!CentralizedLogger.instance) {
+    if (false) {
       CentralizedLogger.instance = new CentralizedLogger();
     }
killedBy: Content Script Tests Button Creation and Management should create download button
statusReason: TypeError: Cannot read properties of undefined (reading 'clearLogs')

[Killed] ConditionalExpression
extension/src/core/logger.ts:70:9
   }
 
   static getInstance(): CentralizedLogger {
-    if (!CentralizedLogger.instance) {
+    if (true) {
       CentralizedLogger.instance = new CentralizedLogger();
     }
killedBy: Content Script Tests Button State Management should handle storage errors gracefully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
extension/src/core/logger.ts:89:35
   /**
    * Set minimum log level
    */
-  setLevel(level: LogLevel): void {
-    this.level = level;
-  }
+  setLevel(level: LogLevel): void {}
 
   /**
killedBy: Background Script - Core Functions Logging Functions debug should use centralized logger
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] BlockStatement
extension/src/core/logger.ts:96:25
   /**
    * Get all stored logs
    */
-  getLogs(): LogEntry[] {
-    return [...this.logs];
-  }
+  getLogs(): LogEntry[] {}
 
   /**
killedBy: Content Script Tests Button State Management should handle storage errors gracefully
statusReason: TypeError: Cannot read properties of undefined (reading 'some')

[Killed] BlockStatement
extension/src/core/logger.ts:103:21
   /**
    * Clear all stored logs
    */
-  clearLogs(): void {
-    this.logs = [];
-  }
+  clearLogs(): void {}
 
   /**
killedBy: Background Script - Core Functions Logging Functions warn should use centralized logger
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2
Received array:  [{"context": {"component": "test"}, "data": undefined, "level": "info", "message": "test message", "timestamp": 2025-08-07T07:45:02.944Z}, {"context": {"component": "test"}, "data": undefined, "level": "warn", "message": "warning message", "timestamp": 2025-08-07T07:45:02.948Z}]

[NoCoverage] BlockStatement
extension/src/core/logger.ts:110:58
   /**
    * Register log callback
    */
-  onLog(callback: (entry: LogEntry) => void): () => void {
-    this.logCallbacks.add(callback);
-    return () => {
-      this.logCallbacks.delete(callback);
-    };
-  }
+  onLog(callback: (entry: LogEntry) => void): () => void {}
 
   /**

[NoCoverage] BlockStatement
extension/src/core/logger.ts:112:18
    */
   onLog(callback: (entry: LogEntry) => void): () => void {
     this.logCallbacks.add(callback);
-    return () => {
-      this.logCallbacks.delete(callback);
-    };
+    return () => {};
   }
 

[Killed] ConditionalExpression
extension/src/core/logger.ts:128:7
   ): void {
     // Check if we should log this level
     if (
-      CentralizedLogger.LEVELS[level] < CentralizedLogger.LEVELS[this.level]
+      true
     ) {
       return;
killedBy: Content Script Tests Button State Management should handle storage errors gracefully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
extension/src/core/logger.ts:128:7
   ): void {
     // Check if we should log this level
     if (
-      CentralizedLogger.LEVELS[level] < CentralizedLogger.LEVELS[this.level]
+      CentralizedLogger.LEVELS[level] <= CentralizedLogger.LEVELS[this.level]
     ) {
       return;
killedBy: Background Script - Core Functions Logging Functions log should use centralized logger
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[NoCoverage] BlockStatement
extension/src/core/logger.ts:129:7
     // Check if we should log this level
     if (
       CentralizedLogger.LEVELS[level] < CentralizedLogger.LEVELS[this.level]
-    ) {
-      return;
-    }
+    ) {}
 
     const entry: LogEntry = {

[Killed] ObjectLiteral
extension/src/core/logger.ts:133:29
       return;
     }
 
-    const entry: LogEntry = {
-      timestamp: new Date(),
-      level,
-      message,
-      context,
-      data,
-    };
+    const entry: LogEntry = {};
 
     // Add to logs array
killedBy: Content Script Tests Button State Management should handle storage errors gracefully
statusReason: TypeError: Cannot read properties of undefined (reading 'includes')

[Survived] ConditionalExpression
extension/src/core/logger.ts:145:9
     this.logs.push(entry);
 
     // Prevent memory leaks
-    if (this.logs.length > this.maxLogs) {
+    if (true) {
       this.logs = this.logs.slice(-this.maxLogs / 2);
     }

[Survived] EqualityOperator
extension/src/core/logger.ts:145:9
     this.logs.push(entry);
 
     // Prevent memory leaks
-    if (this.logs.length > this.maxLogs) {
+    if (this.logs.length <= this.maxLogs) {
       this.logs = this.logs.slice(-this.maxLogs / 2);
     }

[NoCoverage] ArithmeticOperator
extension/src/core/logger.ts:146:35
 
     // Prevent memory leaks
     if (this.logs.length > this.maxLogs) {
-      this.logs = this.logs.slice(-this.maxLogs / 2);
+      this.logs = this.logs.slice(-this.maxLogs * 2);
     }
 

[NoCoverage] MethodExpression
extension/src/core/logger.ts:146:19
 
     // Prevent memory leaks
     if (this.logs.length > this.maxLogs) {
-      this.logs = this.logs.slice(-this.maxLogs / 2);
+      this.logs = this.logs;
     }
 

[NoCoverage] BlockStatement
extension/src/core/logger.ts:150:45
     }
 
     // Notify callbacks
-    this.logCallbacks.forEach((callback) => {
-      try {
-        callback(entry);
-      } catch (error) {
-        console.error("Error in log callback:", error);
-      }
-    });
+    this.logCallbacks.forEach((callback) => {});
   }
 

[NoCoverage] BlockStatement
extension/src/core/logger.ts:151:11
 
     // Notify callbacks
     this.logCallbacks.forEach((callback) => {
-      try {
-        callback(entry);
-      } catch (error) {
+      try {} catch (error) {
         console.error("Error in log callback:", error);
       }

[NoCoverage] BlockStatement
extension/src/core/logger.ts:153:23
     this.logCallbacks.forEach((callback) => {
       try {
         callback(entry);
-      } catch (error) {
-        console.error("Error in log callback:", error);
-      }
+      } catch (error) {}
     });
   }

[Killed] BlockStatement
extension/src/core/logger.ts:162:66
   /**
    * Debug level logging
    */
-  debug(message: string, context?: LogContext, data?: any): void {
-    this.log("debug", message, context, data);
-  }
+  debug(message: string, context?: LogContext, data?: any): void {}
 
   /**
killedBy: Background Script - Core Functions Logging Functions debug should use centralized logger
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] BlockStatement
extension/src/core/logger.ts:169:65
   /**
    * Info level logging
    */
-  info(message: string, context?: LogContext, data?: any): void {
-    this.log("info", message, context, data);
-  }
+  info(message: string, context?: LogContext, data?: any): void {}
 
   /**
killedBy: Background Script - Core Functions Logging Functions log should use centralized logger
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] StringLiteral
extension/src/core/logger.ts:170:14
    * Info level logging
    */
   info(message: string, context?: LogContext, data?: any): void {
-    this.log("info", message, context, data);
+    this.log("", message, context, data);
   }
 
killedBy: Background Script - Core Functions Logging Functions log should use centralized logger
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "info"
Received: ""

[Killed] BlockStatement
extension/src/core/logger.ts:176:65
   /**
    * Warn level logging
    */
-  warn(message: string, context?: LogContext, data?: any): void {
-    this.log("warn", message, context, data);
-  }
+  warn(message: string, context?: LogContext, data?: any): void {}
 
   /**
killedBy: Background Script - Core Functions Logging Functions warn should use centralized logger
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] BlockStatement
extension/src/core/logger.ts:183:66
   /**
    * Error level logging
    */
-  error(message: string, context?: LogContext, data?: any): void {
-    this.log("error", message, context, data);
-  }
+  error(message: string, context?: LogContext, data?: any): void {}
 
   /**
killedBy: Content Script Tests Button State Management should handle storage errors gracefully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ObjectLiteral
extension/src/core/logger.ts:192:39
    */
   static contexts = {
     background: {
-      serverCheck: (port: number) => ({
-        component: "background",
-        operation: "serverCheck",
-        data: { port },
-      }),
+      serverCheck: (port: number) => ({}),
       portDiscovery: () => ({
         component: "background",

[Survived] StringLiteral
extension/src/core/logger.ts:193:20
   static contexts = {
     background: {
       serverCheck: (port: number) => ({
-        component: "background",
+        component: "",
         operation: "serverCheck",
         data: { port },

[NoCoverage] ObjectLiteral
extension/src/core/logger.ts:197:29
         operation: "serverCheck",
         data: { port },
       }),
-      portDiscovery: () => ({
-        component: "background",
-        operation: "portDiscovery",
-      }),
+      portDiscovery: () => ({}),
       downloadRequest: (url: string) => ({
         component: "background",

[NoCoverage] StringLiteral
extension/src/core/logger.ts:199:20
       }),
       portDiscovery: () => ({
         component: "background",
-        operation: "portDiscovery",
+        operation: "",
       }),
       downloadRequest: (url: string) => ({

[NoCoverage] StringLiteral
extension/src/core/logger.ts:202:20
         operation: "portDiscovery",
       }),
       downloadRequest: (url: string) => ({
-        component: "background",
+        component: "",
         operation: "downloadRequest",
         data: { url },

[NoCoverage] ObjectLiteral
extension/src/core/logger.ts:204:15
       downloadRequest: (url: string) => ({
         component: "background",
         operation: "downloadRequest",
-        data: { url },
+        data: {},
       }),
       configUpdate: (config: any) => ({

[NoCoverage] StringLiteral
extension/src/core/logger.ts:213:20
       }),
       initialization: () => ({
         component: "background",
-        operation: "initialization",
+        operation: "",
       }),
     },

[NoCoverage] ObjectLiteral
extension/src/core/logger.ts:217:57
       }),
     },
     content: {
-      buttonInjection: (videoElement?: HTMLElement) => ({
-        component: "content",
-        operation: "buttonInjection",
-        data: { videoElement: videoElement?.tagName },
-      }),
+      buttonInjection: (videoElement?: HTMLElement) => ({}),
       videoDetection: () => ({
         component: "content",

[NoCoverage] ObjectLiteral
extension/src/core/logger.ts:226:29
         component: "content",
         operation: "videoDetection",
       }),
-      dragOperation: () => ({
-        component: "content",
-        operation: "dragOperation",
-      }),
+      dragOperation: () => ({}),
       pageLoad: () => ({
         component: "content",

[NoCoverage] StringLiteral
extension/src/core/logger.ts:237:20
     },
     popup: {
       statusCheck: () => ({
-        component: "popup",
+        component: "",
         operation: "statusCheck",
       }),

[NoCoverage] StringLiteral
extension/src/core/logger.ts:238:20
     popup: {
       statusCheck: () => ({
         component: "popup",
-        operation: "statusCheck",
+        operation: "",
       }),
       configLoad: () => ({

[NoCoverage] ObjectLiteral
extension/src/core/logger.ts:240:26
         component: "popup",
         operation: "statusCheck",
       }),
-      configLoad: () => ({
-        component: "popup",
-        operation: "configLoad",
-      }),
+      configLoad: () => ({}),
       downloadInitiation: (url: string) => ({
         component: "popup",

[NoCoverage] ObjectLiteral
extension/src/core/logger.ts:244:45
         component: "popup",
         operation: "configLoad",
       }),
-      downloadInitiation: (url: string) => ({
-        component: "popup",
-        operation: "downloadInitiation",
-        data: { url },
-      }),
+      downloadInitiation: (url: string) => ({}),
       uiUpdate: () => ({
         component: "popup",

[NoCoverage] StringLiteral
extension/src/core/logger.ts:246:20
       }),
       downloadInitiation: (url: string) => ({
         component: "popup",
-        operation: "downloadInitiation",
+        operation: "",
         data: { url },
       }),

[NoCoverage] ObjectLiteral
extension/src/core/logger.ts:260:27
         operation: "configSave",
         data: { config },
       }),
-      historyLoad: () => ({
-        component: "options",
-        operation: "historyLoad",
-      }),
+      historyLoad: () => ({}),
       themeUpdate: (theme: string) => ({
         component: "options",

[NoCoverage] StringLiteral
extension/src/core/logger.ts:262:20
       }),
       historyLoad: () => ({
         component: "options",
-        operation: "historyLoad",
+        operation: "",
       }),
       themeUpdate: (theme: string) => ({

[NoCoverage] ObjectLiteral
extension/src/core/logger.ts:264:40
         component: "options",
         operation: "historyLoad",
       }),
-      themeUpdate: (theme: string) => ({
-        component: "options",
-        operation: "themeUpdate",
-        data: { theme },
-      }),
+      themeUpdate: (theme: string) => ({}),
       pageLoad: () => ({
         component: "options",

[NoCoverage] StringLiteral
extension/src/core/logger.ts:266:20
       }),
       themeUpdate: (theme: string) => ({
         component: "options",
-        operation: "themeUpdate",
+        operation: "",
         data: { theme },
       }),

[NoCoverage] ObjectLiteral
extension/src/core/logger.ts:269:24
         operation: "themeUpdate",
         data: { theme },
       }),
-      pageLoad: () => ({
-        component: "options",
-        operation: "pageLoad",
-      }),
+      pageLoad: () => ({}),
     },
   };

[NoCoverage] BlockStatement
extension/src/core/logger.ts:283:77
     /**
      * Log function entry
      */
-    functionEntry: (functionName: string, component: string, data?: any) => {
-      const logger = CentralizedLogger.getInstance();
-      logger.debug(
-        `Entering ${functionName}`,
-        { component, operation: functionName },
-        data
-      );
-    },
+    functionEntry: (functionName: string, component: string, data?: any) => {},
 
     /**

[NoCoverage] StringLiteral
extension/src/core/logger.ts:286:9
     functionEntry: (functionName: string, component: string, data?: any) => {
       const logger = CentralizedLogger.getInstance();
       logger.debug(
-        `Entering ${functionName}`,
+        ``,
         { component, operation: functionName },
         data

[NoCoverage] BlockStatement
extension/src/core/logger.ts:295:76
     /**
      * Log function exit
      */
-    functionExit: (functionName: string, component: string, data?: any) => {
-      const logger = CentralizedLogger.getInstance();
-      logger.debug(
-        `Exiting ${functionName}`,
-        { component, operation: functionName },
-        data
-      );
-    },
+    functionExit: (functionName: string, component: string, data?: any) => {},
 
     /**

[NoCoverage] BlockStatement
extension/src/core/logger.ts:307:75
     /**
      * Log async operation start
      */
-    asyncStart: (operationName: string, component: string, data?: any) => {
-      const logger = CentralizedLogger.getInstance();
-      logger.info(
-        `Starting ${operationName}`,
-        { component, operation: operationName },
-        data
-      );
-    },
+    asyncStart: (operationName: string, component: string, data?: any) => {},
 
     /**

[NoCoverage] StringLiteral
extension/src/core/logger.ts:310:9
     asyncStart: (operationName: string, component: string, data?: any) => {
       const logger = CentralizedLogger.getInstance();
       logger.info(
-        `Starting ${operationName}`,
+        ``,
         { component, operation: operationName },
         data

[NoCoverage] BlockStatement
extension/src/core/logger.ts:319:78
     /**
      * Log async operation completion
      */
-    asyncComplete: (operationName: string, component: string, data?: any) => {
-      const logger = CentralizedLogger.getInstance();
-      logger.info(
-        `Completed ${operationName}`,
-        { component, operation: operationName },
-        data
-      );
-    },
+    asyncComplete: (operationName: string, component: string, data?: any) => {},
 
     /**

[NoCoverage] BlockStatement
extension/src/core/logger.ts:336:10
       component: string,
       error: Error,
       data?: any
-    ) => {
-      const logger = CentralizedLogger.getInstance();
-      logger.error(
-        `Failed ${operationName}: ${error.message}`,
-        { component, operation: operationName },
-        { error, ...data }
-      );
-    },
+    ) => {},
   };
 }

[NoCoverage] StringLiteral
extension/src/core/logger.ts:339:9
     ) => {
       const logger = CentralizedLogger.getInstance();
       logger.error(
-        `Failed ${operationName}: ${error.message}`,
+        ``,
         { component, operation: operationName },
         { error, ...data }
