[Killed] BlockStatement
extension/src/core/state-manager.ts:114:47
   /**
    * Get the singleton instance of the state manager
    */
-  static getInstance(): ExtensionStateManager {
-    if (!ExtensionStateManager.instance) {
-      ExtensionStateManager.instance = new ExtensionStateManager();
-    }
-    return ExtensionStateManager.instance;
-  }
+  static getInstance(): ExtensionStateManager {}
 
   /**
killedBy: Background Script - Core Functions Logging Functions log should use centralized logger
statusReason: TypeError: Cannot read properties of undefined (reading 'reset')

[Killed] ConditionalExpression
extension/src/core/state-manager.ts:115:9
    * Get the singleton instance of the state manager
    */
   static getInstance(): ExtensionStateManager {
-    if (!ExtensionStateManager.instance) {
+    if (false) {
       ExtensionStateManager.instance = new ExtensionStateManager();
     }
killedBy: Options Script Unit Tests Validation Functions should validate port correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'reset')

[Killed] BooleanLiteral
extension/src/core/state-manager.ts:115:9
    * Get the singleton instance of the state manager
    */
   static getInstance(): ExtensionStateManager {
-    if (!ExtensionStateManager.instance) {
+    if (ExtensionStateManager.instance) {
       ExtensionStateManager.instance = new ExtensionStateManager();
     }
killedBy: Background Script - Core Functions Logging Functions log should use centralized logger
statusReason: TypeError: Cannot read properties of undefined (reading 'reset')

[Killed] BlockStatement
extension/src/core/state-manager.ts:124:30
   /**
    * Get the current state
    */
-  getState(): ExtensionState {
-    return { ...this.state };
-  }
+  getState(): ExtensionState {}
 
   /**
killedBy: Background Script - Core Functions State Management should use centralized state manager
statusReason: TypeError: Cannot read properties of undefined (reading 'server')

[Killed] BlockStatement
extension/src/core/state-manager.ts:131:33
   /**
    * Get a specific part of the state
    */
-  getServerState(): ServerState {
-    return { ...this.state.server };
-  }
+  getServerState(): ServerState {}
 
   getUIState(): UIState {
killedBy: Background Script - Core Functions Server Status Functions checkServerStatus should return true for successful response
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[NoCoverage] BlockStatement
extension/src/core/state-manager.ts:139:37
     return { ...this.state.ui };
   }
 
-  getDownloadState(): DownloadState {
-    return { ...this.state.downloads };
-  }
+  getDownloadState(): DownloadState {}
 
   getFormState(): FormState {

[NoCoverage] ObjectLiteral
extension/src/core/state-manager.ts:140:12
   }
 
   getDownloadState(): DownloadState {
-    return { ...this.state.downloads };
+    return {};
   }
 

[NoCoverage] BlockStatement
extension/src/core/state-manager.ts:143:29
     return { ...this.state.downloads };
   }
 
-  getFormState(): FormState {
-    return { ...this.state.form };
-  }
+  getFormState(): FormState {}
 
   /**

[Killed] BlockStatement
extension/src/core/state-manager.ts:150:58
   /**
    * Update server state
    */
-  updateServerState(updates: Partial<ServerState>): void {
-    this.state.server = { ...this.state.server, ...updates };
-    this.notifyListeners("serverStatusChanged", this.state.server);
-  }
+  updateServerState(updates: Partial<ServerState>): void {}
 
   /**
killedBy: Background Script - Core Functions State Management should use centralized state manager
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "connected"
Received: "disconnected"

[Killed] ObjectLiteral
extension/src/core/state-manager.ts:151:25
    * Update server state
    */
   updateServerState(updates: Partial<ServerState>): void {
-    this.state.server = { ...this.state.server, ...updates };
+    this.state.server = {};
     this.notifyListeners("serverStatusChanged", this.state.server);
   }
killedBy: Background Script - Core Functions State Management should use centralized state manager
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "disconnected"
Received: undefined

[Killed] BlockStatement
extension/src/core/state-manager.ts:158:50
   /**
    * Update UI state
    */
-  updateUIState(updates: Partial<UIState>): void {
-    this.state.ui = { ...this.state.ui, ...updates };
-
-    if (updates.theme !== undefined) {
-      this.notifyListeners("uiThemeChanged", this.state.ui.theme);
-    }
-    if (updates.buttonPosition !== undefined) {
-      this.notifyListeners(
-        "buttonPositionChanged",
-        this.state.ui.buttonPosition
-      );
-    }
-  }
+  updateUIState(updates: Partial<UIState>): void {}
 
   /**
killedBy: Background Script - Core Functions State Management should handle UI state updates
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "dark"
Received: "light"

[Killed] ObjectLiteral
extension/src/core/state-manager.ts:159:21
    * Update UI state
    */
   updateUIState(updates: Partial<UIState>): void {
-    this.state.ui = { ...this.state.ui, ...updates };
+    this.state.ui = {};
 
     if (updates.theme !== undefined) {
killedBy: Background Script - Core Functions State Management should handle UI state updates
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "dark"
Received: undefined

[Survived] BlockStatement
extension/src/core/state-manager.ts:161:38
   updateUIState(updates: Partial<UIState>): void {
     this.state.ui = { ...this.state.ui, ...updates };
 
-    if (updates.theme !== undefined) {
-      this.notifyListeners("uiThemeChanged", this.state.ui.theme);
-    }
+    if (updates.theme !== undefined) {}
     if (updates.buttonPosition !== undefined) {
       this.notifyListeners(

[Survived] EqualityOperator
extension/src/core/state-manager.ts:161:9
   updateUIState(updates: Partial<UIState>): void {
     this.state.ui = { ...this.state.ui, ...updates };
 
-    if (updates.theme !== undefined) {
+    if (updates.theme === undefined) {
       this.notifyListeners("uiThemeChanged", this.state.ui.theme);
     }

[Survived] ConditionalExpression
extension/src/core/state-manager.ts:164:9
     if (updates.theme !== undefined) {
       this.notifyListeners("uiThemeChanged", this.state.ui.theme);
     }
-    if (updates.buttonPosition !== undefined) {
+    if (true) {
       this.notifyListeners(
         "buttonPositionChanged",

[Survived] EqualityOperator
extension/src/core/state-manager.ts:164:9
     if (updates.theme !== undefined) {
       this.notifyListeners("uiThemeChanged", this.state.ui.theme);
     }
-    if (updates.buttonPosition !== undefined) {
+    if (updates.buttonPosition === undefined) {
       this.notifyListeners(
         "buttonPositionChanged",

[Killed] BlockStatement
extension/src/core/state-manager.ts:175:62
   /**
    * Update download state
    */
-  updateDownloadState(updates: Partial<DownloadState>): void {
-    this.state.downloads = { ...this.state.downloads, ...updates };
-
-    if (updates.queue !== undefined) {
-      this.notifyListeners("downloadQueueChanged", this.state.downloads.queue);
-    }
-    if (updates.active !== undefined) {
-      this.notifyListeners(
-        "downloadActiveChanged",
-        this.state.downloads.active
-      );
-    }
-  }
+  updateDownloadState(updates: Partial<DownloadState>): void {}
 
   /**
killedBy: Background Script - Core Functions State Management should handle download state updates
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []

[Killed] ObjectLiteral
extension/src/core/state-manager.ts:176:28
    * Update download state
    */
   updateDownloadState(updates: Partial<DownloadState>): void {
-    this.state.downloads = { ...this.state.downloads, ...updates };
+    this.state.downloads = {};
 
     if (updates.queue !== undefined) {
killedBy: Background Script - Core Functions State Management should handle download state updates
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Survived] EqualityOperator
extension/src/core/state-manager.ts:178:9
   updateDownloadState(updates: Partial<DownloadState>): void {
     this.state.downloads = { ...this.state.downloads, ...updates };
 
-    if (updates.queue !== undefined) {
+    if (updates.queue === undefined) {
       this.notifyListeners("downloadQueueChanged", this.state.downloads.queue);
     }

[Survived] ConditionalExpression
extension/src/core/state-manager.ts:178:9
   updateDownloadState(updates: Partial<DownloadState>): void {
     this.state.downloads = { ...this.state.downloads, ...updates };
 
-    if (updates.queue !== undefined) {
+    if (false) {
       this.notifyListeners("downloadQueueChanged", this.state.downloads.queue);
     }

[Survived] StringLiteral
extension/src/core/state-manager.ts:179:28
     this.state.downloads = { ...this.state.downloads, ...updates };
 
     if (updates.queue !== undefined) {
-      this.notifyListeners("downloadQueueChanged", this.state.downloads.queue);
+      this.notifyListeners("", this.state.downloads.queue);
     }
     if (updates.active !== undefined) {

[Survived] ConditionalExpression
extension/src/core/state-manager.ts:181:9
     if (updates.queue !== undefined) {
       this.notifyListeners("downloadQueueChanged", this.state.downloads.queue);
     }
-    if (updates.active !== undefined) {
+    if (true) {
       this.notifyListeners(
         "downloadActiveChanged",

[Survived] EqualityOperator
extension/src/core/state-manager.ts:181:9
     if (updates.queue !== undefined) {
       this.notifyListeners("downloadQueueChanged", this.state.downloads.queue);
     }
-    if (updates.active !== undefined) {
+    if (updates.active === undefined) {
       this.notifyListeners(
         "downloadActiveChanged",

[Survived] StringLiteral
extension/src/core/state-manager.ts:183:9
     }
     if (updates.active !== undefined) {
       this.notifyListeners(
-        "downloadActiveChanged",
+        "",
         this.state.downloads.active
       );

[NoCoverage] BlockStatement
extension/src/core/state-manager.ts:192:54
   /**
    * Update form state
    */
-  updateFormState(updates: Partial<FormState>): void {
-    this.state.form = { ...this.state.form, ...updates };
-    this.notifyListeners("formValidationChanged", this.state.form);
-  }
+  updateFormState(updates: Partial<FormState>): void {}
 
   /**

[NoCoverage] BlockStatement
extension/src/core/state-manager.ts:203:17
   subscribe(
     event: StateChangeEvent,
     callback: (data: any) => void
-  ): () => void {
-    if (!this.listeners.has(event)) {
-      this.listeners.set(event, new Set());
-    }
-
-    this.listeners.get(event)!.add(callback);
-
-    // Return unsubscribe function
-    return () => {
-      this.listeners.get(event)?.delete(callback);
-    };
-  }
+  ): () => void {}
 
   /**

[NoCoverage] ConditionalExpression
extension/src/core/state-manager.ts:204:9
     event: StateChangeEvent,
     callback: (data: any) => void
   ): () => void {
-    if (!this.listeners.has(event)) {
+    if (true) {
       this.listeners.set(event, new Set());
     }

[NoCoverage] ConditionalExpression
extension/src/core/state-manager.ts:204:9
     event: StateChangeEvent,
     callback: (data: any) => void
   ): () => void {
-    if (!this.listeners.has(event)) {
+    if (false) {
       this.listeners.set(event, new Set());
     }

[NoCoverage] BlockStatement
extension/src/core/state-manager.ts:211:18
     this.listeners.get(event)!.add(callback);
 
     // Return unsubscribe function
-    return () => {
-      this.listeners.get(event)?.delete(callback);
-    };
+    return () => {};
   }
 

[NoCoverage] OptionalChaining
extension/src/core/state-manager.ts:212:7
 
     // Return unsubscribe function
     return () => {
-      this.listeners.get(event)?.delete(callback);
+      this.listeners.get(event).delete(callback);
     };
   }

[Survived] BlockStatement
extension/src/core/state-manager.ts:219:69
   /**
    * Notify listeners of state changes
    */
-  private notifyListeners(event: StateChangeEvent, data: any): void {
-    const eventListeners = this.listeners.get(event);
-    if (eventListeners) {
-      eventListeners.forEach((callback) => {
-        try {
-          callback(data);
-        } catch (error) {
-          console.error(`Error in state change listener for ${event}:`, error);
-        }
-      });
-    }
-  }
+  private notifyListeners(event: StateChangeEvent, data: any): void {}
 
   /**

[Killed] ConditionalExpression
extension/src/core/state-manager.ts:221:9
    */
   private notifyListeners(event: StateChangeEvent, data: any): void {
     const eventListeners = this.listeners.get(event);
-    if (eventListeners) {
+    if (true) {
       eventListeners.forEach((callback) => {
         try {
killedBy: checkServerStatus - Simple Test should return true for successful response
statusReason: TypeError: Cannot read properties of undefined (reading 'forEach')

[NoCoverage] BlockStatement
extension/src/core/state-manager.ts:221:25
    */
   private notifyListeners(event: StateChangeEvent, data: any): void {
     const eventListeners = this.listeners.get(event);
-    if (eventListeners) {
-      eventListeners.forEach((callback) => {
-        try {
-          callback(data);
-        } catch (error) {
-          console.error(`Error in state change listener for ${event}:`, error);
-        }
-      });
-    }
+    if (eventListeners) {}
   }
 

[NoCoverage] BlockStatement
extension/src/core/state-manager.ts:222:44
   private notifyListeners(event: StateChangeEvent, data: any): void {
     const eventListeners = this.listeners.get(event);
     if (eventListeners) {
-      eventListeners.forEach((callback) => {
-        try {
-          callback(data);
-        } catch (error) {
-          console.error(`Error in state change listener for ${event}:`, error);
-        }
-      });
+      eventListeners.forEach((callback) => {});
     }
   }

[NoCoverage] BlockStatement
extension/src/core/state-manager.ts:223:13
     const eventListeners = this.listeners.get(event);
     if (eventListeners) {
       eventListeners.forEach((callback) => {
-        try {
-          callback(data);
-        } catch (error) {
+        try {} catch (error) {
           console.error(`Error in state change listener for ${event}:`, error);
         }

[NoCoverage] BlockStatement
extension/src/core/state-manager.ts:225:25
       eventListeners.forEach((callback) => {
         try {
           callback(data);
-        } catch (error) {
-          console.error(`Error in state change listener for ${event}:`, error);
-        }
+        } catch (error) {}
       });
     }

[NoCoverage] StringLiteral
extension/src/core/state-manager.ts:226:25
         try {
           callback(data);
         } catch (error) {
-          console.error(`Error in state change listener for ${event}:`, error);
+          console.error(``, error);
         }
       });

[NoCoverage] StringLiteral
extension/src/core/state-manager.ts:238:9
   async loadFromStorage(): Promise<void> {
     try {
       const result = await chrome.storage.local.get([
-        "serverPort",
+        "",
         "serverConfig",
         "downloadHistory",

[NoCoverage] StringLiteral
extension/src/core/state-manager.ts:239:9
     try {
       const result = await chrome.storage.local.get([
         "serverPort",
-        "serverConfig",
+        "",
         "downloadHistory",
         "theme",

[NoCoverage] BlockStatement
extension/src/core/state-manager.ts:246:30
       ]);
 
       // Load server state
-      if (result.serverPort) {
-        this.updateServerState({ port: result.serverPort });
-      }
+      if (result.serverPort) {}
 
       if (result.serverConfig) {

[NoCoverage] ConditionalExpression
extension/src/core/state-manager.ts:246:11
       ]);
 
       // Load server state
-      if (result.serverPort) {
+      if (false) {
         this.updateServerState({ port: result.serverPort });
       }

[NoCoverage] ConditionalExpression
extension/src/core/state-manager.ts:250:11
         this.updateServerState({ port: result.serverPort });
       }
 
-      if (result.serverConfig) {
+      if (false) {
         this.updateServerState({ config: result.serverConfig });
       }

[NoCoverage] BlockStatement
extension/src/core/state-manager.ts:250:32
         this.updateServerState({ port: result.serverPort });
       }
 
-      if (result.serverConfig) {
-        this.updateServerState({ config: result.serverConfig });
-      }
+      if (result.serverConfig) {}
 
       // Load UI state

[NoCoverage] ConditionalExpression
extension/src/core/state-manager.ts:255:11
       }
 
       // Load UI state
-      if (result.theme) {
+      if (true) {
         this.updateUIState({ theme: result.theme });
       }

[NoCoverage] BlockStatement
extension/src/core/state-manager.ts:255:25
       }
 
       // Load UI state
-      if (result.theme) {
-        this.updateUIState({ theme: result.theme });
-      }
+      if (result.theme) {}
 
       if (result.buttonState) {

[NoCoverage] ConditionalExpression
extension/src/core/state-manager.ts:259:11
         this.updateUIState({ theme: result.theme });
       }
 
-      if (result.buttonState) {
+      if (true) {
         this.updateUIState({
           buttonPosition: result.buttonState.position || { x: 10, y: 10 },

[NoCoverage] ConditionalExpression
extension/src/core/state-manager.ts:259:11
         this.updateUIState({ theme: result.theme });
       }
 
-      if (result.buttonState) {
+      if (false) {
         this.updateUIState({
           buttonPosition: result.buttonState.position || { x: 10, y: 10 },

[NoCoverage] ObjectLiteral
extension/src/core/state-manager.ts:260:28
       }
 
       if (result.buttonState) {
-        this.updateUIState({
-          buttonPosition: result.buttonState.position || { x: 10, y: 10 },
-          buttonVisible: result.buttonState.visible !== false,
-        });
+        this.updateUIState({});
       }
 

[NoCoverage] ConditionalExpression
extension/src/core/state-manager.ts:261:27
 
       if (result.buttonState) {
         this.updateUIState({
-          buttonPosition: result.buttonState.position || { x: 10, y: 10 },
+          buttonPosition: true,
           buttonVisible: result.buttonState.visible !== false,
         });

[NoCoverage] ConditionalExpression
extension/src/core/state-manager.ts:261:27
 
       if (result.buttonState) {
         this.updateUIState({
-          buttonPosition: result.buttonState.position || { x: 10, y: 10 },
+          buttonPosition: false,
           buttonVisible: result.buttonState.visible !== false,
         });

[NoCoverage] BooleanLiteral
extension/src/core/state-manager.ts:262:57
       if (result.buttonState) {
         this.updateUIState({
           buttonPosition: result.buttonState.position || { x: 10, y: 10 },
-          buttonVisible: result.buttonState.visible !== false,
+          buttonVisible: result.buttonState.visible !== true,
         });
       }

[NoCoverage] ConditionalExpression
extension/src/core/state-manager.ts:262:26
       if (result.buttonState) {
         this.updateUIState({
           buttonPosition: result.buttonState.position || { x: 10, y: 10 },
-          buttonVisible: result.buttonState.visible !== false,
+          buttonVisible: true,
         });
       }

[NoCoverage] ConditionalExpression
extension/src/core/state-manager.ts:267:11
       }
 
       // Load download state
-      if (result.downloadHistory) {
+      if (true) {
         this.updateDownloadState({ history: result.downloadHistory });
       }

[NoCoverage] ConditionalExpression
extension/src/core/state-manager.ts:267:11
       }
 
       // Load download state
-      if (result.downloadHistory) {
+      if (false) {
         this.updateDownloadState({ history: result.downloadHistory });
       }

[NoCoverage] BlockStatement
extension/src/core/state-manager.ts:270:21
       if (result.downloadHistory) {
         this.updateDownloadState({ history: result.downloadHistory });
       }
-    } catch (error) {
-      console.error("Error loading state from storage:", error);
-    }
+    } catch (error) {}
   }
 

[NoCoverage] BlockStatement
extension/src/core/state-manager.ts:278:40
   /**
    * Save state to storage
    */
-  async saveToStorage(): Promise<void> {
-    try {
-      await chrome.storage.local.set({
-        serverPort: this.state.server.port,
-        serverConfig: this.state.server.config,
-        theme: this.state.ui.theme,
-        buttonState: {
-          position: this.state.ui.buttonPosition,
-          visible: this.state.ui.buttonVisible,
-        },
-        downloadHistory: this.state.downloads.history,
-      });
-    } catch (error) {
-      console.error("Error saving state to storage:", error);
-    }
-  }
+  async saveToStorage(): Promise<void> {}
 
   /**

[NoCoverage] BlockStatement
extension/src/core/state-manager.ts:279:9
    * Save state to storage
    */
   async saveToStorage(): Promise<void> {
-    try {
-      await chrome.storage.local.set({
-        serverPort: this.state.server.port,
-        serverConfig: this.state.server.config,
-        theme: this.state.ui.theme,
-        buttonState: {
-          position: this.state.ui.buttonPosition,
-          visible: this.state.ui.buttonVisible,
-        },
-        downloadHistory: this.state.downloads.history,
-      });
-    } catch (error) {
+    try {} catch (error) {
       console.error("Error saving state to storage:", error);
     }

[NoCoverage] ObjectLiteral
extension/src/core/state-manager.ts:284:22
         serverPort: this.state.server.port,
         serverConfig: this.state.server.config,
         theme: this.state.ui.theme,
-        buttonState: {
-          position: this.state.ui.buttonPosition,
-          visible: this.state.ui.buttonVisible,
-        },
+        buttonState: {},
         downloadHistory: this.state.downloads.history,
       });

[NoCoverage] BlockStatement
extension/src/core/state-manager.ts:290:21
         },
         downloadHistory: this.state.downloads.history,
       });
-    } catch (error) {
-      console.error("Error saving state to storage:", error);
-    }
+    } catch (error) {}
   }
 

[Survived] StringLiteral
extension/src/core/state-manager.ts:302:17
     this.state = {
       server: {
         port: null,
-        status: "disconnected",
+        status: "",
         scanInProgress: false,
         backoffInterval: 1000,

[Killed] ObjectLiteral
extension/src/core/state-manager.ts:307:11
         backoffInterval: 1000,
         config: {},
       },
-      ui: {
-        buttonPosition: { x: 10, y: 10 },
-        buttonVisible: true,
-        isDragging: false,
-        theme: "light",
-        dragSrcIndex: null,
-        statusTimeout: null,
-        lastClickTime: 0,
-        checksDone: 0,
-      },
+      ui: {},
       downloads: {
         queue: [],
killedBy: Background Script - Core Functions State Management should use centralized state manager
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "light"
Received: undefined

[Survived] ObjectLiteral
extension/src/core/state-manager.ts:308:25
         config: {},
       },
       ui: {
-        buttonPosition: { x: 10, y: 10 },
+        buttonPosition: {},
         buttonVisible: true,
         isDragging: false,

[Survived] BooleanLiteral
extension/src/core/state-manager.ts:309:24
       },
       ui: {
         buttonPosition: { x: 10, y: 10 },
-        buttonVisible: true,
+        buttonVisible: false,
         isDragging: false,
         theme: "light",

[Survived] BooleanLiteral
extension/src/core/state-manager.ts:310:21
       ui: {
         buttonPosition: { x: 10, y: 10 },
         buttonVisible: true,
-        isDragging: false,
+        isDragging: true,
         theme: "light",
         dragSrcIndex: null,

[Survived] ObjectLiteral
extension/src/core/state-manager.ts:317:18
         lastClickTime: 0,
         checksDone: 0,
       },
-      downloads: {
-        queue: [],
-        active: {},
-        history: [],
-      },
+      downloads: {},
       form: {
         errors: new Map(),
