[Killed] BlockStatement
extension/src/core/validation-service.ts:42:43
   /**
    * Get the singleton instance of the validation service
    */
-  static getInstance(): ValidationService {
-    if (!ValidationService.instance) {
-      ValidationService.instance = new ValidationService();
-    }
-    return ValidationService.instance;
-  }
+  static getInstance(): ValidationService {}
 
   /**
killedBy: Validation Service Tests Port Validation should validate valid ports
statusReason: TypeError: Cannot read properties of undefined (reading 'validate')

[Killed] BooleanLiteral
extension/src/core/validation-service.ts:43:9
    * Get the singleton instance of the validation service
    */
   static getInstance(): ValidationService {
-    if (!ValidationService.instance) {
+    if (ValidationService.instance) {
       ValidationService.instance = new ValidationService();
     }
killedBy: Validation Service Tests Port Validation should validate valid ports
statusReason: TypeError: Cannot read properties of undefined (reading 'validate')

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:43:9
    * Get the singleton instance of the validation service
    */
   static getInstance(): ValidationService {
-    if (!ValidationService.instance) {
+    if (false) {
       ValidationService.instance = new ValidationService();
     }
killedBy: Validation Service Tests Port Validation should validate valid ports
statusReason: TypeError: Cannot read properties of undefined (reading 'validate')

[Killed] BlockStatement
extension/src/core/validation-service.ts:55:51
   private registerDefaultValidators(): void {
     // Port validation
     this.validators.set("port", {
-      validate: (value: any): ValidationResult => {
-        const port = parseInt(value, 10);
-
-        if (value === "" || value === null || value === undefined) {
-          return { valid: false, error: "Port is required" };
-        }
-
-        if (isNaN(port)) {
-          return { valid: false, error: "Port must be a valid number" };
-        }
-
-        if (port < 1 || port > 65535) {
-          return { valid: false, error: "Port must be between 1 and 65535" };
-        }
-
-        return { valid: true };
-      },
+      validate: (value: any): ValidationResult => {},
     });
 
killedBy: Validation Service Tests Port Validation should validate valid ports
statusReason: TypeError: Cannot read properties of undefined (reading 'valid')

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:58:47
       validate: (value: any): ValidationResult => {
         const port = parseInt(value, 10);
 
-        if (value === "" || value === null || value === undefined) {
+        if (value === "" || value === null || false) {
           return { valid: false, error: "Port is required" };
         }
killedBy: Validation Service Tests Edge Cases should handle null and undefined values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Port is required"
Received: "Port must be a valid number"

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:58:13
       validate: (value: any): ValidationResult => {
         const port = parseInt(value, 10);
 
-        if (value === "" || value === null || value === undefined) {
+        if (true) {
           return { valid: false, error: "Port is required" };
         }
killedBy: Validation Service Tests Port Validation should validate valid ports
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
extension/src/core/validation-service.ts:59:27
         const port = parseInt(value, 10);
 
         if (value === "" || value === null || value === undefined) {
-          return { valid: false, error: "Port is required" };
+          return { valid: true, error: "Port is required" };
         }
 
killedBy: Validation Service Tests Port Validation should handle empty port values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
extension/src/core/validation-service.ts:62:26
           return { valid: false, error: "Port is required" };
         }
 
-        if (isNaN(port)) {
-          return { valid: false, error: "Port must be a valid number" };
-        }
+        if (isNaN(port)) {}
 
         if (port < 1 || port > 65535) {
killedBy: Validation Service Tests Port Validation should reject invalid ports
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:62:13
           return { valid: false, error: "Port is required" };
         }
 
-        if (isNaN(port)) {
+        if (true) {
           return { valid: false, error: "Port must be a valid number" };
         }
killedBy: Validation Service Tests Port Validation should validate valid ports
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
extension/src/core/validation-service.ts:63:27
         }
 
         if (isNaN(port)) {
-          return { valid: false, error: "Port must be a valid number" };
+          return { valid: true, error: "Port must be a valid number" };
         }
 
killedBy: Validation Service Tests Port Validation should reject invalid ports
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ObjectLiteral
extension/src/core/validation-service.ts:63:18
         }
 
         if (isNaN(port)) {
-          return { valid: false, error: "Port must be a valid number" };
+          return {};
         }
 
killedBy: Validation Service Tests Port Validation should reject invalid ports
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] EqualityOperator
extension/src/core/validation-service.ts:66:25
           return { valid: false, error: "Port must be a valid number" };
         }
 
-        if (port < 1 || port > 65535) {
+        if (port < 1 || port <= 65535) {
           return { valid: false, error: "Port must be between 1 and 65535" };
         }
killedBy: Validation Service Tests Port Validation should validate valid ports
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
extension/src/core/validation-service.ts:66:13
           return { valid: false, error: "Port must be a valid number" };
         }
 
-        if (port < 1 || port > 65535) {
+        if (port < 1 && port > 65535) {
           return { valid: false, error: "Port must be between 1 and 65535" };
         }
killedBy: Validation Service Tests Port Validation should reject invalid ports
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
extension/src/core/validation-service.ts:67:27
         }
 
         if (port < 1 || port > 65535) {
-          return { valid: false, error: "Port must be between 1 and 65535" };
+          return { valid: true, error: "Port must be between 1 and 65535" };
         }
 
killedBy: Validation Service Tests Port Validation should reject invalid ports
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ObjectLiteral
extension/src/core/validation-service.ts:67:18
         }
 
         if (port < 1 || port > 65535) {
-          return { valid: false, error: "Port must be between 1 and 65535" };
+          return {};
         }
 
killedBy: Validation Service Tests Port Validation should reject invalid ports
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] BooleanLiteral
extension/src/core/validation-service.ts:70:25
           return { valid: false, error: "Port must be between 1 and 65535" };
         }
 
-        return { valid: true };
+        return { valid: false };
       },
     });
killedBy: Validation Service Tests Port Validation should validate valid ports
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
extension/src/core/validation-service.ts:76:51
 
     // URL validation
     this.validators.set("url", {
-      validate: (value: any): ValidationResult => {
-        if (!value || value.trim() === "") {
-          return { valid: false, error: "URL is required" };
-        }
-
-        try {
-          new URL(value);
-          return { valid: true };
-        } catch {
-          return { valid: false, error: "Invalid URL format" };
-        }
-      },
+      validate: (value: any): ValidationResult => {},
     });
 
killedBy: Validation Service Tests URL Validation should validate valid URLs
statusReason: TypeError: Cannot read properties of undefined (reading 'valid')

[Killed] EqualityOperator
extension/src/core/validation-service.ts:77:23
     // URL validation
     this.validators.set("url", {
       validate: (value: any): ValidationResult => {
-        if (!value || value.trim() === "") {
+        if (!value || value.trim() !== "") {
           return { valid: false, error: "URL is required" };
         }
killedBy: Validation Service Tests URL Validation should validate valid URLs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
extension/src/core/validation-service.ts:77:13
     // URL validation
     this.validators.set("url", {
       validate: (value: any): ValidationResult => {
-        if (!value || value.trim() === "") {
+        if (value || value.trim() === "") {
           return { valid: false, error: "URL is required" };
         }
killedBy: Validation Service Tests URL Validation should validate valid URLs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
extension/src/core/validation-service.ts:78:27
     this.validators.set("url", {
       validate: (value: any): ValidationResult => {
         if (!value || value.trim() === "") {
-          return { valid: false, error: "URL is required" };
+          return { valid: true, error: "URL is required" };
         }
 
killedBy: Validation Service Tests URL Validation should handle empty URL values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
extension/src/core/validation-service.ts:81:13
           return { valid: false, error: "URL is required" };
         }
 
-        try {
-          new URL(value);
-          return { valid: true };
-        } catch {
+        try {} catch {
           return { valid: false, error: "Invalid URL format" };
         }
killedBy: Validation Service Tests URL Validation should validate valid URLs
statusReason: TypeError: Cannot read properties of undefined (reading 'valid')

[Killed] BooleanLiteral
extension/src/core/validation-service.ts:83:27
 
         try {
           new URL(value);
-          return { valid: true };
+          return { valid: false };
         } catch {
           return { valid: false, error: "Invalid URL format" };
killedBy: Validation Service Tests URL Validation should validate valid URLs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
extension/src/core/validation-service.ts:84:17
         try {
           new URL(value);
           return { valid: true };
-        } catch {
-          return { valid: false, error: "Invalid URL format" };
-        }
+        } catch {}
       },
     });
killedBy: Validation Service Tests URL Validation should reject invalid URLs
statusReason: TypeError: Cannot read properties of undefined (reading 'valid')

[Killed] BooleanLiteral
extension/src/core/validation-service.ts:85:27
           new URL(value);
           return { valid: true };
         } catch {
-          return { valid: false, error: "Invalid URL format" };
+          return { valid: true, error: "Invalid URL format" };
         }
       },
killedBy: Validation Service Tests URL Validation should reject invalid URLs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Timeout] BlockStatement
extension/src/core/validation-service.ts:92:51
 
     // Path validation
     this.validators.set("path", {
-      validate: (value: any): ValidationResult => {
-        if (!value || value.trim() === "") {
-          return { valid: false, error: "Path is required" };
-        }
-
-        // Basic path validation - can be enhanced based on platform
-        if (value.includes("..") || value.includes("//")) {
-          return { valid: false, error: "Invalid path format" };
-        }
-
-        return { valid: true };
-      },
+      validate: (value: any): ValidationResult => {},
     });
 

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:93:13
     // Path validation
     this.validators.set("path", {
       validate: (value: any): ValidationResult => {
-        if (!value || value.trim() === "") {
+        if (true) {
           return { valid: false, error: "Path is required" };
         }
killedBy: Validation Service Tests Path Validation should validate valid paths
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:93:13
     // Path validation
     this.validators.set("path", {
       validate: (value: any): ValidationResult => {
-        if (!value || value.trim() === "") {
+        if (false) {
           return { valid: false, error: "Path is required" };
         }
killedBy: Validation Service Tests Path Validation should handle empty path values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
extension/src/core/validation-service.ts:94:27
     this.validators.set("path", {
       validate: (value: any): ValidationResult => {
         if (!value || value.trim() === "") {
-          return { valid: false, error: "Path is required" };
+          return { valid: true, error: "Path is required" };
         }
 
killedBy: Validation Service Tests Path Validation should handle empty path values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:98:13
         }
 
         // Basic path validation - can be enhanced based on platform
-        if (value.includes("..") || value.includes("//")) {
+        if (false) {
           return { valid: false, error: "Invalid path format" };
         }
killedBy: Validation Service Tests Path Validation should reject invalid paths
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:98:13
         }
 
         // Basic path validation - can be enhanced based on platform
-        if (value.includes("..") || value.includes("//")) {
+        if (true) {
           return { valid: false, error: "Invalid path format" };
         }
killedBy: Validation Service Tests Path Validation should validate valid paths
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
extension/src/core/validation-service.ts:99:27
 
         // Basic path validation - can be enhanced based on platform
         if (value.includes("..") || value.includes("//")) {
-          return { valid: false, error: "Invalid path format" };
+          return { valid: true, error: "Invalid path format" };
         }
 
killedBy: Validation Service Tests Path Validation should reject invalid paths
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] StringLiteral
extension/src/core/validation-service.ts:99:41
 
         // Basic path validation - can be enhanced based on platform
         if (value.includes("..") || value.includes("//")) {
-          return { valid: false, error: "Invalid path format" };
+          return { valid: false, error: "" };
         }
 
killedBy: Validation Service Tests Path Validation should reject invalid paths
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Invalid path format"
Received: ""

[Killed] BlockStatement
extension/src/core/validation-service.ts:111:30
       validate: (
         value: any,
         context?: { min?: number; max?: number }
-      ): ValidationResult => {
-        const num = parseFloat(value);
-
-        if (isNaN(num)) {
-          return { valid: false, error: "Must be a valid number" };
-        }
-
-        if (context?.min !== undefined && num < context.min) {
-          return {
-            valid: false,
-            error: `Value must be at least ${context.min}`,
-          };
-        }
-
-        if (context?.max !== undefined && num > context.max) {
-          return {
-            valid: false,
-            error: `Value must be at most ${context.max}`,
-          };
-        }
-
-        return { valid: true };
-      },
+      ): ValidationResult => {},
     });
 
killedBy: Validation Service Tests Multiple Field Validation should validate multiple fields
statusReason: TypeError: Cannot read properties of undefined (reading 'valid')

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:114:13
       ): ValidationResult => {
         const num = parseFloat(value);
 
-        if (isNaN(num)) {
+        if (true) {
           return { valid: false, error: "Must be a valid number" };
         }
killedBy: Validation Service Tests Multiple Field Validation should validate multiple fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ConditionalExpression
extension/src/core/validation-service.ts:114:13
       ): ValidationResult => {
         const num = parseFloat(value);
 
-        if (isNaN(num)) {
+        if (false) {
           return { valid: false, error: "Must be a valid number" };
         }

[NoCoverage] BooleanLiteral
extension/src/core/validation-service.ts:115:27
         const num = parseFloat(value);
 
         if (isNaN(num)) {
-          return { valid: false, error: "Must be a valid number" };
+          return { valid: true, error: "Must be a valid number" };
         }
 

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:118:43
           return { valid: false, error: "Must be a valid number" };
         }
 
-        if (context?.min !== undefined && num < context.min) {
+        if (context?.min !== undefined && true) {
           return {
             valid: false,
killedBy: Validation Service Tests Multiple Field Validation should validate multiple fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
extension/src/core/validation-service.ts:118:43
           return { valid: false, error: "Must be a valid number" };
         }
 
-        if (context?.min !== undefined && num < context.min) {
+        if (context?.min !== undefined && num >= context.min) {
           return {
             valid: false,
killedBy: Validation Service Tests Multiple Field Validation should validate multiple fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ObjectLiteral
extension/src/core/validation-service.ts:119:18
         }
 
         if (context?.min !== undefined && num < context.min) {
-          return {
-            valid: false,
-            error: `Value must be at least ${context.min}`,
-          };
+          return {};
         }
 
killedBy: Validation Service Tests Context Validation should use context in validation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] BooleanLiteral
extension/src/core/validation-service.ts:120:20
 
         if (context?.min !== undefined && num < context.min) {
           return {
-            valid: false,
+            valid: true,
             error: `Value must be at least ${context.min}`,
           };
killedBy: Validation Service Tests Context Validation should use context in validation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] StringLiteral
extension/src/core/validation-service.ts:121:20
         if (context?.min !== undefined && num < context.min) {
           return {
             valid: false,
-            error: `Value must be at least ${context.min}`,
+            error: ``,
           };
         }
killedBy: Validation Service Tests Context Validation should use context in validation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Value must be at least 1"
Received: ""

[Killed] EqualityOperator
extension/src/core/validation-service.ts:125:43
           };
         }
 
-        if (context?.max !== undefined && num > context.max) {
+        if (context?.max !== undefined && num <= context.max) {
           return {
             valid: false,
killedBy: Validation Service Tests Multiple Field Validation should validate multiple fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:125:13
           };
         }
 
-        if (context?.max !== undefined && num > context.max) {
+        if (true) {
           return {
             valid: false,
killedBy: Validation Service Tests Multiple Field Validation should validate multiple fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
extension/src/core/validation-service.ts:142:23
         value: any,
         context?: { minLength?: number; maxLength?: number; pattern?: RegExp }
       ): ValidationResult => {
-        if (!value || value.trim() === "") {
+        if (!value || value.trim() !== "") {
           return { valid: false, error: "Text is required" };
         }
killedBy: Validation Service Tests Field Validation should validate required fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:142:13
         value: any,
         context?: { minLength?: number; maxLength?: number; pattern?: RegExp }
       ): ValidationResult => {
-        if (!value || value.trim() === "") {
+        if (false) {
           return { valid: false, error: "Text is required" };
         }
killedBy: Validation Service Tests Edge Cases should handle whitespace-only values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Text is required"
Received: "Text must be at least 1 characters"

[Killed] BooleanLiteral
extension/src/core/validation-service.ts:143:27
         context?: { minLength?: number; maxLength?: number; pattern?: RegExp }
       ): ValidationResult => {
         if (!value || value.trim() === "") {
-          return { valid: false, error: "Text is required" };
+          return { valid: true, error: "Text is required" };
         }
 
killedBy: Validation Service Tests Edge Cases should handle whitespace-only values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] StringLiteral
extension/src/core/validation-service.ts:143:41
         context?: { minLength?: number; maxLength?: number; pattern?: RegExp }
       ): ValidationResult => {
         if (!value || value.trim() === "") {
-          return { valid: false, error: "Text is required" };
+          return { valid: false, error: "" };
         }
 
killedBy: Validation Service Tests Edge Cases should handle whitespace-only values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Text is required"
Received: ""

[Survived] MethodExpression
extension/src/core/validation-service.ts:146:30
           return { valid: false, error: "Text is required" };
         }
 
-        const trimmedValue = value.trim();
+        const trimmedValue = value;
 
         if (

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:149:11
         const trimmedValue = value.trim();
 
         if (
-          context?.minLength !== undefined &&
-          trimmedValue.length < context.minLength
+          true
         ) {
           return {
killedBy: Validation Service Tests Field Validation should validate required fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] OptionalChaining
extension/src/core/validation-service.ts:149:11
         const trimmedValue = value.trim();
 
         if (
-          context?.minLength !== undefined &&
+          context.minLength !== undefined &&
           trimmedValue.length < context.minLength
         ) {

[NoCoverage] EqualityOperator
extension/src/core/validation-service.ts:150:11
 
         if (
           context?.minLength !== undefined &&
-          trimmedValue.length < context.minLength
+          trimmedValue.length >= context.minLength
         ) {
           return {

[NoCoverage] EqualityOperator
extension/src/core/validation-service.ts:150:11
 
         if (
           context?.minLength !== undefined &&
-          trimmedValue.length < context.minLength
+          trimmedValue.length <= context.minLength
         ) {
           return {

[NoCoverage] BlockStatement
extension/src/core/validation-service.ts:151:11
         if (
           context?.minLength !== undefined &&
           trimmedValue.length < context.minLength
-        ) {
-          return {
-            valid: false,
-            error: `Text must be at least ${context.minLength} characters`,
-          };
-        }
+        ) {}
 
         if (

[NoCoverage] ObjectLiteral
extension/src/core/validation-service.ts:152:18
           context?.minLength !== undefined &&
           trimmedValue.length < context.minLength
         ) {
-          return {
-            valid: false,
-            error: `Text must be at least ${context.minLength} characters`,
-          };
+          return {};
         }
 

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:159:11
         }
 
         if (
-          context?.maxLength !== undefined &&
-          trimmedValue.length > context.maxLength
+          false
         ) {
           return {
killedBy: Validation Service Tests Edge Cases should handle very long values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
extension/src/core/validation-service.ts:159:11
         }
 
         if (
-          context?.maxLength !== undefined &&
+          context?.maxLength === undefined &&
           trimmedValue.length > context.maxLength
         ) {
killedBy: Validation Service Tests Edge Cases should handle very long values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
extension/src/core/validation-service.ts:160:11
 
         if (
           context?.maxLength !== undefined &&
-          trimmedValue.length > context.maxLength
+          trimmedValue.length <= context.maxLength
         ) {
           return {
killedBy: Validation Service Tests Edge Cases should handle very long values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] ConditionalExpression
extension/src/core/validation-service.ts:160:11
 
         if (
           context?.maxLength !== undefined &&
-          trimmedValue.length > context.maxLength
+          true
         ) {
           return {

[Killed] BlockStatement
extension/src/core/validation-service.ts:161:11
         if (
           context?.maxLength !== undefined &&
           trimmedValue.length > context.maxLength
-        ) {
-          return {
-            valid: false,
-            error: `Text must be at most ${context.maxLength} characters`,
-          };
-        }
+        ) {}
 
         if (context?.pattern && !context.pattern.test(trimmedValue)) {
killedBy: Validation Service Tests Edge Cases should handle very long values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:168:13
           };
         }
 
-        if (context?.pattern && !context.pattern.test(trimmedValue)) {
+        if (false) {
           return { valid: false, error: "Text format is invalid" };
         }
killedBy: Validation Service Tests Field Validation should validate field patterns
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
