[Killed] BooleanLiteral
extension/src/core/validation-service.ts:168:33
           };
         }
 
-        if (context?.pattern && !context.pattern.test(trimmedValue)) {
+        if (context?.pattern && context.pattern.test(trimmedValue)) {
           return { valid: false, error: "Text format is invalid" };
         }
killedBy: Validation Service Tests Field Validation should validate field patterns
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
extension/src/core/validation-service.ts:169:27
         }
 
         if (context?.pattern && !context.pattern.test(trimmedValue)) {
-          return { valid: false, error: "Text format is invalid" };
+          return { valid: true, error: "Text format is invalid" };
         }
 
killedBy: Validation Service Tests Field Validation should validate field patterns
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] StringLiteral
extension/src/core/validation-service.ts:169:41
         }
 
         if (context?.pattern && !context.pattern.test(trimmedValue)) {
-          return { valid: false, error: "Text format is invalid" };
+          return { valid: false, error: "" };
         }
 
killedBy: Validation Service Tests Field Validation should validate field patterns
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Text format is invalid"
Received: ""

[Killed] ObjectLiteral
extension/src/core/validation-service.ts:172:16
           return { valid: false, error: "Text format is invalid" };
         }
 
-        return { valid: true };
+        return {};
       },
     });
killedBy: Validation Service Tests Field Validation should validate required fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[NoCoverage] BlockStatement
extension/src/core/validation-service.ts:181:30
       validate: (
         value: any,
         context?: { options?: string[] }
-      ): ValidationResult => {
-        if (!value || value.trim() === "") {
-          return { valid: false, error: "Selection is required" };
-        }
-
-        if (context?.options && !context.options.includes(value)) {
-          return { valid: false, error: "Invalid selection" };
-        }
-
-        return { valid: true };
-      },
+      ): ValidationResult => {},
     });
   }

[NoCoverage] ConditionalExpression
extension/src/core/validation-service.ts:182:23
         value: any,
         context?: { options?: string[] }
       ): ValidationResult => {
-        if (!value || value.trim() === "") {
+        if (!value || false) {
           return { valid: false, error: "Selection is required" };
         }

[NoCoverage] BooleanLiteral
extension/src/core/validation-service.ts:183:27
         context?: { options?: string[] }
       ): ValidationResult => {
         if (!value || value.trim() === "") {
-          return { valid: false, error: "Selection is required" };
+          return { valid: true, error: "Selection is required" };
         }
 

[NoCoverage] ConditionalExpression
extension/src/core/validation-service.ts:186:13
           return { valid: false, error: "Selection is required" };
         }
 
-        if (context?.options && !context.options.includes(value)) {
+        if (true) {
           return { valid: false, error: "Invalid selection" };
         }

[NoCoverage] LogicalOperator
extension/src/core/validation-service.ts:186:13
           return { valid: false, error: "Selection is required" };
         }
 
-        if (context?.options && !context.options.includes(value)) {
+        if (context?.options || !context.options.includes(value)) {
           return { valid: false, error: "Invalid selection" };
         }

[NoCoverage] BooleanLiteral
extension/src/core/validation-service.ts:187:27
         }
 
         if (context?.options && !context.options.includes(value)) {
-          return { valid: false, error: "Invalid selection" };
+          return { valid: true, error: "Invalid selection" };
         }
 

[NoCoverage] ObjectLiteral
extension/src/core/validation-service.ts:187:18
         }
 
         if (context?.options && !context.options.includes(value)) {
-          return { valid: false, error: "Invalid selection" };
+          return {};
         }
 

[Killed] BlockStatement
extension/src/core/validation-service.ts:198:63
   /**
    * Register a custom validator
    */
-  registerValidator(name: string, validator: Validator): void {
-    this.validators.set(name, validator);
-  }
+  registerValidator(name: string, validator: Validator): void {}
 
   /**
killedBy: Validation Service Tests Custom Validators should register custom validators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
extension/src/core/validation-service.ts:205:58
   /**
    * Register a field configuration
    */
-  registerField(name: string, config: FieldConfig): void {
-    this.fieldConfigs.set(name, config);
-  }
+  registerField(name: string, config: FieldConfig): void {}
 
   /**
killedBy: Validation Service Tests Field Validation should validate required fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
extension/src/core/validation-service.ts:212:80
   /**
    * Validate a value using a specific validator
    */
-  validate(validatorName: string, value: any, context?: any): ValidationResult {
-    const validator = this.validators.get(validatorName);
-    if (!validator) {
-      return { valid: true }; // Default to valid if no validator found
-    }
-
-    return validator.validate(value, context);
-  }
+  validate(validatorName: string, value: any, context?: any): ValidationResult {}
 
   /**
killedBy: Validation Service Tests Port Validation should validate valid ports
statusReason: TypeError: Cannot read properties of undefined (reading 'valid')

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:214:9
    */
   validate(validatorName: string, value: any, context?: any): ValidationResult {
     const validator = this.validators.get(validatorName);
-    if (!validator) {
+    if (true) {
       return { valid: true }; // Default to valid if no validator found
     }
killedBy: Validation Service Tests Port Validation should reject invalid ports
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:214:9
    */
   validate(validatorName: string, value: any, context?: any): ValidationResult {
     const validator = this.validators.get(validatorName);
-    if (!validator) {
+    if (false) {
       return { valid: true }; // Default to valid if no validator found
     }
killedBy: Validation Service Tests Error Handling should handle unknown validators
statusReason: TypeError: Cannot read properties of undefined (reading 'validate')

[Killed] BooleanLiteral
extension/src/core/validation-service.ts:215:23
   validate(validatorName: string, value: any, context?: any): ValidationResult {
     const validator = this.validators.get(validatorName);
     if (!validator) {
-      return { valid: true }; // Default to valid if no validator found
+      return { valid: false }; // Default to valid if no validator found
     }
 
killedBy: Validation Service Tests Error Handling should handle unknown validators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ObjectLiteral
extension/src/core/validation-service.ts:215:14
   validate(validatorName: string, value: any, context?: any): ValidationResult {
     const validator = this.validators.get(validatorName);
     if (!validator) {
-      return { valid: true }; // Default to valid if no validator found
+      return {}; // Default to valid if no validator found
     }
 
killedBy: Validation Service Tests Error Handling should handle unknown validators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BooleanLiteral
extension/src/core/validation-service.ts:226:9
    */
   validateField(fieldName: string, value: any): ValidationResult {
     const config = this.fieldConfigs.get(fieldName);
-    if (!config) {
+    if (config) {
       return { valid: true }; // Default to valid if no config found
     }
killedBy: Validation Service Tests Field Validation should validate required fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:226:9
    */
   validateField(fieldName: string, value: any): ValidationResult {
     const config = this.fieldConfigs.get(fieldName);
-    if (!config) {
+    if (true) {
       return { valid: true }; // Default to valid if no config found
     }
killedBy: Validation Service Tests Field Validation should validate required fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
extension/src/core/validation-service.ts:227:23
   validateField(fieldName: string, value: any): ValidationResult {
     const config = this.fieldConfigs.get(fieldName);
     if (!config) {
-      return { valid: true }; // Default to valid if no config found
+      return { valid: false }; // Default to valid if no config found
     }
 
killedBy: Validation Service Tests Error Handling should handle unknown fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
extension/src/core/validation-service.ts:231:29
     }
 
     // Check required
-    if (config.required && (!value || value.toString().trim() === "")) {
+    if (config.required && (value || value.toString().trim() === "")) {
       return { valid: false, error: `${config.name} is required` };
     }
killedBy: Validation Service Tests Field Validation should validate required fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
extension/src/core/validation-service.ts:231:9
     }
 
     // Check required
-    if (config.required && (!value || value.toString().trim() === "")) {
+    if (config.required || !value || value.toString().trim() === "") {
       return { valid: false, error: `${config.name} is required` };
     }
killedBy: Validation Service Tests Field Validation should validate required fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
extension/src/core/validation-service.ts:232:23
 
     // Check required
     if (config.required && (!value || value.toString().trim() === "")) {
-      return { valid: false, error: `${config.name} is required` };
+      return { valid: true, error: `${config.name} is required` };
     }
 
killedBy: Validation Service Tests Field Validation should validate required fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ObjectLiteral
extension/src/core/validation-service.ts:232:14
 
     // Check required
     if (config.required && (!value || value.toString().trim() === "")) {
-      return { valid: false, error: `${config.name} is required` };
+      return {};
     }
 
killedBy: Validation Service Tests Field Validation should validate required fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:236:9
     }
 
     // If not required and empty, consider valid
-    if (!config.required && (!value || value.toString().trim() === "")) {
+    if (true) {
       return { valid: true };
     }
killedBy: Validation Service Tests Field Validation should validate field length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[NoCoverage] ConditionalExpression
extension/src/core/validation-service.ts:236:40
     }
 
     // If not required and empty, consider valid
-    if (!config.required && (!value || value.toString().trim() === "")) {
+    if (!config.required && (!value || false)) {
       return { valid: true };
     }

[NoCoverage] BooleanLiteral
extension/src/core/validation-service.ts:237:23
 
     // If not required and empty, consider valid
     if (!config.required && (!value || value.toString().trim() === "")) {
-      return { valid: true };
+      return { valid: false };
     }
 

[Killed] BooleanLiteral
extension/src/core/validation-service.ts:242:9
 
     // Get the appropriate validator
     const validator = this.validators.get(config.type);
-    if (!validator) {
+    if (validator) {
       return { valid: true }; // Default to valid if no validator found
     }
killedBy: Validation Service Tests Field Validation should validate field length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:242:9
 
     // Get the appropriate validator
     const validator = this.validators.get(config.type);
-    if (!validator) {
+    if (true) {
       return { valid: true }; // Default to valid if no validator found
     }
killedBy: Validation Service Tests Field Validation should validate field length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] EqualityOperator
extension/src/core/validation-service.ts:248:9
 
     // Build context for validation
     const context: any = {};
-    if (config.min !== undefined) context.min = config.min;
+    if (config.min === undefined) context.min = config.min;
     if (config.max !== undefined) context.max = config.max;
     if (config.pattern) context.pattern = config.pattern;

[Survived] ConditionalExpression
extension/src/core/validation-service.ts:248:9
 
     // Build context for validation
     const context: any = {};
-    if (config.min !== undefined) context.min = config.min;
+    if (true) context.min = config.min;
     if (config.max !== undefined) context.max = config.max;
     if (config.pattern) context.pattern = config.pattern;

[Killed] EqualityOperator
extension/src/core/validation-service.ts:249:9
     // Build context for validation
     const context: any = {};
     if (config.min !== undefined) context.min = config.min;
-    if (config.max !== undefined) context.max = config.max;
+    if (config.max === undefined) context.max = config.max;
     if (config.pattern) context.pattern = config.pattern;
 
killedBy: Validation Service Tests Multiple Field Validation should identify invalid fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:249:9
     // Build context for validation
     const context: any = {};
     if (config.min !== undefined) context.min = config.min;
-    if (config.max !== undefined) context.max = config.max;
+    if (false) context.max = config.max;
     if (config.pattern) context.pattern = config.pattern;
 
killedBy: Validation Service Tests Multiple Field Validation should identify invalid fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:250:9
     const context: any = {};
     if (config.min !== undefined) context.min = config.min;
     if (config.max !== undefined) context.max = config.max;
-    if (config.pattern) context.pattern = config.pattern;
+    if (false) context.pattern = config.pattern;
 
     // Run validation
killedBy: Validation Service Tests Field Validation should validate field patterns
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] ConditionalExpression
extension/src/core/validation-service.ts:250:9
     const context: any = {};
     if (config.min !== undefined) context.min = config.min;
     if (config.max !== undefined) context.max = config.max;
-    if (config.pattern) context.pattern = config.pattern;
+    if (true) context.pattern = config.pattern;
 
     // Run validation

[Killed] ConditionalExpression
extension/src/core/validation-service.ts:256:9
     const result = validator.validate(value, context);
 
     // Run custom validator if provided
-    if (config.customValidator && result.valid) {
+    if (false) {
       const customResult = config.customValidator(value);
       if (!customResult.valid) {
killedBy: Validation Service Tests Field Validation should validate field length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
extension/src/core/validation-service.ts:256:9
     const result = validator.validate(value, context);
 
     // Run custom validator if provided
-    if (config.customValidator && result.valid) {
+    if (config.customValidator || result.valid) {
       const customResult = config.customValidator(value);
       if (!customResult.valid) {
killedBy: Validation Service Tests Field Validation should validate required fields
statusReason: TypeError: config.customValidator is not a function

[Killed] BooleanLiteral
extension/src/core/validation-service.ts:258:11
     // Run custom validator if provided
     if (config.customValidator && result.valid) {
       const customResult = config.customValidator(value);
-      if (!customResult.valid) {
+      if (customResult.valid) {
         return customResult;
       }
killedBy: Validation Service Tests Field Validation should validate field length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
extension/src/core/validation-service.ts:258:32
     // Run custom validator if provided
     if (config.customValidator && result.valid) {
       const customResult = config.customValidator(value);
-      if (!customResult.valid) {
-        return customResult;
-      }
+      if (!customResult.valid) {}
     }
 
killedBy: Validation Service Tests Field Validation should validate field length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
extension/src/core/validation-service.ts:271:39
    */
   validateFields(
     fields: Record<string, any>
-  ): Record<string, ValidationResult> {
-    const results: Record<string, ValidationResult> = {};
-
-    for (const [fieldName, value] of Object.entries(fields)) {
-      results[fieldName] = this.validateField(fieldName, value);
-    }
-
-    return results;
-  }
+  ): Record<string, ValidationResult> {}
 
   /**
killedBy: Validation Service Tests Multiple Field Validation should validate multiple fields
statusReason: TypeError: Cannot read properties of undefined (reading 'port')

[Killed] BlockStatement
extension/src/core/validation-service.ts:274:62
   ): Record<string, ValidationResult> {
     const results: Record<string, ValidationResult> = {};
 
-    for (const [fieldName, value] of Object.entries(fields)) {
-      results[fieldName] = this.validateField(fieldName, value);
-    }
+    for (const [fieldName, value] of Object.entries(fields)) {}
 
     return results;
killedBy: Validation Service Tests Multiple Field Validation should validate multiple fields
statusReason: TypeError: Cannot read properties of undefined (reading 'valid')

[Killed] BlockStatement
extension/src/core/validation-service.ts:284:63
   /**
    * Check if all validations pass
    */
-  isValid(results: Record<string, ValidationResult>): boolean {
-    return Object.values(results).every((result) => result.valid);
-  }
+  isValid(results: Record<string, ValidationResult>): boolean {}
 
   /**
killedBy: Validation Service Tests Multiple Field Validation should check overall validity
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ArrowFunction
extension/src/core/validation-service.ts:285:41
    * Check if all validations pass
    */
   isValid(results: Record<string, ValidationResult>): boolean {
-    return Object.values(results).every((result) => result.valid);
+    return Object.values(results).every(() => undefined);
   }
 
killedBy: Validation Service Tests Multiple Field Validation should check overall validity
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] MethodExpression
extension/src/core/validation-service.ts:285:12
    * Check if all validations pass
    */
   isValid(results: Record<string, ValidationResult>): boolean {
-    return Object.values(results).every((result) => result.valid);
+    return Object.values(results).some(result => result.valid);
   }
 

[Killed] BlockStatement
extension/src/core/validation-service.ts:291:80
   /**
    * Get all validation errors
    */
-  getErrors(results: Record<string, ValidationResult>): Record<string, string> {
-    const errors: Record<string, string> = {};
-
-    for (const [fieldName, result] of Object.entries(results)) {
-      if (!result.valid && result.error) {
-        errors[fieldName] = result.error;
-      }
-    }
-
-    return errors;
-  }
+  getErrors(results: Record<string, ValidationResult>): Record<string, string> {}
 
   /**
killedBy: Validation Service Tests Error Handling should get error messages
statusReason: TypeError: Cannot read properties of undefined (reading 'port')

[Killed] BlockStatement
extension/src/core/validation-service.ts:294:64
   getErrors(results: Record<string, ValidationResult>): Record<string, string> {
     const errors: Record<string, string> = {};
 
-    for (const [fieldName, result] of Object.entries(results)) {
-      if (!result.valid && result.error) {
-        errors[fieldName] = result.error;
-      }
-    }
+    for (const [fieldName, result] of Object.entries(results)) {}
 
     return errors;
killedBy: Validation Service Tests Error Handling should get error messages
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] BlockStatement
extension/src/core/validation-service.ts:295:42
     const errors: Record<string, string> = {};
 
     for (const [fieldName, result] of Object.entries(results)) {
-      if (!result.valid && result.error) {
-        errors[fieldName] = result.error;
-      }
+      if (!result.valid && result.error) {}
     }
 
killedBy: Validation Service Tests Error Handling should get error messages
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] BooleanLiteral
extension/src/core/validation-service.ts:295:11
     const errors: Record<string, string> = {};
 
     for (const [fieldName, result] of Object.entries(results)) {
-      if (!result.valid && result.error) {
+      if (result.valid && result.error) {
         errors[fieldName] = result.error;
       }
killedBy: Validation Service Tests Error Handling should get error messages
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[NoCoverage] ObjectLiteral
extension/src/core/validation-service.ts:308:38
    */
   configureCommonFields(): void {
     // Port field
-    this.registerField("serverPort", {
-      name: "Server Port",
-      type: "number",
-      required: true,
-      min: 1,
-      max: 65535,
-    });
+    this.registerField("serverPort", {});
 
     // Download directory field

[NoCoverage] StringLiteral
extension/src/core/validation-service.ts:310:13
     // Port field
     this.registerField("serverPort", {
       name: "Server Port",
-      type: "number",
+      type: "",
       required: true,
       min: 1,

[NoCoverage] BooleanLiteral
extension/src/core/validation-service.ts:311:17
     this.registerField("serverPort", {
       name: "Server Port",
       type: "number",
-      required: true,
+      required: false,
       min: 1,
       max: 65535,

[NoCoverage] ObjectLiteral
extension/src/core/validation-service.ts:317:39
     });
 
     // Download directory field
-    this.registerField("downloadDir", {
-      name: "Download Directory",
-      type: "path",
-      required: true,
-    });
+    this.registerField("downloadDir", {});
 
     // Log level field

[NoCoverage] StringLiteral
extension/src/core/validation-service.ts:317:24
     });
 
     // Download directory field
-    this.registerField("downloadDir", {
+    this.registerField("", {
       name: "Download Directory",
       type: "path",

[NoCoverage] BooleanLiteral
extension/src/core/validation-service.ts:320:17
     this.registerField("downloadDir", {
       name: "Download Directory",
       type: "path",
-      required: true,
+      required: false,
     });
 

[NoCoverage] StringLiteral
extension/src/core/validation-service.ts:324:24
     });
 
     // Log level field
-    this.registerField("logLevel", {
+    this.registerField("", {
       name: "Log Level",
       type: "select",

[NoCoverage] StringLiteral
extension/src/core/validation-service.ts:325:13
 
     // Log level field
     this.registerField("logLevel", {
-      name: "Log Level",
+      name: "",
       type: "select",
       required: true,

[NoCoverage] BooleanLiteral
extension/src/core/validation-service.ts:327:17
     this.registerField("logLevel", {
       name: "Log Level",
       type: "select",
-      required: true,
+      required: false,
       customValidator: (value: any) => {
         const validLevels = ["DEBUG", "INFO", "WARNING", "ERROR"];

[NoCoverage] BlockStatement
extension/src/core/validation-service.ts:328:40
       name: "Log Level",
       type: "select",
       required: true,
-      customValidator: (value: any) => {
-        const validLevels = ["DEBUG", "INFO", "WARNING", "ERROR"];
-        if (!validLevels.includes(value)) {
-          return { valid: false, error: "Invalid log level" };
-        }
-        return { valid: true };
-      },
+      customValidator: (value: any) => {},
     });
 

[NoCoverage] StringLiteral
extension/src/core/validation-service.ts:329:58
       type: "select",
       required: true,
       customValidator: (value: any) => {
-        const validLevels = ["DEBUG", "INFO", "WARNING", "ERROR"];
+        const validLevels = ["DEBUG", "INFO", "WARNING", ""];
         if (!validLevels.includes(value)) {
           return { valid: false, error: "Invalid log level" };

[NoCoverage] ArrayDeclaration
extension/src/core/validation-service.ts:329:29
       type: "select",
       required: true,
       customValidator: (value: any) => {
-        const validLevels = ["DEBUG", "INFO", "WARNING", "ERROR"];
+        const validLevels = [];
         if (!validLevels.includes(value)) {
           return { valid: false, error: "Invalid log level" };

[NoCoverage] BooleanLiteral
extension/src/core/validation-service.ts:330:13
       required: true,
       customValidator: (value: any) => {
         const validLevels = ["DEBUG", "INFO", "WARNING", "ERROR"];
-        if (!validLevels.includes(value)) {
+        if (validLevels.includes(value)) {
           return { valid: false, error: "Invalid log level" };
         }

[NoCoverage] ConditionalExpression
extension/src/core/validation-service.ts:330:13
       required: true,
       customValidator: (value: any) => {
         const validLevels = ["DEBUG", "INFO", "WARNING", "ERROR"];
-        if (!validLevels.includes(value)) {
+        if (true) {
           return { valid: false, error: "Invalid log level" };
         }

[NoCoverage] BooleanLiteral
extension/src/core/validation-service.ts:331:27
       customValidator: (value: any) => {
         const validLevels = ["DEBUG", "INFO", "WARNING", "ERROR"];
         if (!validLevels.includes(value)) {
-          return { valid: false, error: "Invalid log level" };
+          return { valid: true, error: "Invalid log level" };
         }
         return { valid: true };

[NoCoverage] BooleanLiteral
extension/src/core/validation-service.ts:333:25
         if (!validLevels.includes(value)) {
           return { valid: false, error: "Invalid log level" };
         }
-        return { valid: true };
+        return { valid: false };
       },
     });

[NoCoverage] ObjectLiteral
extension/src/core/validation-service.ts:333:16
         if (!validLevels.includes(value)) {
           return { valid: false, error: "Invalid log level" };
         }
-        return { valid: true };
+        return {};
       },
     });

[NoCoverage] BlockStatement
extension/src/core/validation-service.ts:342:40
       name: "Format",
       type: "select",
       required: true,
-      customValidator: (value: any) => {
-        const validFormats = ["mp4", "webm", "mkv", "avi"];
-        if (!validFormats.includes(value)) {
-          return { valid: false, error: "Invalid format" };
-        }
-        return { valid: true };
-      },
+      customValidator: (value: any) => {},
     });
   }

[NoCoverage] StringLiteral
extension/src/core/validation-service.ts:343:38
       type: "select",
       required: true,
       customValidator: (value: any) => {
-        const validFormats = ["mp4", "webm", "mkv", "avi"];
+        const validFormats = ["mp4", "", "mkv", "avi"];
         if (!validFormats.includes(value)) {
           return { valid: false, error: "Invalid format" };
