[NoCoverage] ConditionalExpression
extension/src/core/validation-service.ts:344:13
       required: true,
       customValidator: (value: any) => {
         const validFormats = ["mp4", "webm", "mkv", "avi"];
-        if (!validFormats.includes(value)) {
+        if (false) {
           return { valid: false, error: "Invalid format" };
         }

[NoCoverage] ConditionalExpression
extension/src/core/validation-service.ts:344:13
       required: true,
       customValidator: (value: any) => {
         const validFormats = ["mp4", "webm", "mkv", "avi"];
-        if (!validFormats.includes(value)) {
+        if (true) {
           return { valid: false, error: "Invalid format" };
         }

[NoCoverage] BooleanLiteral
extension/src/core/validation-service.ts:345:27
       customValidator: (value: any) => {
         const validFormats = ["mp4", "webm", "mkv", "avi"];
         if (!validFormats.includes(value)) {
-          return { valid: false, error: "Invalid format" };
+          return { valid: true, error: "Invalid format" };
         }
         return { valid: true };

[NoCoverage] ObjectLiteral
extension/src/core/validation-service.ts:345:18
       customValidator: (value: any) => {
         const validFormats = ["mp4", "webm", "mkv", "avi"];
         if (!validFormats.includes(value)) {
-          return { valid: false, error: "Invalid format" };
+          return {};
         }
         return { valid: true };
