[Killed] StringLiteral
extension/src/history.ts:8:34
 import { HistoryEntry } from "./types";
 
 // --- History utility functions ---
-export const historyStorageKey = "downloadHistory";
+export const historyStorageKey = "";
 
 /**
killedBy: history module fetchHistory returns sorted history
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Survived] ArrayDeclaration
extension/src/history.ts:24:53
   totalItems: number;
 }> {
   return new Promise((resolve, reject) => {
-    chrome.storage.local.get({ [historyStorageKey]: [] }, (result) => {
+    chrome.storage.local.get({ [historyStorageKey]: ["Stryker was here"] }, (result) => {
       if (chrome.runtime.lastError) {
         console.warn(

[Survived] ConditionalExpression
extension/src/history.ts:25:11
 }> {
   return new Promise((resolve, reject) => {
     chrome.storage.local.get({ [historyStorageKey]: [] }, (result) => {
-      if (chrome.runtime.lastError) {
+      if (false) {
         console.warn(
           "[EVD][HISTORY] Error fetching history:",

[Survived] BlockStatement
extension/src/history.ts:25:37
 }> {
   return new Promise((resolve, reject) => {
     chrome.storage.local.get({ [historyStorageKey]: [] }, (result) => {
-      if (chrome.runtime.lastError) {
-        console.warn(
-          "[EVD][HISTORY] Error fetching history:",
-          chrome.runtime.lastError.message
-        );
-        return resolve({ history: [], totalItems: 0 });
-      }
+      if (chrome.runtime.lastError) {}
       // Ensure items have a timestamp for sorting, default to 0 if missing
       const allHistory = (result[historyStorageKey] || []).map(

[Killed] ObjectLiteral
extension/src/history.ts:30:24
           "[EVD][HISTORY] Error fetching history:",
           chrome.runtime.lastError.message
         );
-        return resolve({ history: [], totalItems: 0 });
+        return resolve({});
       }
       // Ensure items have a timestamp for sorting, default to 0 if missing
killedBy: history.ts core functions fetchHistory returns empty history on runtime error
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] ArrowFunction
extension/src/history.ts:34:9
       }
       // Ensure items have a timestamp for sorting, default to 0 if missing
       const allHistory = (result[historyStorageKey] || []).map(
-        (item: HistoryEntry) => ({
-          ...item,
-          timestamp: item.timestamp || 0,
-        })
+        () => undefined
       );
       // Sort by timestamp descending (newest first)
killedBy: history module fetchHistory returns sorted history
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
extension/src/history.ts:36:22
       const allHistory = (result[historyStorageKey] || []).map(
         (item: HistoryEntry) => ({
           ...item,
-          timestamp: item.timestamp || 0,
+          timestamp: false,
         })
       );
killedBy: history module fetchHistory returns sorted history
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2"
Received: "1"

[Killed] LogicalOperator
extension/src/history.ts:36:22
       const allHistory = (result[historyStorageKey] || []).map(
         (item: HistoryEntry) => ({
           ...item,
-          timestamp: item.timestamp || 0,
+          timestamp: item.timestamp && 0,
         })
       );
killedBy: history module fetchHistory returns sorted history
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2"
Received: "1"

[Killed] MethodExpression
extension/src/history.ts:40:7
         })
       );
       // Sort by timestamp descending (newest first)
-      allHistory.sort(
-        (a: HistoryEntry, b: HistoryEntry) =>
-          (b.timestamp as number) - (a.timestamp as number)
-      );
+      allHistory;
 
       // Handle pagination
killedBy: history module fetchHistory returns sorted history
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2"
Received: "1"

[Killed] ArrowFunction
extension/src/history.ts:41:9
       );
       // Sort by timestamp descending (newest first)
       allHistory.sort(
-        (a: HistoryEntry, b: HistoryEntry) =>
-          (b.timestamp as number) - (a.timestamp as number)
+        () => undefined
       );
 
killedBy: history module fetchHistory returns sorted history
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2"
Received: "1"

[Killed] ArithmeticOperator
extension/src/history.ts:42:11
       // Sort by timestamp descending (newest first)
       allHistory.sort(
         (a: HistoryEntry, b: HistoryEntry) =>
-          (b.timestamp as number) - (a.timestamp as number)
+          (b.timestamp as number) + (a.timestamp as number)
       );
 
killedBy: history module fetchHistory returns sorted history
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2"
Received: "1"

[Killed] ArithmeticOperator
extension/src/history.ts:47:27
 
       // Handle pagination
       const totalItems = allHistory.length;
-      const startIndex = (page - 1) * perPage;
+      const startIndex = (page + 1) * perPage;
       const endIndex = startIndex + perPage;
       const paginatedHistory = allHistory.slice(startIndex, endIndex);
killedBy: history.ts core functions fetchHistory returns paginated and sorted history
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Array [
-   Object {
-     "id": "2",

[Survived] ArithmeticOperator
extension/src/history.ts:47:26
 
       // Handle pagination
       const totalItems = allHistory.length;
-      const startIndex = (page - 1) * perPage;
+      const startIndex = (page - 1) / perPage;
       const endIndex = startIndex + perPage;
       const paginatedHistory = allHistory.slice(startIndex, endIndex);

[Killed] ArithmeticOperator
extension/src/history.ts:48:24
       // Handle pagination
       const totalItems = allHistory.length;
       const startIndex = (page - 1) * perPage;
-      const endIndex = startIndex + perPage;
+      const endIndex = startIndex - perPage;
       const paginatedHistory = allHistory.slice(startIndex, endIndex);
 
killedBy: history module fetchHistory returns sorted history
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] MethodExpression
extension/src/history.ts:49:32
       const totalItems = allHistory.length;
       const startIndex = (page - 1) * perPage;
       const endIndex = startIndex + perPage;
-      const paginatedHistory = allHistory.slice(startIndex, endIndex);
+      const paginatedHistory = allHistory;
 
       resolve({ history: paginatedHistory, totalItems });
killedBy: history.ts core functions fetchHistory returns paginated and sorted history
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 5

@@ -2,6 +2,11 @@
    Object {
      "id": "2",

[Killed] ConditionalExpression
extension/src/history.ts:77:7
   prevPageBtn?: HTMLButtonElement,
   nextPageBtn?: HTMLButtonElement
 ): void {
-  if (!historyListElement) {
+  if (true) {
     console.error(
       "[EVD][HISTORY] No history list element provided to renderHistory"
killedBy: history.ts core functions renderHistoryItems renders empty state when no items
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "empty-history"
Received string:    ""

[Killed] BooleanLiteral
extension/src/history.ts:77:7
   prevPageBtn?: HTMLButtonElement,
   nextPageBtn?: HTMLButtonElement
 ): void {
-  if (!historyListElement) {
+  if (historyListElement) {
     console.error(
       "[EVD][HISTORY] No history list element provided to renderHistory"
killedBy: history.ts core functions renderHistoryItems renders empty state when no items
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "empty-history"
Received string:    ""

[Killed] EqualityOperator
extension/src/history.ts:85:7
   }
 
   // Validate that historyListElement is actually a DOM element with innerHTML property
-  if (typeof historyListElement.innerHTML !== "string") {
+  if (typeof historyListElement.innerHTML === "string") {
     console.error(
       "[EVD][HISTORY] Invalid history list element provided to renderHistory:",
killedBy: renderHistoryItems renders empty history correctly
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received object: []

[Killed] ConditionalExpression
extension/src/history.ts:85:7
   }
 
   // Validate that historyListElement is actually a DOM element with innerHTML property
-  if (typeof historyListElement.innerHTML !== "string") {
+  if (true) {
     console.error(
       "[EVD][HISTORY] Invalid history list element provided to renderHistory:",
killedBy: history.ts core functions renderHistoryItems renders empty state when no items
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "empty-history"
Received string:    ""

[Survived] StringLiteral
extension/src/history.ts:94:34
   }
 
   // Clear the list
-  historyListElement.innerHTML = "";
+  historyListElement.innerHTML = "Stryker was here!";
 
   // If we have no items, show a message

[Killed] ConditionalExpression
extension/src/history.ts:97:7
   historyListElement.innerHTML = "";
 
   // If we have no items, show a message
-  if (!historyItems || historyItems.length === 0) {
+  if (true) {
     historyListElement.innerHTML =
       '<li class="empty-history">No download history available.</li>';
killedBy: renderHistoryItems renders history items and pagination correctly
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received object: []

[Killed] LogicalOperator
extension/src/history.ts:97:7
   historyListElement.innerHTML = "";
 
   // If we have no items, show a message
-  if (!historyItems || historyItems.length === 0) {
+  if (!historyItems && historyItems.length === 0) {
     historyListElement.innerHTML =
       '<li class="empty-history">No download history available.</li>';
killedBy: renderHistoryItems renders empty history correctly
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received object: []

[Killed] BlockStatement
extension/src/history.ts:102:64
       '<li class="empty-history">No download history available.</li>';
 
     // Update pagination UI if provided
-    if (pageInfoElement && pageInfoElement instanceof Element) {
-      pageInfoElement.textContent = "No items";
-    }
+    if (pageInfoElement && pageInfoElement instanceof Element) {}
 
     // Disable pagination buttons if they exist and are DOM elements
killedBy: history.ts core functions renderHistoryItems renders empty state when no items
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "No items"
Received: ""

[Killed] ConditionalExpression
extension/src/history.ts:102:9
       '<li class="empty-history">No download history available.</li>';
 
     // Update pagination UI if provided
-    if (pageInfoElement && pageInfoElement instanceof Element) {
+    if (false) {
       pageInfoElement.textContent = "No items";
     }
killedBy: history.ts core functions renderHistoryItems renders empty state when no items
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "No items"
Received: ""

[Killed] ConditionalExpression
extension/src/history.ts:107:9
     }
 
     // Disable pagination buttons if they exist and are DOM elements
-    if (prevPageBtn && prevPageBtn instanceof Element) {
+    if (false) {
       prevPageBtn.disabled = true;
     }
killedBy: renderHistoryItems renders empty history correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
extension/src/history.ts:107:56
     }
 
     // Disable pagination buttons if they exist and are DOM elements
-    if (prevPageBtn && prevPageBtn instanceof Element) {
-      prevPageBtn.disabled = true;
-    }
+    if (prevPageBtn && prevPageBtn instanceof Element) {}
 
     if (nextPageBtn && nextPageBtn instanceof Element) {
killedBy: history.ts core functions renderHistoryItems renders empty state when no items
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
extension/src/history.ts:108:30
 
     // Disable pagination buttons if they exist and are DOM elements
     if (prevPageBtn && prevPageBtn instanceof Element) {
-      prevPageBtn.disabled = true;
+      prevPageBtn.disabled = false;
     }
 
killedBy: history.ts core functions renderHistoryItems renders empty state when no items
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
extension/src/history.ts:111:9
       prevPageBtn.disabled = true;
     }
 
-    if (nextPageBtn && nextPageBtn instanceof Element) {
+    if (false) {
       nextPageBtn.disabled = true;
     }
killedBy: renderHistoryItems renders empty history correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
extension/src/history.ts:111:56
       prevPageBtn.disabled = true;
     }
 
-    if (nextPageBtn && nextPageBtn instanceof Element) {
-      nextPageBtn.disabled = true;
-    }
+    if (nextPageBtn && nextPageBtn instanceof Element) {}
 
     return;
killedBy: renderHistoryItems renders empty history correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
extension/src/history.ts:112:30
     }
 
     if (nextPageBtn && nextPageBtn instanceof Element) {
-      nextPageBtn.disabled = true;
+      nextPageBtn.disabled = false;
     }
 
killedBy: renderHistoryItems renders empty history correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
extension/src/history.ts:122:18
   historyItems.forEach((item) => {
     const li = document.createElement("li");
     li.className = "history-item";
-    if (item.id) {
-      li.dataset.itemId = item.id.toString(); // Store ID for potential actions like delete
-    }
+    if (item.id) {}
 
     const titleDiv = document.createElement("div");
killedBy: renderHistoryItems renders history items and pagination correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1"
Received: undefined

[Killed] ConditionalExpression
extension/src/history.ts:122:9
   historyItems.forEach((item) => {
     const li = document.createElement("li");
     li.className = "history-item";
-    if (item.id) {
+    if (false) {
       li.dataset.itemId = item.id.toString(); // Store ID for potential actions like delete
     }
killedBy: renderHistoryItems renders history items and pagination correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1"
Received: undefined

[Killed] LogicalOperator
extension/src/history.ts:128:29
 
     const titleDiv = document.createElement("div");
     const titleBold = document.createElement("b");
-    titleBold.textContent = item.page_title || item.filename || "...";
+    titleBold.textContent = item.page_title && item.filename || "...";
     titleDiv.appendChild(titleBold);
 
killedBy: history.ts core functions renderHistoryItems renders list of items
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Test"
Received: "..."

[Killed] ConditionalExpression
extension/src/history.ts:128:29
 
     const titleDiv = document.createElement("div");
     const titleBold = document.createElement("b");
-    titleBold.textContent = item.page_title || item.filename || "...";
+    titleBold.textContent = true;
     titleDiv.appendChild(titleBold);
 
killedBy: renderHistoryItems renders history items and pagination correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Title1"
Received: "true"

[Killed] StringLiteral
extension/src/history.ts:135:9
     timestampDiv.className = "history-item-timestamp";
     timestampDiv.textContent = item.timestamp
       ? new Date(item.timestamp).toLocaleString()
-      : "";
+      : "Stryker was here!";
 
     const statusDiv = document.createElement("div");
killedBy: renderHistoryItems renders items with missing optional fields correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Stryker was here!"

[Killed] StringLiteral
extension/src/history.ts:138:47
       : "";
 
     const statusDiv = document.createElement("div");
-    const statusBold = document.createElement("b");
+    const statusBold = document.createElement("");
     statusBold.textContent = item.status || "";
     statusDiv.appendChild(document.createTextNode("Status: "));
killedBy: renderHistoryItems renders history items and pagination correctly
statusReason: InvalidCharacterError: "" did not match the Name production

[Survived] ConditionalExpression
extension/src/history.ts:139:30
 
     const statusDiv = document.createElement("div");
     const statusBold = document.createElement("b");
-    statusBold.textContent = item.status || "";
+    statusBold.textContent = false;
     statusDiv.appendChild(document.createTextNode("Status: "));
     statusDiv.appendChild(statusBold);

[Survived] ConditionalExpression
extension/src/history.ts:139:30
 
     const statusDiv = document.createElement("div");
     const statusBold = document.createElement("b");
-    statusBold.textContent = item.status || "";
+    statusBold.textContent = true;
     statusDiv.appendChild(document.createTextNode("Status: "));
     statusDiv.appendChild(statusBold);

[Survived] StringLiteral
extension/src/history.ts:140:51
     const statusDiv = document.createElement("div");
     const statusBold = document.createElement("b");
     statusBold.textContent = item.status || "";
-    statusDiv.appendChild(document.createTextNode("Status: "));
+    statusDiv.appendChild(document.createTextNode(""));
     statusDiv.appendChild(statusBold);
 

[Killed] StringLiteral
extension/src/history.ts:143:51
     statusDiv.appendChild(document.createTextNode("Status: "));
     statusDiv.appendChild(statusBold);
 
-    const actionsWrapper = document.createElement("div");
+    const actionsWrapper = document.createElement("");
     actionsWrapper.className = "history-actions";
 
killedBy: renderHistoryItems renders history items and pagination correctly
statusReason: InvalidCharacterError: "" did not match the Name production

[Survived] StringLiteral
extension/src/history.ts:144:32
     statusDiv.appendChild(statusBold);
 
     const actionsWrapper = document.createElement("div");
-    actionsWrapper.className = "history-actions";
+    actionsWrapper.className = "";
 
     const retryButton = document.createElement("button");

[NoCoverage] BlockStatement
extension/src/history.ts:150:50
     retryButton.className = "btn btn--secondary retry-btn";
     retryButton.textContent = "Retry";
     retryButton.title = "Retry download";
-    retryButton.addEventListener("click", (e) => {
-      e.stopPropagation(); // Prevent li click if any
-      // Retry clicked for item
-      chrome.runtime.sendMessage(
-        {
-          type: "downloadVideo", // Changed action to type
-          url: item.url,
-          filename: item.filename,
-          page_title: item.page_title || document.title, // Fallback for page_title
-          // id: item.id // Optionally pass original ID if server needs to link them
-        },
-        (response) => {
-          if (chrome.runtime.lastError) {
-            console.warn(
-              "[EVD][HISTORY] Error sending retry message:",
-              chrome.runtime.lastError.message
-            );
-          } else {
-            // Retry download initiated
-            // Optionally, provide feedback to the user in the popup
-          }
-        }
-      );
-    });
+    retryButton.addEventListener("click", (e) => {});
 
     const deleteButton = document.createElement("button");

[NoCoverage] StringLiteral
extension/src/history.ts:155:17
       // Retry clicked for item
       chrome.runtime.sendMessage(
         {
-          type: "downloadVideo", // Changed action to type
+          type: "", // Changed action to type
           url: item.url,
           filename: item.filename,

[NoCoverage] ConditionalExpression
extension/src/history.ts:158:23
           type: "downloadVideo", // Changed action to type
           url: item.url,
           filename: item.filename,
-          page_title: item.page_title || document.title, // Fallback for page_title
+          page_title: true, // Fallback for page_title
           // id: item.id // Optionally pass original ID if server needs to link them
         },

[NoCoverage] LogicalOperator
extension/src/history.ts:158:23
           type: "downloadVideo", // Changed action to type
           url: item.url,
           filename: item.filename,
-          page_title: item.page_title || document.title, // Fallback for page_title
+          page_title: item.page_title && document.title, // Fallback for page_title
           // id: item.id // Optionally pass original ID if server needs to link them
         },

[NoCoverage] BlockStatement
extension/src/history.ts:161:23
           page_title: item.page_title || document.title, // Fallback for page_title
           // id: item.id // Optionally pass original ID if server needs to link them
         },
-        (response) => {
-          if (chrome.runtime.lastError) {
-            console.warn(
-              "[EVD][HISTORY] Error sending retry message:",
-              chrome.runtime.lastError.message
-            );
-          } else {
-            // Retry download initiated
-            // Optionally, provide feedback to the user in the popup
-          }
-        }
+        (response) => {}
       );
     });

[NoCoverage] ConditionalExpression
extension/src/history.ts:162:15
           // id: item.id // Optionally pass original ID if server needs to link them
         },
         (response) => {
-          if (chrome.runtime.lastError) {
+          if (false) {
             console.warn(
               "[EVD][HISTORY] Error sending retry message:",

[Killed] StringLiteral
extension/src/history.ts:175:49
       );
     });
 
-    const deleteButton = document.createElement("button");
+    const deleteButton = document.createElement("");
     deleteButton.className = "btn btn--secondary delete-btn";
     deleteButton.textContent = "Delete";
killedBy: renderHistoryItems renders history items and pagination correctly
statusReason: InvalidCharacterError: "" did not match the Name production

[NoCoverage] BlockStatement
extension/src/history.ts:179:57
     deleteButton.className = "btn btn--secondary delete-btn";
     deleteButton.textContent = "Delete";
     deleteButton.title = "Remove from history";
-    deleteButton.addEventListener("click", async (e) => {
-      e.stopPropagation();
-      if (!item.id) return;
-      // Delete clicked for item
-      try {
-        await removeHistoryItemAndNotify(item.id);
-        // The historyUpdated message from removeHistoryItemAndNotify will trigger a re-render
-      } catch (error) {
-        console.error(
-          "[EVD][HISTORY] Failed to delete history item from UI action:",
-          error
-        );
-      }
-    });
+    deleteButton.addEventListener("click", async (e) => {});
 
     actionsWrapper.appendChild(retryButton);

[NoCoverage] BooleanLiteral
extension/src/history.ts:181:11
     deleteButton.title = "Remove from history";
     deleteButton.addEventListener("click", async (e) => {
       e.stopPropagation();
-      if (!item.id) return;
+      if (item.id) return;
       // Delete clicked for item
       try {

[NoCoverage] ConditionalExpression
extension/src/history.ts:181:11
     deleteButton.title = "Remove from history";
     deleteButton.addEventListener("click", async (e) => {
       e.stopPropagation();
-      if (!item.id) return;
+      if (false) return;
       // Delete clicked for item
       try {

[NoCoverage] BlockStatement
extension/src/history.ts:183:11
       e.stopPropagation();
       if (!item.id) return;
       // Delete clicked for item
-      try {
-        await removeHistoryItemAndNotify(item.id);
-        // The historyUpdated message from removeHistoryItemAndNotify will trigger a re-render
-      } catch (error) {
+      try {} catch (error) {
         console.error(
           "[EVD][HISTORY] Failed to delete history item from UI action:",

[NoCoverage] BlockStatement
extension/src/history.ts:186:23
       try {
         await removeHistoryItemAndNotify(item.id);
         // The historyUpdated message from removeHistoryItemAndNotify will trigger a re-render
-      } catch (error) {
-        console.error(
-          "[EVD][HISTORY] Failed to delete history item from UI action:",
-          error
-        );
-      }
+      } catch (error) {}
     });
 

[Killed] ConditionalExpression
extension/src/history.ts:202:9
     li.appendChild(statusDiv);
     li.appendChild(actionsWrapper);
 
-    if (item.detail) {
+    if (false) {
       const detailDiv = document.createElement("div");
       const detailSpan = document.createElement("span");
killedBy: renderHistoryItems renders items with missing optional fields correctly
statusReason: TypeError: Cannot read properties of null (reading 'textContent')

[Survived] ConditionalExpression
extension/src/history.ts:202:9
     li.appendChild(statusDiv);
     li.appendChild(actionsWrapper);
 
-    if (item.detail) {
+    if (true) {
       const detailDiv = document.createElement("div");
       const detailSpan = document.createElement("span");

[Killed] StringLiteral
extension/src/history.ts:203:48
     li.appendChild(actionsWrapper);
 
     if (item.detail) {
-      const detailDiv = document.createElement("div");
+      const detailDiv = document.createElement("");
       const detailSpan = document.createElement("span");
       detailSpan.className = "history-item-detail";
killedBy: renderHistoryItems renders history items and pagination correctly
statusReason: InvalidCharacterError: "" did not match the Name production

[Killed] StringLiteral
extension/src/history.ts:204:49
 
     if (item.detail) {
       const detailDiv = document.createElement("div");
-      const detailSpan = document.createElement("span");
+      const detailSpan = document.createElement("");
       detailSpan.className = "history-item-detail";
       // If detail is an array, join it. Otherwise, display as is.
killedBy: renderHistoryItems renders history items and pagination correctly
statusReason: InvalidCharacterError: "" did not match the Name production

[Survived] StringLiteral
extension/src/history.ts:208:28
       detailSpan.className = "history-item-detail";
       // If detail is an array, join it. Otherwise, display as is.
       detailSpan.textContent = Array.isArray(item.detail)
-        ? item.detail.join(", ")
+        ? item.detail.join("")
         : item.detail;
       detailDiv.appendChild(document.createTextNode("Detail: "));

[Survived] StringLiteral
extension/src/history.ts:210:53
       detailSpan.textContent = Array.isArray(item.detail)
         ? item.detail.join(", ")
         : item.detail;
-      detailDiv.appendChild(document.createTextNode("Detail: "));
+      detailDiv.appendChild(document.createTextNode(""));
       detailDiv.appendChild(detailSpan);
       li.appendChild(detailDiv);

[Survived] ConditionalExpression
extension/src/history.ts:215:9
       li.appendChild(detailDiv);
     }
 
-    if (item.error) {
+    if (false) {
       const errorDiv = document.createElement("div");
       errorDiv.className = "history-item-error";

[Survived] BlockStatement
extension/src/history.ts:215:21
       li.appendChild(detailDiv);
     }
 
-    if (item.error) {
-      const errorDiv = document.createElement("div");
-      errorDiv.className = "history-item-error";
-      errorDiv.textContent = "Error: " + item.error;
-      li.appendChild(errorDiv);
-    }
+    if (item.error) {}
 
     if (item.url) {

[Timeout] ConditionalExpression
extension/src/history.ts:222:9
       li.appendChild(errorDiv);
     }
 
-    if (item.url) {
+    if (false) {
       const urlDiv = document.createElement("div");
       urlDiv.className = "history-item-url";

[Timeout] BlockStatement
extension/src/history.ts:222:19
       li.appendChild(errorDiv);
     }
 
-    if (item.url) {
-      const urlDiv = document.createElement("div");
-      urlDiv.className = "history-item-url";
-      const urlLink = document.createElement("a");
-      urlLink.href = item.url;
-      urlLink.target = "_blank";
-      urlLink.textContent = item.url;
-      urlDiv.appendChild(document.createTextNode("URL: "));
-      urlDiv.appendChild(urlLink);
-      li.appendChild(urlDiv);
-    }
+    if (item.url) {}
     historyListElement.appendChild(li);
   });
