[Killed] BlockStatement
extension/src/history.ts:237:62
   });
 
   // Update pagination UI if provided
-  if (pageInfoElement && pageInfoElement instanceof Element) {
-    // Handle the case where totalItems is 0 but we still have items (edge case)
-    const actualTotal = totalItems || historyItems.length;
-
-    if (actualTotal === 0) {
-      pageInfoElement.textContent = "No items";
-    } else {
-      const startItem = Math.min((page - 1) * perPage + 1, actualTotal);
-      const endItem = Math.min(page * perPage, actualTotal);
-      pageInfoElement.textContent =
-        "Showing " +
-        startItem +
-        "-" +
-        endItem +
-        " of " +
-        actualTotal +
-        " items";
-    }
-  }
+  if (pageInfoElement && pageInfoElement instanceof Element) {}
 
   // Update pagination button states
killedBy: renderHistoryItems renders history items and pagination correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Showing 1-2 of 2 items"
Received: ""

[Killed] ConditionalExpression
extension/src/history.ts:239:25
   // Update pagination UI if provided
   if (pageInfoElement && pageInfoElement instanceof Element) {
     // Handle the case where totalItems is 0 but we still have items (edge case)
-    const actualTotal = totalItems || historyItems.length;
+    const actualTotal = false;
 
     if (actualTotal === 0) {
killedBy: renderHistoryItems renders history items and pagination correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Showing 1-2 of 2 items"
Received: "Showing 0-0 of false items"

[Killed] ConditionalExpression
extension/src/history.ts:239:25
   // Update pagination UI if provided
   if (pageInfoElement && pageInfoElement instanceof Element) {
     // Handle the case where totalItems is 0 but we still have items (edge case)
-    const actualTotal = totalItems || historyItems.length;
+    const actualTotal = true;
 
     if (actualTotal === 0) {
killedBy: renderHistoryItems renders history items and pagination correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Showing 1-2 of 2 items"
Received: "Showing 1-1 of true items"

[Killed] EqualityOperator
extension/src/history.ts:241:9
     // Handle the case where totalItems is 0 but we still have items (edge case)
     const actualTotal = totalItems || historyItems.length;
 
-    if (actualTotal === 0) {
+    if (actualTotal !== 0) {
       pageInfoElement.textContent = "No items";
     } else {
killedBy: renderHistoryItems renders history items and pagination correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Showing 1-2 of 2 items"
Received: "No items"

[Killed] ConditionalExpression
extension/src/history.ts:241:9
     // Handle the case where totalItems is 0 but we still have items (edge case)
     const actualTotal = totalItems || historyItems.length;
 
-    if (actualTotal === 0) {
+    if (true) {
       pageInfoElement.textContent = "No items";
     } else {
killedBy: renderHistoryItems renders history items and pagination correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Showing 1-2 of 2 items"
Received: "No items"

[Killed] BlockStatement
extension/src/history.ts:243:12
 
     if (actualTotal === 0) {
       pageInfoElement.textContent = "No items";
-    } else {
-      const startItem = Math.min((page - 1) * perPage + 1, actualTotal);
-      const endItem = Math.min(page * perPage, actualTotal);
-      pageInfoElement.textContent =
-        "Showing " +
-        startItem +
-        "-" +
-        endItem +
-        " of " +
-        actualTotal +
-        " items";
-    }
+    } else {}
   }
 
killedBy: renderHistoryItems renders history items and pagination correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Showing 1-2 of 2 items"
Received: ""

[Killed] ArithmeticOperator
extension/src/history.ts:244:34
     if (actualTotal === 0) {
       pageInfoElement.textContent = "No items";
     } else {
-      const startItem = Math.min((page - 1) * perPage + 1, actualTotal);
+      const startItem = Math.min((page - 1) * perPage - 1, actualTotal);
       const endItem = Math.min(page * perPage, actualTotal);
       pageInfoElement.textContent =
killedBy: renderHistoryItems renders history items and pagination correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Showing 1-2 of 2 items"
Received: "Showing -1-2 of 2 items"

[Killed] MethodExpression
extension/src/history.ts:244:25
     if (actualTotal === 0) {
       pageInfoElement.textContent = "No items";
     } else {
-      const startItem = Math.min((page - 1) * perPage + 1, actualTotal);
+      const startItem = Math.max((page - 1) * perPage + 1, actualTotal);
       const endItem = Math.min(page * perPage, actualTotal);
       pageInfoElement.textContent =
killedBy: renderHistoryItems renders history items and pagination correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Showing 1-2 of 2 items"
Received: "Showing 2-2 of 2 items"

[Killed] ArithmeticOperator
extension/src/history.ts:245:32
       pageInfoElement.textContent = "No items";
     } else {
       const startItem = Math.min((page - 1) * perPage + 1, actualTotal);
-      const endItem = Math.min(page * perPage, actualTotal);
+      const endItem = Math.min(page / perPage, actualTotal);
       pageInfoElement.textContent =
         "Showing " +
killedBy: renderHistoryItems renders history items and pagination correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Showing 1-2 of 2 items"
Received: "Showing 1-0.5 of 2 items"

[Survived] MethodExpression
extension/src/history.ts:245:23
       pageInfoElement.textContent = "No items";
     } else {
       const startItem = Math.min((page - 1) * perPage + 1, actualTotal);
-      const endItem = Math.min(page * perPage, actualTotal);
+      const endItem = Math.max(page * perPage, actualTotal);
       pageInfoElement.textContent =
         "Showing " +

[Killed] StringLiteral
extension/src/history.ts:249:9
       pageInfoElement.textContent =
         "Showing " +
         startItem +
-        "-" +
+        "" +
         endItem +
         " of " +
killedBy: renderHistoryItems renders history items and pagination correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Showing 1-2 of 2 items"
Received: "Showing 12 of 2 items"

[Killed] StringLiteral
extension/src/history.ts:253:9
         endItem +
         " of " +
         actualTotal +
-        " items";
+        "";
     }
   }
killedBy: renderHistoryItems renders history items and pagination correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Showing 1-2 of 2 items"
Received: "Showing 1-2 of 2"

[Killed] ConditionalExpression
extension/src/history.ts:258:7
   }
 
   // Update pagination button states
-  if (prevPageBtn && prevPageBtn instanceof Element) {
+  if (true) {
     prevPageBtn.disabled = page <= 1;
   }
killedBy: history.ts core functions renderHistoryItems renders list of items
statusReason: TypeError: Cannot set properties of undefined (setting 'disabled')

[Killed] ConditionalExpression
extension/src/history.ts:258:7
   }
 
   // Update pagination button states
-  if (prevPageBtn && prevPageBtn instanceof Element) {
+  if (false) {
     prevPageBtn.disabled = page <= 1;
   }
killedBy: renderHistoryItems renders history items and pagination correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Timeout] EqualityOperator
extension/src/history.ts:259:28
 
   // Update pagination button states
   if (prevPageBtn && prevPageBtn instanceof Element) {
-    prevPageBtn.disabled = page <= 1;
+    prevPageBtn.disabled = page > 1;
   }
 

[Timeout] EqualityOperator
extension/src/history.ts:259:28
 
   // Update pagination button states
   if (prevPageBtn && prevPageBtn instanceof Element) {
-    prevPageBtn.disabled = page <= 1;
+    prevPageBtn.disabled = page < 1;
   }
 

[Timeout] ConditionalExpression
extension/src/history.ts:262:7
     prevPageBtn.disabled = page <= 1;
   }
 
-  if (nextPageBtn && nextPageBtn instanceof Element) {
+  if (true) {
     // If totalItems is 0 but we have items, calculate based on items length
     const actualTotal = totalItems || historyItems.length;

[Timeout] ConditionalExpression
extension/src/history.ts:264:25
 
   if (nextPageBtn && nextPageBtn instanceof Element) {
     // If totalItems is 0 but we have items, calculate based on items length
-    const actualTotal = totalItems || historyItems.length;
+    const actualTotal = true;
     nextPageBtn.disabled = page * perPage >= actualTotal;
   }

[Timeout] LogicalOperator
extension/src/history.ts:264:25
 
   if (nextPageBtn && nextPageBtn instanceof Element) {
     // If totalItems is 0 but we have items, calculate based on items length
-    const actualTotal = totalItems || historyItems.length;
+    const actualTotal = totalItems && historyItems.length;
     nextPageBtn.disabled = page * perPage >= actualTotal;
   }

[Timeout] ArithmeticOperator
extension/src/history.ts:265:28
   if (nextPageBtn && nextPageBtn instanceof Element) {
     // If totalItems is 0 but we have items, calculate based on items length
     const actualTotal = totalItems || historyItems.length;
-    nextPageBtn.disabled = page * perPage >= actualTotal;
+    nextPageBtn.disabled = page / perPage >= actualTotal;
   }
 }

[Timeout] ConditionalExpression
extension/src/history.ts:265:28
   if (nextPageBtn && nextPageBtn instanceof Element) {
     // If totalItems is 0 but we have items, calculate based on items length
     const actualTotal = totalItems || historyItems.length;
-    nextPageBtn.disabled = page * perPage >= actualTotal;
+    nextPageBtn.disabled = true;
   }
 }

[Timeout] ObjectLiteral
extension/src/history.ts:275:20
  * @returns Promise resolving when entry is saved
  */
 export async function addToHistory(entry: HistoryEntry): Promise<void> {
-  const newEntry = {
-    ...entry,
-    id: entry.id || crypto.randomUUID(),
-    timestamp: entry.timestamp || Date.now(),
-  };
+  const newEntry = {};
 
   return new Promise((resolve, reject) => {

[Timeout] ConditionalExpression
extension/src/history.ts:277:9
 export async function addToHistory(entry: HistoryEntry): Promise<void> {
   const newEntry = {
     ...entry,
-    id: entry.id || crypto.randomUUID(),
+    id: false,
     timestamp: entry.timestamp || Date.now(),
   };

[Timeout] ConditionalExpression
extension/src/history.ts:277:9
 export async function addToHistory(entry: HistoryEntry): Promise<void> {
   const newEntry = {
     ...entry,
-    id: entry.id || crypto.randomUUID(),
+    id: true,
     timestamp: entry.timestamp || Date.now(),
   };

[Timeout] ConditionalExpression
extension/src/history.ts:278:16
   const newEntry = {
     ...entry,
     id: entry.id || crypto.randomUUID(),
-    timestamp: entry.timestamp || Date.now(),
+    timestamp: false,
   };
 

[Timeout] ConditionalExpression
extension/src/history.ts:278:16
   const newEntry = {
     ...entry,
     id: entry.id || crypto.randomUUID(),
-    timestamp: entry.timestamp || Date.now(),
+    timestamp: true,
   };
 

[Timeout] BlockStatement
extension/src/history.ts:282:71
   };
 
   return new Promise((resolve, reject) => {
-    chrome.storage.local.get({ [historyStorageKey]: [] }, (result) => {
-      if (chrome.runtime.lastError) {
-        console.warn(
-          "[EVD][HISTORY] Warning fetching existing history:",
-          chrome.runtime.lastError.message
-        );
-      }
-
-      const history = (result && result[historyStorageKey]) || [];
-      history.unshift(newEntry);
-
-      chrome.storage.local.set({ [historyStorageKey]: history }, () => {
-        if (chrome.runtime.lastError) {
-          console.warn(
-            "[EVD][HISTORY] Warning adding to history:",
-            chrome.runtime.lastError.message
-          );
-          // Swallow storage.set errors to prevent breaking functionality
-          resolve();
-          return;
-        }
-        // Added to history
-        resolve();
-      });
-    });
+    chrome.storage.local.get({ [historyStorageKey]: [] }, (result) => {});
   });
 }

[Timeout] ObjectLiteral
extension/src/history.ts:282:30
   };
 
   return new Promise((resolve, reject) => {
-    chrome.storage.local.get({ [historyStorageKey]: [] }, (result) => {
+    chrome.storage.local.get({}, (result) => {
       if (chrome.runtime.lastError) {
         console.warn(

[Timeout] BlockStatement
extension/src/history.ts:283:37
 
   return new Promise((resolve, reject) => {
     chrome.storage.local.get({ [historyStorageKey]: [] }, (result) => {
-      if (chrome.runtime.lastError) {
-        console.warn(
-          "[EVD][HISTORY] Warning fetching existing history:",
-          chrome.runtime.lastError.message
-        );
-      }
+      if (chrome.runtime.lastError) {}
 
       const history = (result && result[historyStorageKey]) || [];

[Timeout] ConditionalExpression
extension/src/history.ts:290:23
         );
       }
 
-      const history = (result && result[historyStorageKey]) || [];
+      const history = false;
       history.unshift(newEntry);
 

[Timeout] LogicalOperator
extension/src/history.ts:290:24
         );
       }
 
-      const history = (result && result[historyStorageKey]) || [];
+      const history = (result || result[historyStorageKey]) || [];
       history.unshift(newEntry);
 

[Timeout] BlockStatement
extension/src/history.ts:293:72
       const history = (result && result[historyStorageKey]) || [];
       history.unshift(newEntry);
 
-      chrome.storage.local.set({ [historyStorageKey]: history }, () => {
-        if (chrome.runtime.lastError) {
-          console.warn(
-            "[EVD][HISTORY] Warning adding to history:",
-            chrome.runtime.lastError.message
-          );
-          // Swallow storage.set errors to prevent breaking functionality
-          resolve();
-          return;
-        }
-        // Added to history
-        resolve();
-      });
+      chrome.storage.local.set({ [historyStorageKey]: history }, () => {});
     });
   });

[Timeout] ObjectLiteral
extension/src/history.ts:293:32
       const history = (result && result[historyStorageKey]) || [];
       history.unshift(newEntry);
 
-      chrome.storage.local.set({ [historyStorageKey]: history }, () => {
+      chrome.storage.local.set({}, () => {
         if (chrome.runtime.lastError) {
           console.warn(

[Timeout] BlockStatement
extension/src/history.ts:294:39
       history.unshift(newEntry);
 
       chrome.storage.local.set({ [historyStorageKey]: history }, () => {
-        if (chrome.runtime.lastError) {
-          console.warn(
-            "[EVD][HISTORY] Warning adding to history:",
-            chrome.runtime.lastError.message
-          );
-          // Swallow storage.set errors to prevent breaking functionality
-          resolve();
-          return;
-        }
+        if (chrome.runtime.lastError) {}
         // Added to history
         resolve();

[Timeout] ConditionalExpression
extension/src/history.ts:294:13
       history.unshift(newEntry);
 
       chrome.storage.local.set({ [historyStorageKey]: history }, () => {
-        if (chrome.runtime.lastError) {
+        if (true) {
           console.warn(
             "[EVD][HISTORY] Warning adding to history:",

[Timeout] BlockStatement
extension/src/history.ts:314:53
  * Clears all download history
  * @returns Promise resolving when history is cleared
  */
-export async function clearHistory(): Promise<void> {
-  return new Promise((resolve, reject) => {
-    chrome.storage.local.set({ [historyStorageKey]: [] }, () => {
-      if (chrome.runtime.lastError) {
-        console.error(
-          "[EVD][HISTORY] Error clearing history:",
-          chrome.runtime.lastError.message
-        );
-        reject(new Error(chrome.runtime.lastError.message));
-      } else {
-        // History cleared
-        resolve();
-      }
-    });
-  });
-}
+export async function clearHistory(): Promise<void> {}
 
 /**

[Timeout] BlockStatement
extension/src/history.ts:315:43
  * @returns Promise resolving when history is cleared
  */
 export async function clearHistory(): Promise<void> {
-  return new Promise((resolve, reject) => {
-    chrome.storage.local.set({ [historyStorageKey]: [] }, () => {
-      if (chrome.runtime.lastError) {
-        console.error(
-          "[EVD][HISTORY] Error clearing history:",
-          chrome.runtime.lastError.message
-        );
-        reject(new Error(chrome.runtime.lastError.message));
-      } else {
-        // History cleared
-        resolve();
-      }
-    });
-  });
+  return new Promise((resolve, reject) => {});
 }
 

[Timeout] BlockStatement
extension/src/history.ts:316:65
  */
 export async function clearHistory(): Promise<void> {
   return new Promise((resolve, reject) => {
-    chrome.storage.local.set({ [historyStorageKey]: [] }, () => {
-      if (chrome.runtime.lastError) {
-        console.error(
-          "[EVD][HISTORY] Error clearing history:",
-          chrome.runtime.lastError.message
-        );
-        reject(new Error(chrome.runtime.lastError.message));
-      } else {
-        // History cleared
-        resolve();
-      }
-    });
+    chrome.storage.local.set({ [historyStorageKey]: [] }, () => {});
   });
 }

[Timeout] ConditionalExpression
extension/src/history.ts:317:11
 export async function clearHistory(): Promise<void> {
   return new Promise((resolve, reject) => {
     chrome.storage.local.set({ [historyStorageKey]: [] }, () => {
-      if (chrome.runtime.lastError) {
+      if (false) {
         console.error(
           "[EVD][HISTORY] Error clearing history:",

[Timeout] ConditionalExpression
extension/src/history.ts:317:11
 export async function clearHistory(): Promise<void> {
   return new Promise((resolve, reject) => {
     chrome.storage.local.set({ [historyStorageKey]: [] }, () => {
-      if (chrome.runtime.lastError) {
+      if (true) {
         console.error(
           "[EVD][HISTORY] Error clearing history:",

[Timeout] BlockStatement
extension/src/history.ts:323:14
           chrome.runtime.lastError.message
         );
         reject(new Error(chrome.runtime.lastError.message));
-      } else {
-        // History cleared
-        resolve();
-      }
+      } else {}
     });
   });

[Killed] BlockStatement
extension/src/history.ts:335:62
  * Clears the entire history and notifies other parts of the extension.
  * @returns Promise resolving to void
  */
-export async function clearHistoryAndNotify(): Promise<void> {
-  await clearHistory();
-  chrome.runtime.sendMessage({ type: "historyUpdated" });
-}
+export async function clearHistoryAndNotify(): Promise<void> {}
 
 /**
killedBy: history module clearHistoryAndNotify clears history and sends a notification
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"downloadHistory": []}, Any<Function>

Number of calls: 0

[Killed] BooleanLiteral
extension/src/history.ts:348:7
 export async function removeHistoryItem(
   itemId?: string | number
 ): Promise<void> {
-  if (!itemId) {
+  if (itemId) {
     console.warn("[EVD][HISTORY] No item ID provided for removal.");
     return Promise.resolve();
killedBy: history module removeHistoryItem removes an item from history
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"downloadHistory": [{"detail": "", "error": "", "filename": "a", "id": "keep", "page_title": "a", "status": "completed", "timestamp": "1", "url": "http://keep.com"}]}, Any<Function>

Number of calls: 0

[Killed] ConditionalExpression
extension/src/history.ts:348:7
 export async function removeHistoryItem(
   itemId?: string | number
 ): Promise<void> {
-  if (!itemId) {
+  if (false) {
     console.warn("[EVD][HISTORY] No item ID provided for removal.");
     return Promise.resolve();
killedBy: history module removeHistoryItem does nothing when no id provided
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

[Timeout] StringLiteral
extension/src/history.ts:349:18
   itemId?: string | number
 ): Promise<void> {
   if (!itemId) {
-    console.warn("[EVD][HISTORY] No item ID provided for removal.");
+    console.warn("");
     return Promise.resolve();
   }

[Timeout] BlockStatement
extension/src/history.ts:353:43
     return Promise.resolve();
   }
 
-  return new Promise((resolve, reject) => {
-    // Note: We can't use fetchHistory here as it now rejects on error.
-    chrome.storage.local.get({ [historyStorageKey]: [] }, (result) => {
-      if (chrome.runtime.lastError) {
-        return reject(new Error(chrome.runtime.lastError.message));
-      }
-
-      const history = result[historyStorageKey] || [];
-      const newHistory = history.filter(
-        (item: HistoryEntry) => item.id !== itemId
-      );
-
-      chrome.storage.local.set({ [historyStorageKey]: newHistory }, () => {
-        if (chrome.runtime.lastError) {
-          console.error(
-            "[EVD][HISTORY] Error removing item from history:",
-            chrome.runtime.lastError.message
-          );
-          return reject(new Error(chrome.runtime.lastError.message));
-        }
-        // Removed item from history
-        resolve();
-      });
-    });
-  });
+  return new Promise((resolve, reject) => {});
 }
 

[Timeout] BlockStatement
extension/src/history.ts:355:71
 
   return new Promise((resolve, reject) => {
     // Note: We can't use fetchHistory here as it now rejects on error.
-    chrome.storage.local.get({ [historyStorageKey]: [] }, (result) => {
-      if (chrome.runtime.lastError) {
-        return reject(new Error(chrome.runtime.lastError.message));
-      }
-
-      const history = result[historyStorageKey] || [];
-      const newHistory = history.filter(
-        (item: HistoryEntry) => item.id !== itemId
-      );
-
-      chrome.storage.local.set({ [historyStorageKey]: newHistory }, () => {
-        if (chrome.runtime.lastError) {
-          console.error(
-            "[EVD][HISTORY] Error removing item from history:",
-            chrome.runtime.lastError.message
-          );
-          return reject(new Error(chrome.runtime.lastError.message));
-        }
-        // Removed item from history
-        resolve();
-      });
-    });
+    chrome.storage.local.get({ [historyStorageKey]: [] }, (result) => {});
   });
 }

[Survived] ObjectLiteral
extension/src/history.ts:355:30
 
   return new Promise((resolve, reject) => {
     // Note: We can't use fetchHistory here as it now rejects on error.
-    chrome.storage.local.get({ [historyStorageKey]: [] }, (result) => {
+    chrome.storage.local.get({}, (result) => {
       if (chrome.runtime.lastError) {
         return reject(new Error(chrome.runtime.lastError.message));

[Killed] ConditionalExpression
extension/src/history.ts:356:11
   return new Promise((resolve, reject) => {
     // Note: We can't use fetchHistory here as it now rejects on error.
     chrome.storage.local.get({ [historyStorageKey]: [] }, (result) => {
-      if (chrome.runtime.lastError) {
+      if (true) {
         return reject(new Error(chrome.runtime.lastError.message));
       }
killedBy: history module removeHistoryItem removes an item from history
statusReason: TypeError: Cannot read properties of null (reading 'message')

[Survived] BlockStatement
extension/src/history.ts:356:37
   return new Promise((resolve, reject) => {
     // Note: We can't use fetchHistory here as it now rejects on error.
     chrome.storage.local.get({ [historyStorageKey]: [] }, (result) => {
-      if (chrome.runtime.lastError) {
-        return reject(new Error(chrome.runtime.lastError.message));
-      }
+      if (chrome.runtime.lastError) {}
 
       const history = result[historyStorageKey] || [];

[Killed] ConditionalExpression
extension/src/history.ts:360:23
         return reject(new Error(chrome.runtime.lastError.message));
       }
 
-      const history = result[historyStorageKey] || [];
+      const history = false;
       const newHistory = history.filter(
         (item: HistoryEntry) => item.id !== itemId
killedBy: history module removeHistoryItem removes an item from history
statusReason: TypeError: history.filter is not a function

[Killed] LogicalOperator
extension/src/history.ts:360:23
         return reject(new Error(chrome.runtime.lastError.message));
       }
 
-      const history = result[historyStorageKey] || [];
+      const history = result[historyStorageKey] && [];
       const newHistory = history.filter(
         (item: HistoryEntry) => item.id !== itemId
killedBy: history module removeHistoryItem removes an item from history
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "downloadHistory": Array [
-     Object {

[Killed] MethodExpression
extension/src/history.ts:361:26
       }
 
       const history = result[historyStorageKey] || [];
-      const newHistory = history.filter(
-        (item: HistoryEntry) => item.id !== itemId
-      );
+      const newHistory = history;
 
       chrome.storage.local.set({ [historyStorageKey]: newHistory }, () => {
killedBy: history module removeHistoryItem removes an item from history
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -8,7 +8,17 @@
        "page_title": "a",
        "status": "completed",

[Killed] EqualityOperator
extension/src/history.ts:362:33
 
       const history = result[historyStorageKey] || [];
       const newHistory = history.filter(
-        (item: HistoryEntry) => item.id !== itemId
+        (item: HistoryEntry) => item.id === itemId
       );
 
killedBy: history module removeHistoryItem removes an item from history
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "downloadHistory": Array [
      Object {

[Killed] ConditionalExpression
extension/src/history.ts:362:33
 
       const history = result[historyStorageKey] || [];
       const newHistory = history.filter(
-        (item: HistoryEntry) => item.id !== itemId
+        (item: HistoryEntry) => true
       );
 
killedBy: history module removeHistoryItem removes an item from history
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -8,7 +8,17 @@
        "page_title": "a",
        "status": "completed",

[Timeout] BlockStatement
extension/src/history.ts:365:75
         (item: HistoryEntry) => item.id !== itemId
       );
 
-      chrome.storage.local.set({ [historyStorageKey]: newHistory }, () => {
-        if (chrome.runtime.lastError) {
-          console.error(
-            "[EVD][HISTORY] Error removing item from history:",
-            chrome.runtime.lastError.message
-          );
-          return reject(new Error(chrome.runtime.lastError.message));
-        }
-        // Removed item from history
-        resolve();
-      });
+      chrome.storage.local.set({ [historyStorageKey]: newHistory }, () => {});
     });
   });

[Killed] ConditionalExpression
extension/src/history.ts:366:13
       );
 
       chrome.storage.local.set({ [historyStorageKey]: newHistory }, () => {
-        if (chrome.runtime.lastError) {
+        if (true) {
           console.error(
             "[EVD][HISTORY] Error removing item from history:",
killedBy: history module removeHistoryItem removes an item from history
statusReason: TypeError: Cannot read properties of null (reading 'message')

[NoCoverage] BlockStatement
extension/src/history.ts:366:39
       );
 
       chrome.storage.local.set({ [historyStorageKey]: newHistory }, () => {
-        if (chrome.runtime.lastError) {
-          console.error(
-            "[EVD][HISTORY] Error removing item from history:",
-            chrome.runtime.lastError.message
-          );
-          return reject(new Error(chrome.runtime.lastError.message));
-        }
+        if (chrome.runtime.lastError) {}
         // Removed item from history
         resolve();

[NoCoverage] StringLiteral
extension/src/history.ts:368:13
       chrome.storage.local.set({ [historyStorageKey]: newHistory }, () => {
         if (chrome.runtime.lastError) {
           console.error(
-            "[EVD][HISTORY] Error removing item from history:",
+            "",
             chrome.runtime.lastError.message
           );

[Killed] BlockStatement
extension/src/history.ts:387:18
  */
 export async function removeHistoryItemAndNotify(
   itemId?: string | number
-): Promise<void> {
-  await removeHistoryItem(itemId);
-  chrome.runtime.sendMessage({ type: "historyUpdated" });
-}
+): Promise<void> {}
 
 /**
killedBy: history module removeHistoryItemAndNotify removes item and sends a notification
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"downloadHistory": [{"id": "another-id", "timestamp": 2}]}, Any<Function>

Number of calls: 0

[Killed] ObjectLiteral
extension/src/history.ts:389:30
   itemId?: string | number
 ): Promise<void> {
   await removeHistoryItem(itemId);
-  chrome.runtime.sendMessage({ type: "historyUpdated" });
+  chrome.runtime.sendMessage({});
 }
 
killedBy: history module removeHistoryItemAndNotify removes item and sends a notification
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "type": "historyUpdated",
- }
