[NoCoverage] BlockStatement
extension/src/history.ts:397:49
  * @param name - Filename to sanitize
  * @returns Sanitized filename
  */
-function sanitizeFilename(name: string): string {
-  // Remove invalid characters for filenames
-  return name
-    .replace(/[/\\?%*:|"<>]/g, "-") // Replace invalid chars with dash
-    .replace(/\s+/g, "_") // Replace spaces with underscore
-    .replace(/^\.+/, "") // Remove leading dots
-    .trim();
-}
+function sanitizeFilename(name: string): string {}
 
 // Export for testing (these are already exported above)

[NoCoverage] MethodExpression
extension/src/history.ts:399:10
  */
 function sanitizeFilename(name: string): string {
   // Remove invalid characters for filenames
-  return name
-    .replace(/[/\\?%*:|"<>]/g, "-") // Replace invalid chars with dash
-    .replace(/\s+/g, "_") // Replace spaces with underscore
-    .replace(/^\.+/, "") // Remove leading dots
-    .trim();
+  return name.replace(/[/\\?%*:|"<>]/g, "-") // Replace invalid chars with dash
+.replace(/\s+/g, "_") // Replace spaces with underscore
+.replace(/^\.+/, "") // Remove leading dots;
 }
 

[NoCoverage] StringLiteral
extension/src/history.ts:400:32
 function sanitizeFilename(name: string): string {
   // Remove invalid characters for filenames
   return name
-    .replace(/[/\\?%*:|"<>]/g, "-") // Replace invalid chars with dash
+    .replace(/[/\\?%*:|"<>]/g, "") // Replace invalid chars with dash
     .replace(/\s+/g, "_") // Replace spaces with underscore
     .replace(/^\.+/, "") // Remove leading dots

[NoCoverage] StringLiteral
extension/src/history.ts:402:22
   return name
     .replace(/[/\\?%*:|"<>]/g, "-") // Replace invalid chars with dash
     .replace(/\s+/g, "_") // Replace spaces with underscore
-    .replace(/^\.+/, "") // Remove leading dots
+    .replace(/^\.+/, "Stryker was here!") // Remove leading dots
     .trim();
 }
