[Killed] BlockStatement
extension/src/lib/utils.ts:18:37
 export function debounce<T extends (...args: any[]) => any>(
   func: T,
   delay: number
-): (...args: Parameters<T>) => void {
-  let timeout: number | undefined;
-
-  return function (this: ThisParameterType<T>, ...args: Parameters<T>) {
-    clearTimeout(timeout);
-    timeout = window.setTimeout(() => func.apply(this, args), delay);
-  };
-}
+): (...args: Parameters<T>) => void {}
 
 /**
killedBy: Content Script Tests Debounce Function should debounce function calls
statusReason: TypeError: debouncedFn is not a function

[Timeout] BlockStatement
extension/src/lib/utils.ts:21:72
 ): (...args: Parameters<T>) => void {
   let timeout: number | undefined;
 
-  return function (this: ThisParameterType<T>, ...args: Parameters<T>) {
-    clearTimeout(timeout);
-    timeout = window.setTimeout(() => func.apply(this, args), delay);
-  };
+  return function (this: ThisParameterType<T>, ...args: Parameters<T>) {};
 }
 

[Timeout] ArrowFunction
extension/src/lib/utils.ts:23:33
 
   return function (this: ThisParameterType<T>, ...args: Parameters<T>) {
     clearTimeout(timeout);
-    timeout = window.setTimeout(() => func.apply(this, args), delay);
+    timeout = window.setTimeout(() => undefined, delay);
   };
 }

[Killed] BlockStatement
extension/src/lib/utils.ts:36:34
    * Standard information logging with [EVD] prefix
    * @param args - Arguments to log
    */
-  log: (...args: any[]): void => {
-    try {
-      // Only log during tests when console.log is mocked (Jest)
-      if (typeof (console.log as any).mockImplementation === "function") {
-        console.log("[EVD]", ...args);
-      }
-    } catch {
-      // ignore logging errors
-    }
-  },
+  log: (...args: any[]): void => {},
 
   /**
killedBy: Utility functions logger should log with prefix when console.log is mocked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "[EVD]", "test message"

Number of calls: 0

[Killed] BlockStatement
extension/src/lib/utils.ts:37:9
    * @param args - Arguments to log
    */
   log: (...args: any[]): void => {
-    try {
-      // Only log during tests when console.log is mocked (Jest)
-      if (typeof (console.log as any).mockImplementation === "function") {
-        console.log("[EVD]", ...args);
-      }
-    } catch {
+    try {} catch {
       // ignore logging errors
     }
killedBy: Utility functions logger should log with prefix when console.log is mocked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "[EVD]", "test message"

Number of calls: 0

[Killed] EqualityOperator
extension/src/lib/utils.ts:39:11
   log: (...args: any[]): void => {
     try {
       // Only log during tests when console.log is mocked (Jest)
-      if (typeof (console.log as any).mockImplementation === "function") {
+      if (typeof (console.log as any).mockImplementation !== "function") {
         console.log("[EVD]", ...args);
       }
killedBy: Utility functions logger should log with prefix when console.log is mocked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "[EVD]", "test message"

Number of calls: 0

[Killed] BlockStatement
extension/src/lib/utils.ts:39:74
   log: (...args: any[]): void => {
     try {
       // Only log during tests when console.log is mocked (Jest)
-      if (typeof (console.log as any).mockImplementation === "function") {
-        console.log("[EVD]", ...args);
-      }
+      if (typeof (console.log as any).mockImplementation === "function") {}
     } catch {
       // ignore logging errors
killedBy: Utility functions logger should log with prefix when console.log is mocked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "[EVD]", "test message"

Number of calls: 0

[Killed] BlockStatement
extension/src/lib/utils.ts:51:35
    * Warning logging with [EVD Warning] prefix for potential issues
    * @param args - Arguments to log
    */
-  warn: (...args: any[]): void => {
-    try {
-      // Only warn during tests when console.warn is mocked (Jest)
-      if (typeof (console.warn as any).mockImplementation === "function") {
-        console.warn("[EVD Warning]", ...args);
-      }
-    } catch {
-      // ignore warning errors
-    }
-  },
+  warn: (...args: any[]): void => {},
 
   /**
killedBy: Utility functions logger should warn with prefix when console.warn is mocked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "[EVD Warning]", "warning message"

Number of calls: 0

[Killed] BlockStatement
extension/src/lib/utils.ts:52:9
    * @param args - Arguments to log
    */
   warn: (...args: any[]): void => {
-    try {
-      // Only warn during tests when console.warn is mocked (Jest)
-      if (typeof (console.warn as any).mockImplementation === "function") {
-        console.warn("[EVD Warning]", ...args);
-      }
-    } catch {
+    try {} catch {
       // ignore warning errors
     }
killedBy: Utility functions logger should warn with prefix when console.warn is mocked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "[EVD Warning]", "warning message"

Number of calls: 0

[Killed] EqualityOperator
extension/src/lib/utils.ts:54:11
   warn: (...args: any[]): void => {
     try {
       // Only warn during tests when console.warn is mocked (Jest)
-      if (typeof (console.warn as any).mockImplementation === "function") {
+      if (typeof (console.warn as any).mockImplementation !== "function") {
         console.warn("[EVD Warning]", ...args);
       }
killedBy: Utility functions logger should warn with prefix when console.warn is mocked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "[EVD Warning]", "warning message"

Number of calls: 0

[Killed] ConditionalExpression
extension/src/lib/utils.ts:54:11
   warn: (...args: any[]): void => {
     try {
       // Only warn during tests when console.warn is mocked (Jest)
-      if (typeof (console.warn as any).mockImplementation === "function") {
+      if (false) {
         console.warn("[EVD Warning]", ...args);
       }
killedBy: Utility functions logger should warn with prefix when console.warn is mocked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "[EVD Warning]", "warning message"

Number of calls: 0

[Killed] BlockStatement
extension/src/lib/utils.ts:66:36
    * Error logging with [EVD Error] prefix for critical issues
    * @param args - Arguments to log
    */
-  error: (...args: any[]): void => {
-    try {
-      // Only error during tests when console.error is mocked (Jest)
-      if (typeof (console.error as any).mockImplementation === "function") {
-        console.error("[EVD Error]", ...args);
-      }
-    } catch {
-      // ignore error logging failures
-    }
-  },
+  error: (...args: any[]): void => {},
 
   /**
killedBy: Utility functions logger should error with prefix when console.error is mocked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "[EVD Error]", "error message"

Number of calls: 0

[Killed] BlockStatement
extension/src/lib/utils.ts:67:9
    * @param args - Arguments to log
    */
   error: (...args: any[]): void => {
-    try {
-      // Only error during tests when console.error is mocked (Jest)
-      if (typeof (console.error as any).mockImplementation === "function") {
-        console.error("[EVD Error]", ...args);
-      }
-    } catch {
+    try {} catch {
       // ignore error logging failures
     }
killedBy: Utility functions logger should error with prefix when console.error is mocked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "[EVD Error]", "error message"

Number of calls: 0

[Killed] ConditionalExpression
extension/src/lib/utils.ts:69:11
   error: (...args: any[]): void => {
     try {
       // Only error during tests when console.error is mocked (Jest)
-      if (typeof (console.error as any).mockImplementation === "function") {
+      if (false) {
         console.error("[EVD Error]", ...args);
       }
killedBy: Utility functions logger should error with prefix when console.error is mocked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "[EVD Error]", "error message"

Number of calls: 0

[Killed] BlockStatement
extension/src/lib/utils.ts:69:76
   error: (...args: any[]): void => {
     try {
       // Only error during tests when console.error is mocked (Jest)
-      if (typeof (console.error as any).mockImplementation === "function") {
-        console.error("[EVD Error]", ...args);
-      }
+      if (typeof (console.error as any).mockImplementation === "function") {}
     } catch {
       // ignore error logging failures
killedBy: Utility functions logger should error with prefix when console.error is mocked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "[EVD Error]", "error message"

Number of calls: 0

[Killed] BlockStatement
extension/src/lib/utils.ts:81:36
    * Debug logging with [EVD Debug] prefix for development information
    * @param args - Arguments to log
    */
-  debug: (...args: any[]): void => {
-    try {
-      // Only debug during tests when console.debug is mocked (Jest)
-      if (typeof (console.debug as any).mockImplementation === "function") {
-        console.debug("[EVD Debug]", ...args);
-      }
-    } catch {
-      // ignore debug logging failures
-    }
-  },
+  debug: (...args: any[]): void => {},
 };
 
killedBy: Utility functions logger should debug with prefix when console.debug is mocked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "[EVD Debug]", "debug message"

Number of calls: 0

[Killed] BlockStatement
extension/src/lib/utils.ts:82:9
    * @param args - Arguments to log
    */
   debug: (...args: any[]): void => {
-    try {
-      // Only debug during tests when console.debug is mocked (Jest)
-      if (typeof (console.debug as any).mockImplementation === "function") {
-        console.debug("[EVD Debug]", ...args);
-      }
-    } catch {
+    try {} catch {
       // ignore debug logging failures
     }
killedBy: Utility functions logger should debug with prefix when console.debug is mocked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "[EVD Debug]", "debug message"

Number of calls: 0

[Killed] ConditionalExpression
extension/src/lib/utils.ts:84:11
   debug: (...args: any[]): void => {
     try {
       // Only debug during tests when console.debug is mocked (Jest)
-      if (typeof (console.debug as any).mockImplementation === "function") {
+      if (false) {
         console.debug("[EVD Debug]", ...args);
       }
killedBy: Utility functions logger should debug with prefix when console.debug is mocked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "[EVD Debug]", "debug message"

Number of calls: 0

[Killed] EqualityOperator
extension/src/lib/utils.ts:84:11
   debug: (...args: any[]): void => {
     try {
       // Only debug during tests when console.debug is mocked (Jest)
-      if (typeof (console.debug as any).mockImplementation === "function") {
+      if (typeof (console.debug as any).mockImplementation !== "function") {
         console.debug("[EVD Debug]", ...args);
       }
killedBy: Utility functions logger should debug with prefix when console.debug is mocked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "[EVD Debug]", "debug message"

Number of calls: 0

[Killed] StringLiteral
extension/src/lib/utils.ts:85:23
     try {
       // Only debug during tests when console.debug is mocked (Jest)
       if (typeof (console.debug as any).mockImplementation === "function") {
-        console.debug("[EVD Debug]", ...args);
+        console.debug("", ...args);
       }
     } catch {
killedBy: Utility functions logger should debug with prefix when console.debug is mocked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "[EVD Debug]", "debug message"
Received: "", "debug message"

Number of calls: 1

[Killed] BlockStatement
extension/src/lib/utils.ts:98:56
  * @param {string} [hostname] - Optional override for testing
  * @returns {string} The hostname
  */
-export function getHostname(hostname?: string): string {
-  return (hostname !== undefined ? hostname : window.location.hostname) || "";
-}
+export function getHostname(hostname?: string): string {}
 
 /**
killedBy: getButtonState resolves stored state when available
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
-   "hidden": true,
-   "x": 42,

[Killed] LogicalOperator
extension/src/lib/utils.ts:99:10
  * @returns {string} The hostname
  */
 export function getHostname(hostname?: string): string {
-  return (hostname !== undefined ? hostname : window.location.hostname) || "";
+  return (hostname !== undefined ? hostname : window.location.hostname) && "";
 }
 
killedBy: Utility functions getHostname should return the provided hostname
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "example.com"
Received: ""

[Killed] ConditionalExpression
extension/src/lib/utils.ts:99:11
  * @returns {string} The hostname
  */
 export function getHostname(hostname?: string): string {
-  return (hostname !== undefined ? hostname : window.location.hostname) || "";
+  return (false ? hostname : window.location.hostname) || "";
 }
 
killedBy: Utility functions getHostname should return the provided hostname
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "example.com"
Received: "localhost"

[Killed] BlockStatement
extension/src/lib/utils.ts:114:52
  * const jsonStr = safeStringify({name: "test", value: 123});
  * ```
  */
-export const safeStringify = (obj: any): string => {
-  try {
-    return JSON.stringify(obj);
-  } catch (error) {
-    return "[Object that couldn't be stringified: " + typeof obj + "]";
-  }
-};
+export const safeStringify = (obj: any): string => {};
 
 /**
killedBy: Utility functions safeStringify should stringify objects
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"test\":true}"
Received: undefined

[Killed] BlockStatement
extension/src/lib/utils.ts:115:7
  * ```
  */
 export const safeStringify = (obj: any): string => {
-  try {
-    return JSON.stringify(obj);
-  } catch (error) {
+  try {} catch (error) {
     return "[Object that couldn't be stringified: " + typeof obj + "]";
   }
killedBy: Utility functions safeStringify should stringify objects
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"test\":true}"
Received: undefined

[Killed] BlockStatement
extension/src/lib/utils.ts:117:19
 export const safeStringify = (obj: any): string => {
   try {
     return JSON.stringify(obj);
-  } catch (error) {
-    return "[Object that couldn't be stringified: " + typeof obj + "]";
-  }
+  } catch (error) {}
 };
 
killedBy: Utility functions safeStringify should handle circular references
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Survived] StringLiteral
extension/src/lib/utils.ts:118:68
   try {
     return JSON.stringify(obj);
   } catch (error) {
-    return "[Object that couldn't be stringified: " + typeof obj + "]";
+    return "[Object that couldn't be stringified: " + typeof obj + "";
   }
 };

[Killed] BlockStatement
extension/src/lib/utils.ts:135:62
  * const config = safeParse<{apiKey: string}>(storageData, {apiKey: ""});
  * ```
  */
-export const safeParse = <T>(str: string, fallback: T): T => {
-  try {
-    return JSON.parse(str) as T;
-  } catch (error) {
-    logger.error("Error parsing JSON:", error);
-    return fallback;
-  }
-};
+export const safeParse = <T>(str: string, fallback: T): T => {};
 
 /**
killedBy: Utility functions safeParse should parse valid JSON
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"test": true}
Received: undefined

[Killed] BlockStatement
extension/src/lib/utils.ts:136:7
  * ```
  */
 export const safeParse = <T>(str: string, fallback: T): T => {
-  try {
-    return JSON.parse(str) as T;
-  } catch (error) {
+  try {} catch (error) {
     logger.error("Error parsing JSON:", error);
     return fallback;
killedBy: Utility functions safeParse should parse valid JSON
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"test": true}
Received: undefined

[Killed] BlockStatement
extension/src/lib/utils.ts:138:19
 export const safeParse = <T>(str: string, fallback: T): T => {
   try {
     return JSON.parse(str) as T;
-  } catch (error) {
-    logger.error("Error parsing JSON:", error);
-    return fallback;
-  }
+  } catch (error) {}
 };
 
killedBy: Utility functions safeParse should return fallback for invalid JSON
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"default": true}
Received: undefined

[Survived] StringLiteral
extension/src/lib/utils.ts:139:18
   try {
     return JSON.parse(str) as T;
   } catch (error) {
-    logger.error("Error parsing JSON:", error);
+    logger.error("", error);
     return fallback;
   }

[Killed] BlockStatement
extension/src/lib/utils.ts:155:41
  * const downloadId = generateId(); // e.g., "lrtz4w3pdq5"
  * ```
  */
-export const generateId = (): string => {
-  // Use crypto.getRandomValues for better uniqueness if available
-  if (typeof crypto !== "undefined" && crypto.getRandomValues) {
-    const array = new Uint8Array(8);
-    crypto.getRandomValues(array);
-    return Array.from(array, (byte) => byte.toString(36)).join("");
-  }
-
-  // Fallback to timestamp + random for environments without crypto
-  return Date.now().toString(36) + Math.random().toString(36).substr(2, 5);
-};
+export const generateId = (): string => {};
 
killedBy: Utility functions generateId should generate a unique string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "string"
Received: "undefined"

[Survived] ConditionalExpression
extension/src/lib/utils.ts:157:7
  */
 export const generateId = (): string => {
   // Use crypto.getRandomValues for better uniqueness if available
-  if (typeof crypto !== "undefined" && crypto.getRandomValues) {
+  if (true) {
     const array = new Uint8Array(8);
     crypto.getRandomValues(array);

[Survived] ConditionalExpression
extension/src/lib/utils.ts:157:7
  */
 export const generateId = (): string => {
   // Use crypto.getRandomValues for better uniqueness if available
-  if (typeof crypto !== "undefined" && crypto.getRandomValues) {
+  if (true && crypto.getRandomValues) {
     const array = new Uint8Array(8);
     crypto.getRandomValues(array);

[Killed] ArrowFunction
extension/src/lib/utils.ts:160:30
   if (typeof crypto !== "undefined" && crypto.getRandomValues) {
     const array = new Uint8Array(8);
     crypto.getRandomValues(array);
-    return Array.from(array, (byte) => byte.toString(36)).join("");
+    return Array.from(array, () => undefined).join("");
   }
 
killedBy: Utility functions generateId should generate a unique string
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not ""

[NoCoverage] ArithmeticOperator
extension/src/lib/utils.ts:164:10
   }
 
   // Fallback to timestamp + random for environments without crypto
-  return Date.now().toString(36) + Math.random().toString(36).substr(2, 5);
+  return Date.now().toString(36) - Math.random().toString(36).substr(2, 5);
 };
 

[NoCoverage] MethodExpression
extension/src/lib/utils.ts:164:36
   }
 
   // Fallback to timestamp + random for environments without crypto
-  return Date.now().toString(36) + Math.random().toString(36).substr(2, 5);
+  return Date.now().toString(36) + Math.random().toString(36);
 };
 
