[NoCoverage] BooleanLiteral
extension/src/options.ts:21:13
 const setStatus = (
   elementId: string,
   message: string,
-  isError = false,
+  isError = true,
   timeout = 3000
 ): void => {

[Killed] BlockStatement
extension/src/options.ts:23:12
   message: string,
   isError = false,
   timeout = 3000
-): void => {
-  const statusElement = document.getElementById(elementId);
-  if (!statusElement) return;
-
-  statusElement.textContent = message;
-  statusElement.classList.toggle("success", !isError);
-  statusElement.classList.toggle("error", isError);
-
-  if (timeout > 0) {
-    setTimeout(() => {
-      statusElement.textContent = "";
-      statusElement.classList.remove("success", "error");
-    }, timeout);
-  }
-};
+): void => {};
 
 /**
killedBy: Options Script Unit Tests Settings Management should save settings successfully
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Settings saved successfully"
Received string:    ""

[Killed] BooleanLiteral
extension/src/options.ts:25:7
   timeout = 3000
 ): void => {
   const statusElement = document.getElementById(elementId);
-  if (!statusElement) return;
+  if (statusElement) return;
 
   statusElement.textContent = message;
killedBy: Options Script Unit Tests Settings Management should save settings successfully
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Settings saved successfully"
Received string:    ""

[Killed] ConditionalExpression
extension/src/options.ts:25:7
   timeout = 3000
 ): void => {
   const statusElement = document.getElementById(elementId);
-  if (!statusElement) return;
+  if (true) return;
 
   statusElement.textContent = message;
killedBy: Options Script Unit Tests Settings Management should save settings successfully
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Settings saved successfully"
Received string:    ""

[Survived] BooleanLiteral
extension/src/options.ts:28:45
   if (!statusElement) return;
 
   statusElement.textContent = message;
-  statusElement.classList.toggle("success", !isError);
+  statusElement.classList.toggle("success", isError);
   statusElement.classList.toggle("error", isError);
 

[Survived] EqualityOperator
extension/src/options.ts:31:7
   statusElement.classList.toggle("success", !isError);
   statusElement.classList.toggle("error", isError);
 
-  if (timeout > 0) {
+  if (timeout <= 0) {
     setTimeout(() => {
       statusElement.textContent = "";

[Survived] BlockStatement
extension/src/options.ts:31:20
   statusElement.classList.toggle("success", !isError);
   statusElement.classList.toggle("error", isError);
 
-  if (timeout > 0) {
-    setTimeout(() => {
-      statusElement.textContent = "";
-      statusElement.classList.remove("success", "error");
-    }, timeout);
-  }
+  if (timeout > 0) {}
 };
 

[NoCoverage] BlockStatement
extension/src/options.ts:32:22
   statusElement.classList.toggle("error", isError);
 
   if (timeout > 0) {
-    setTimeout(() => {
-      statusElement.textContent = "";
-      statusElement.classList.remove("success", "error");
-    }, timeout);
+    setTimeout(() => {}, timeout);
   }
 };

[NoCoverage] StringLiteral
extension/src/options.ts:33:35
 
   if (timeout > 0) {
     setTimeout(() => {
-      statusElement.textContent = "";
+      statusElement.textContent = "Stryker was here!";
       statusElement.classList.remove("success", "error");
     }, timeout);

[NoCoverage] StringLiteral
extension/src/options.ts:34:49
   if (timeout > 0) {
     setTimeout(() => {
       statusElement.textContent = "";
-      statusElement.classList.remove("success", "error");
+      statusElement.classList.remove("success", "");
     }, timeout);
   }

[Killed] BlockStatement
extension/src/options.ts:45:9
  */
 export function updateOptionsServerStatus(
   status: "connected" | "disconnected" | "checking"
-): void {
-  const indicator = document.getElementById("server-status-indicator");
-  const text = document.getElementById("server-status-text");
-
-  if (indicator && text) {
-    // Remove all status classes
-    indicator.classList.remove("connected", "disconnected");
-
-    switch (status) {
-      case "connected":
-        indicator.classList.add("connected");
-        text.textContent = "Connected";
-        break;
-      case "disconnected":
-        indicator.classList.add("disconnected");
-        text.textContent = "Disconnected";
-        break;
-      case "checking":
-        text.textContent = "Checking...";
-        break;
-    }
-  }
-}
+): void {}
 
 /**
killedBy: Options Script Unit Tests Server Status should update server status to connected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Timeout] BlockStatement
extension/src/options.ts:49:26
   const indicator = document.getElementById("server-status-indicator");
   const text = document.getElementById("server-status-text");
 
-  if (indicator && text) {
-    // Remove all status classes
-    indicator.classList.remove("connected", "disconnected");
-
-    switch (status) {
-      case "connected":
-        indicator.classList.add("connected");
-        text.textContent = "Connected";
-        break;
-      case "disconnected":
-        indicator.classList.add("disconnected");
-        text.textContent = "Disconnected";
-        break;
-      case "checking":
-        text.textContent = "Checking...";
-        break;
-    }
-  }
+  if (indicator && text) {}
 }
 

[Timeout] ConditionalExpression
extension/src/options.ts:49:7
   const indicator = document.getElementById("server-status-indicator");
   const text = document.getElementById("server-status-text");
 
-  if (indicator && text) {
+  if (true) {
     // Remove all status classes
     indicator.classList.remove("connected", "disconnected");

[Killed] StringLiteral
extension/src/options.ts:51:45
 
   if (indicator && text) {
     // Remove all status classes
-    indicator.classList.remove("connected", "disconnected");
+    indicator.classList.remove("connected", "");
 
     switch (status) {
killedBy: Options Script Unit Tests Server Status should update server status to connected
statusReason: SyntaxError: The token provided must not be empty.

[Killed] ConditionalExpression
extension/src/options.ts:54:7
     indicator.classList.remove("connected", "disconnected");
 
     switch (status) {
-      case "connected":
-        indicator.classList.add("connected");
-        text.textContent = "Connected";
-        break;
+      case "connected":
       case "disconnected":
         indicator.classList.add("disconnected");
killedBy: Options Script Unit Tests Server Status should update server status to connected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
extension/src/options.ts:58:7
         indicator.classList.add("connected");
         text.textContent = "Connected";
         break;
-      case "disconnected":
-        indicator.classList.add("disconnected");
-        text.textContent = "Disconnected";
-        break;
+      case "disconnected":
       case "checking":
         text.textContent = "Checking...";
killedBy: Options Script Unit Tests Server Status should update server status to disconnected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
extension/src/options.ts:58:12
         indicator.classList.add("connected");
         text.textContent = "Connected";
         break;
-      case "disconnected":
+      case "":
         indicator.classList.add("disconnected");
         text.textContent = "Disconnected";
killedBy: Options Script Unit Tests Server Status should update server status to disconnected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[NoCoverage] ConditionalExpression
extension/src/options.ts:62:7
         indicator.classList.add("disconnected");
         text.textContent = "Disconnected";
         break;
-      case "checking":
-        text.textContent = "Checking...";
-        break;
+      case "checking":
     }
   }

[NoCoverage] BlockStatement
extension/src/options.ts:75:45
  */
 export function initOptionsPage(): void {
   // Initialize theme first
-  initializeOptionsTheme().catch((error) => {
-    console.error("Error initializing theme:", error);
-  });
+  initializeOptionsTheme().catch((error) => {});
 
   loadSettings();

[NoCoverage] StringLiteral
extension/src/options.ts:76:19
 export function initOptionsPage(): void {
   // Initialize theme first
   initializeOptionsTheme().catch((error) => {
-    console.error("Error initializing theme:", error);
+    console.error("", error);
   });
 

[NoCoverage] BlockStatement
extension/src/options.ts:96:30
 export function loadSettings(): void {
   // First try to load from storage
   chrome.storage.local.get(["serverConfig"], (result) => {
-    if (result.serverConfig) {
-      populateFormFields(result.serverConfig);
-    }
+    if (result.serverConfig) {}
 
     // Then try to get latest from server

[NoCoverage] BlockStatement
extension/src/options.ts:102:37
 
     // Then try to get latest from server
     chrome.runtime.sendMessage({ type: "getConfig" }, (response) => {
-      if (chrome.runtime.lastError) {
-        logger.error("Error getting config:", chrome.runtime.lastError.message);
-        // Do not proceed if there's an error
-        return;
-      }
+      if (chrome.runtime.lastError) {}
       if (response && response.status === "success" && response.data) {
         populateFormFields(response.data);

[NoCoverage] BlockStatement
extension/src/options.ts:107:71
         // Do not proceed if there's an error
         return;
       }
-      if (response && response.status === "success" && response.data) {
-        populateFormFields(response.data);
-        logger.debug("Loaded settings from server");
-      } else {
+      if (response && response.status === "success" && response.data) {} else {
         logger.warn("Could not load settings from server:", response?.message);
       }

[NoCoverage] ConditionalExpression
extension/src/options.ts:147:5
   };
 
   if (
-    elements.port &&
-    config.server_port !== undefined &&
-    config.server_port !== null
+    false
   ) {
     elements.port.value = config.server_port.toString();

[NoCoverage] ConditionalExpression
extension/src/options.ts:147:5
   };
 
   if (
-    elements.port &&
-    config.server_port !== undefined &&
-    config.server_port !== null
+    true
   ) {
     elements.port.value = config.server_port.toString();

[NoCoverage] EqualityOperator
extension/src/options.ts:148:5
 
   if (
     elements.port &&
-    config.server_port !== undefined &&
+    config.server_port === undefined &&
     config.server_port !== null
   ) {

[NoCoverage] ConditionalExpression
extension/src/options.ts:148:5
 
   if (
     elements.port &&
-    config.server_port !== undefined &&
+    true &&
     config.server_port !== null
   ) {

[NoCoverage] ConditionalExpression
extension/src/options.ts:149:5
   if (
     elements.port &&
     config.server_port !== undefined &&
-    config.server_port !== null
+    true
   ) {
     elements.port.value = config.server_port.toString();

[NoCoverage] EqualityOperator
extension/src/options.ts:149:5
   if (
     elements.port &&
     config.server_port !== undefined &&
-    config.server_port !== null
+    config.server_port === null
   ) {
     elements.port.value = config.server_port.toString();

[NoCoverage] BlockStatement
extension/src/options.ts:150:5
     elements.port &&
     config.server_port !== undefined &&
     config.server_port !== null
-  ) {
-    elements.port.value = config.server_port.toString();
-  }
+  ) {}
   if (elements.downloadDir && config.download_dir) {
     elements.downloadDir.value = config.download_dir;

[NoCoverage] BlockStatement
extension/src/options.ts:153:52
   ) {
     elements.port.value = config.server_port.toString();
   }
-  if (elements.downloadDir && config.download_dir) {
-    elements.downloadDir.value = config.download_dir;
-  }
+  if (elements.downloadDir && config.download_dir) {}
   if (elements.debugMode) {
     elements.debugMode.checked = config.debug_mode ?? false;

[NoCoverage] ConditionalExpression
extension/src/options.ts:153:7
   ) {
     elements.port.value = config.server_port.toString();
   }
-  if (elements.downloadDir && config.download_dir) {
+  if (true) {
     elements.downloadDir.value = config.download_dir;
   }

[NoCoverage] ConditionalExpression
extension/src/options.ts:156:7
   if (elements.downloadDir && config.download_dir) {
     elements.downloadDir.value = config.download_dir;
   }
-  if (elements.debugMode) {
+  if (true) {
     elements.debugMode.checked = config.debug_mode ?? false;
   }

[NoCoverage] BlockStatement
extension/src/options.ts:156:27
   if (elements.downloadDir && config.download_dir) {
     elements.downloadDir.value = config.download_dir;
   }
-  if (elements.debugMode) {
-    elements.debugMode.checked = config.debug_mode ?? false;
-  }
+  if (elements.debugMode) {}
   if (elements.enableHistory) {
     elements.enableHistory.checked = config.enable_history ?? true;

[NoCoverage] BooleanLiteral
extension/src/options.ts:157:55
     elements.downloadDir.value = config.download_dir;
   }
   if (elements.debugMode) {
-    elements.debugMode.checked = config.debug_mode ?? false;
+    elements.debugMode.checked = config.debug_mode ?? true;
   }
   if (elements.enableHistory) {

[NoCoverage] LogicalOperator
extension/src/options.ts:157:34
     elements.downloadDir.value = config.download_dir;
   }
   if (elements.debugMode) {
-    elements.debugMode.checked = config.debug_mode ?? false;
+    elements.debugMode.checked = config.debug_mode && false;
   }
   if (elements.enableHistory) {

[NoCoverage] ConditionalExpression
extension/src/options.ts:159:7
   if (elements.debugMode) {
     elements.debugMode.checked = config.debug_mode ?? false;
   }
-  if (elements.enableHistory) {
+  if (false) {
     elements.enableHistory.checked = config.enable_history ?? true;
   }

[NoCoverage] BlockStatement
extension/src/options.ts:159:31
   if (elements.debugMode) {
     elements.debugMode.checked = config.debug_mode ?? false;
   }
-  if (elements.enableHistory) {
-    elements.enableHistory.checked = config.enable_history ?? true;
-  }
+  if (elements.enableHistory) {}
   if (elements.logLevel && config.log_level) {
     elements.logLevel.value = config.log_level;

[NoCoverage] BooleanLiteral
extension/src/options.ts:160:63
     elements.debugMode.checked = config.debug_mode ?? false;
   }
   if (elements.enableHistory) {
-    elements.enableHistory.checked = config.enable_history ?? true;
+    elements.enableHistory.checked = config.enable_history ?? false;
   }
   if (elements.logLevel && config.log_level) {

[NoCoverage] LogicalOperator
extension/src/options.ts:160:38
     elements.debugMode.checked = config.debug_mode ?? false;
   }
   if (elements.enableHistory) {
-    elements.enableHistory.checked = config.enable_history ?? true;
+    elements.enableHistory.checked = config.enable_history && true;
   }
   if (elements.logLevel && config.log_level) {

[NoCoverage] ConditionalExpression
extension/src/options.ts:162:7
   if (elements.enableHistory) {
     elements.enableHistory.checked = config.enable_history ?? true;
   }
-  if (elements.logLevel && config.log_level) {
+  if (true) {
     elements.logLevel.value = config.log_level;
   }

[NoCoverage] LogicalOperator
extension/src/options.ts:162:7
   if (elements.enableHistory) {
     elements.enableHistory.checked = config.enable_history ?? true;
   }
-  if (elements.logLevel && config.log_level) {
+  if (elements.logLevel || config.log_level) {
     elements.logLevel.value = config.log_level;
   }

[NoCoverage] ConditionalExpression
extension/src/options.ts:165:7
   if (elements.logLevel && config.log_level) {
     elements.logLevel.value = config.log_level;
   }
-  if (elements.ytdlpFormat && config.yt_dlp_options?.format) {
+  if (true) {
     elements.ytdlpFormat.value = config.yt_dlp_options.format;
   }

[NoCoverage] LogicalOperator
extension/src/options.ts:165:7
   if (elements.logLevel && config.log_level) {
     elements.logLevel.value = config.log_level;
   }
-  if (elements.ytdlpFormat && config.yt_dlp_options?.format) {
+  if (elements.ytdlpFormat || config.yt_dlp_options?.format) {
     elements.ytdlpFormat.value = config.yt_dlp_options.format;
   }

[NoCoverage] BlockStatement
extension/src/options.ts:168:32
   if (elements.ytdlpFormat && config.yt_dlp_options?.format) {
     elements.ytdlpFormat.value = config.yt_dlp_options.format;
   }
-  if (elements.allowPlaylists) {
-    elements.allowPlaylists.checked = config.allow_playlists ?? false;
-  }
+  if (elements.allowPlaylists) {}
 
   // Trigger validation after populating

[NoCoverage] ConditionalExpression
extension/src/options.ts:168:7
   if (elements.ytdlpFormat && config.yt_dlp_options?.format) {
     elements.ytdlpFormat.value = config.yt_dlp_options.format;
   }
-  if (elements.allowPlaylists) {
+  if (false) {
     elements.allowPlaylists.checked = config.allow_playlists ?? false;
   }

[NoCoverage] LogicalOperator
extension/src/options.ts:169:39
     elements.ytdlpFormat.value = config.yt_dlp_options.format;
   }
   if (elements.allowPlaylists) {
-    elements.allowPlaylists.checked = config.allow_playlists ?? false;
+    elements.allowPlaylists.checked = config.allow_playlists && false;
   }
 

[NoCoverage] BooleanLiteral
extension/src/options.ts:169:65
     elements.ytdlpFormat.value = config.yt_dlp_options.format;
   }
   if (elements.allowPlaylists) {
-    elements.allowPlaylists.checked = config.allow_playlists ?? false;
+    elements.allowPlaylists.checked = config.allow_playlists ?? true;
   }
 

[NoCoverage] BlockStatement
extension/src/options.ts:183:23
     "settings-ytdlp-format"
   ) as HTMLSelectElement;
 
-  if (logLevelSelect) {
-    updateLogLevelInfo(logLevelSelect);
-  }
+  if (logLevelSelect) {}
   if (formatSelect) {
     updateFormatInfo(formatSelect);

[NoCoverage] ConditionalExpression
extension/src/options.ts:183:7
     "settings-ytdlp-format"
   ) as HTMLSelectElement;
 
-  if (logLevelSelect) {
+  if (false) {
     updateLogLevelInfo(logLevelSelect);
   }

[NoCoverage] BlockStatement
extension/src/options.ts:186:21
   if (logLevelSelect) {
     updateLogLevelInfo(logLevelSelect);
   }
-  if (formatSelect) {
-    updateFormatInfo(formatSelect);
-  }
+  if (formatSelect) {}
 }
 

[NoCoverage] ConditionalExpression
extension/src/options.ts:186:7
   if (logLevelSelect) {
     updateLogLevelInfo(logLevelSelect);
   }
-  if (formatSelect) {
+  if (false) {
     updateFormatInfo(formatSelect);
   }

[NoCoverage] BlockStatement
extension/src/options.ts:196:13
  */
 export function setupEventListeners(): void {
   const form = document.getElementById("settings-form") as HTMLFormElement;
-  if (form) {
-    form.addEventListener("submit", saveSettings);
-  }
+  if (form) {}
 
   const folderPickerButton = document.getElementById("settings-folder-picker");

[NoCoverage] BlockStatement
extension/src/options.ts:201:27
   }
 
   const folderPickerButton = document.getElementById("settings-folder-picker");
-  if (folderPickerButton) {
-    folderPickerButton.addEventListener("click", selectDownloadDirectory);
-  }
+  if (folderPickerButton) {}
 
   const restartButton = document.getElementById("restart-server");

[NoCoverage] StringLiteral
extension/src/options.ts:202:41
 
   const folderPickerButton = document.getElementById("settings-folder-picker");
   if (folderPickerButton) {
-    folderPickerButton.addEventListener("click", selectDownloadDirectory);
+    folderPickerButton.addEventListener("", selectDownloadDirectory);
   }
 

[NoCoverage] BlockStatement
extension/src/options.ts:206:22
   }
 
   const restartButton = document.getElementById("restart-server");
-  if (restartButton) {
-    restartButton.addEventListener("click", restartServer);
-  }
+  if (restartButton) {}
 
   // Theme toggle functionality

[NoCoverage] StringLiteral
extension/src/options.ts:207:36
 
   const restartButton = document.getElementById("restart-server");
   if (restartButton) {
-    restartButton.addEventListener("click", restartServer);
+    restartButton.addEventListener("", restartServer);
   }
 

[NoCoverage] BlockStatement
extension/src/options.ts:212:20
 
   // Theme toggle functionality
   const themeToggle = document.getElementById("theme-toggle");
-  if (themeToggle) {
-    themeToggle.addEventListener("click", handleThemeToggle);
-  }
+  if (themeToggle) {}
 
   const clearHistoryButton = document.getElementById("settings-clear-history");

[NoCoverage] BlockStatement
extension/src/options.ts:217:27
   }
 
   const clearHistoryButton = document.getElementById("settings-clear-history");
-  if (clearHistoryButton) {
-    clearHistoryButton.addEventListener("click", () => {
-      if (
-        confirm(
-          "Are you sure you want to permanently delete all download history?"
-        )
-      ) {
-        clearHistoryAndNotify().catch((error) => {
-          console.error("Failed to clear history:", error);
-          setStatus("settings-status", "Failed to clear history", true);
-        });
-      }
-    });
-  }
+  if (clearHistoryButton) {}
 
   const resumeDownloadsButton = document.getElementById(

[NoCoverage] BlockStatement
extension/src/options.ts:218:56
 
   const clearHistoryButton = document.getElementById("settings-clear-history");
   if (clearHistoryButton) {
-    clearHistoryButton.addEventListener("click", () => {
-      if (
-        confirm(
-          "Are you sure you want to permanently delete all download history?"
-        )
-      ) {
-        clearHistoryAndNotify().catch((error) => {
-          console.error("Failed to clear history:", error);
-          setStatus("settings-status", "Failed to clear history", true);
-        });
-      }
-    });
+    clearHistoryButton.addEventListener("click", () => {});
   }
 

[NoCoverage] ConditionalExpression
extension/src/options.ts:220:9
   if (clearHistoryButton) {
     clearHistoryButton.addEventListener("click", () => {
       if (
-        confirm(
-          "Are you sure you want to permanently delete all download history?"
-        )
+        true
       ) {
         clearHistoryAndNotify().catch((error) => {

[NoCoverage] ConditionalExpression
extension/src/options.ts:220:9
   if (clearHistoryButton) {
     clearHistoryButton.addEventListener("click", () => {
       if (
-        confirm(
-          "Are you sure you want to permanently delete all download history?"
-        )
+        false
       ) {
         clearHistoryAndNotify().catch((error) => {

[NoCoverage] BlockStatement
extension/src/options.ts:223:9
         confirm(
           "Are you sure you want to permanently delete all download history?"
         )
-      ) {
-        clearHistoryAndNotify().catch((error) => {
-          console.error("Failed to clear history:", error);
-          setStatus("settings-status", "Failed to clear history", true);
-        });
-      }
+      ) {}
     });
   }

[NoCoverage] BlockStatement
extension/src/options.ts:224:50
           "Are you sure you want to permanently delete all download history?"
         )
       ) {
-        clearHistoryAndNotify().catch((error) => {
-          console.error("Failed to clear history:", error);
-          setStatus("settings-status", "Failed to clear history", true);
-        });
+        clearHistoryAndNotify().catch((error) => {});
       }
     });

[NoCoverage] BooleanLiteral
extension/src/options.ts:226:67
       ) {
         clearHistoryAndNotify().catch((error) => {
           console.error("Failed to clear history:", error);
-          setStatus("settings-status", "Failed to clear history", true);
+          setStatus("settings-status", "Failed to clear history", false);
         });
       }

[NoCoverage] StringLiteral
extension/src/options.ts:226:21
       ) {
         clearHistoryAndNotify().catch((error) => {
           console.error("Failed to clear history:", error);
-          setStatus("settings-status", "Failed to clear history", true);
+          setStatus("", "Failed to clear history", true);
         });
       }

[NoCoverage] BlockStatement
extension/src/options.ts:235:30
   const resumeDownloadsButton = document.getElementById(
     "settings-resume-downloads"
   );
-  if (resumeDownloadsButton) {
-    resumeDownloadsButton.addEventListener("click", () => {
-      chrome.runtime.sendMessage({ type: "resumeDownloads" }, (response) => {
-        if (response && response.status === "success") {
-          setStatus(
-            "settings-status",
-            "Resume operation completed successfully!"
-          );
-        } else {
-          setStatus(
-            "settings-status",
-            "Error: " + (response?.message || "Failed to resume downloads"),
-            true
-          );
-        }
-      });
-    });
-  }
+  if (resumeDownloadsButton) {}
 }
 

[NoCoverage] BlockStatement
extension/src/options.ts:236:59
     "settings-resume-downloads"
   );
   if (resumeDownloadsButton) {
-    resumeDownloadsButton.addEventListener("click", () => {
-      chrome.runtime.sendMessage({ type: "resumeDownloads" }, (response) => {
-        if (response && response.status === "success") {
-          setStatus(
-            "settings-status",
-            "Resume operation completed successfully!"
-          );
-        } else {
-          setStatus(
-            "settings-status",
-            "Error: " + (response?.message || "Failed to resume downloads"),
-            true
-          );
-        }
-      });
-    });
+    resumeDownloadsButton.addEventListener("click", () => {});
   }
 }

[NoCoverage] BlockStatement
extension/src/options.ts:237:77
   );
   if (resumeDownloadsButton) {
     resumeDownloadsButton.addEventListener("click", () => {
-      chrome.runtime.sendMessage({ type: "resumeDownloads" }, (response) => {
-        if (response && response.status === "success") {
-          setStatus(
-            "settings-status",
-            "Resume operation completed successfully!"
-          );
-        } else {
-          setStatus(
-            "settings-status",
-            "Error: " + (response?.message || "Failed to resume downloads"),
-            true
-          );
-        }
-      });
+      chrome.runtime.sendMessage({ type: "resumeDownloads" }, (response) => {});
     });
   }

[NoCoverage] StringLiteral
extension/src/options.ts:237:42
   );
   if (resumeDownloadsButton) {
     resumeDownloadsButton.addEventListener("click", () => {
-      chrome.runtime.sendMessage({ type: "resumeDownloads" }, (response) => {
+      chrome.runtime.sendMessage({ type: "" }, (response) => {
         if (response && response.status === "success") {
           setStatus(

[NoCoverage] BlockStatement
extension/src/options.ts:238:56
   if (resumeDownloadsButton) {
     resumeDownloadsButton.addEventListener("click", () => {
       chrome.runtime.sendMessage({ type: "resumeDownloads" }, (response) => {
-        if (response && response.status === "success") {
-          setStatus(
-            "settings-status",
-            "Resume operation completed successfully!"
-          );
-        } else {
+        if (response && response.status === "success") {} else {
           setStatus(
             "settings-status",

[NoCoverage] ConditionalExpression
extension/src/options.ts:238:13
   if (resumeDownloadsButton) {
     resumeDownloadsButton.addEventListener("click", () => {
       chrome.runtime.sendMessage({ type: "resumeDownloads" }, (response) => {
-        if (response && response.status === "success") {
+        if (false) {
           setStatus(
             "settings-status",

[NoCoverage] BlockStatement
extension/src/options.ts:243:16
             "settings-status",
             "Resume operation completed successfully!"
           );
-        } else {
-          setStatus(
-            "settings-status",
-            "Error: " + (response?.message || "Failed to resume downloads"),
-            true
-          );
-        }
+        } else {}
       });
     });

[NoCoverage] LogicalOperator
extension/src/options.ts:246:26
         } else {
           setStatus(
             "settings-status",
-            "Error: " + (response?.message || "Failed to resume downloads"),
+            "Error: " + (response?.message && "Failed to resume downloads"),
             true
           );

[NoCoverage] OptionalChaining
extension/src/options.ts:246:26
         } else {
           setStatus(
             "settings-status",
-            "Error: " + (response?.message || "Failed to resume downloads"),
+            "Error: " + (response.message || "Failed to resume downloads"),
             true
           );

[NoCoverage] BooleanLiteral
extension/src/options.ts:247:13
           setStatus(
             "settings-status",
             "Error: " + (response?.message || "Failed to resume downloads"),
-            true
+            false
           );
         }

[NoCoverage] BlockStatement
extension/src/options.ts:263:18
   const portInput = document.getElementById(
     "settings-server-port"
   ) as HTMLInputElement;
-  if (portInput) {
-    portInput.addEventListener("input", () => validatePort(portInput));
-    portInput.addEventListener("blur", () => validatePort(portInput));
-  }
+  if (portInput) {}
 
   // Download directory validation
