[NoCoverage] ArrowFunction
extension/src/options.ts:264:41
     "settings-server-port"
   ) as HTMLInputElement;
   if (portInput) {
-    portInput.addEventListener("input", () => validatePort(portInput));
+    portInput.addEventListener("input", () => undefined);
     portInput.addEventListener("blur", () => validatePort(portInput));
   }

[NoCoverage] ArrowFunction
extension/src/options.ts:265:40
   ) as HTMLInputElement;
   if (portInput) {
     portInput.addEventListener("input", () => validatePort(portInput));
-    portInput.addEventListener("blur", () => validatePort(portInput));
+    portInput.addEventListener("blur", () => undefined);
   }
 

[NoCoverage] BlockStatement
extension/src/options.ts:272:25
   const downloadDirInput = document.getElementById(
     "settings-download-dir"
   ) as HTMLInputElement;
-  if (downloadDirInput) {
-    downloadDirInput.addEventListener("input", () =>
-      validateFolder(downloadDirInput)
-    );
-    downloadDirInput.addEventListener("blur", () =>
-      validateFolder(downloadDirInput)
-    );
-  }
+  if (downloadDirInput) {}
 
   // Log level validation

[NoCoverage] ArrowFunction
extension/src/options.ts:273:48
     "settings-download-dir"
   ) as HTMLInputElement;
   if (downloadDirInput) {
-    downloadDirInput.addEventListener("input", () =>
-      validateFolder(downloadDirInput)
+    downloadDirInput.addEventListener("input", () => undefined
     );
     downloadDirInput.addEventListener("blur", () =>

[NoCoverage] ArrowFunction
extension/src/options.ts:276:47
     downloadDirInput.addEventListener("input", () =>
       validateFolder(downloadDirInput)
     );
-    downloadDirInput.addEventListener("blur", () =>
-      validateFolder(downloadDirInput)
+    downloadDirInput.addEventListener("blur", () => undefined
     );
   }

[NoCoverage] StringLiteral
extension/src/options.ts:276:39
     downloadDirInput.addEventListener("input", () =>
       validateFolder(downloadDirInput)
     );
-    downloadDirInput.addEventListener("blur", () =>
+    downloadDirInput.addEventListener("", () =>
       validateFolder(downloadDirInput)
     );

[NoCoverage] BlockStatement
extension/src/options.ts:285:23
   const logLevelSelect = document.getElementById(
     "settings-log-level"
   ) as HTMLSelectElement;
-  if (logLevelSelect) {
-    logLevelSelect.addEventListener("change", () =>
-      validateLogLevel(logLevelSelect)
-    );
-  }
+  if (logLevelSelect) {}
 
   // Format validation

[NoCoverage] ArrowFunction
extension/src/options.ts:286:47
     "settings-log-level"
   ) as HTMLSelectElement;
   if (logLevelSelect) {
-    logLevelSelect.addEventListener("change", () =>
-      validateLogLevel(logLevelSelect)
+    logLevelSelect.addEventListener("change", () => undefined
     );
   }

[NoCoverage] BlockStatement
extension/src/options.ts:295:21
   const formatSelect = document.getElementById(
     "settings-ytdlp-format"
   ) as HTMLSelectElement;
-  if (formatSelect) {
-    formatSelect.addEventListener("change", () => validateFormat(formatSelect));
-  }
+  if (formatSelect) {}
 
   // Real-time validation for all fields

[NoCoverage] ArrowFunction
extension/src/options.ts:296:45
     "settings-ytdlp-format"
   ) as HTMLSelectElement;
   if (formatSelect) {
-    formatSelect.addEventListener("change", () => validateFormat(formatSelect));
+    formatSelect.addEventListener("change", () => undefined);
   }
 

[NoCoverage] BlockStatement
extension/src/options.ts:301:32
 
   // Real-time validation for all fields
   const allInputs = document.querySelectorAll("input, select");
-  allInputs.forEach((input) => {
-    if (
-      input instanceof HTMLInputElement ||
-      input instanceof HTMLSelectElement
-    ) {
-      input.addEventListener("input", () => validateField(input));
-      input.addEventListener("blur", () => validateField(input));
-    }
-  });
+  allInputs.forEach((input) => {});
 }
 

[NoCoverage] LogicalOperator
extension/src/options.ts:303:7
   const allInputs = document.querySelectorAll("input, select");
   allInputs.forEach((input) => {
     if (
-      input instanceof HTMLInputElement ||
-      input instanceof HTMLSelectElement
+      input instanceof HTMLInputElement && input instanceof HTMLSelectElement
     ) {
       input.addEventListener("input", () => validateField(input));

[NoCoverage] ConditionalExpression
extension/src/options.ts:303:7
   const allInputs = document.querySelectorAll("input, select");
   allInputs.forEach((input) => {
     if (
-      input instanceof HTMLInputElement ||
-      input instanceof HTMLSelectElement
+      false
     ) {
       input.addEventListener("input", () => validateField(input));

[NoCoverage] BlockStatement
extension/src/options.ts:305:7
     if (
       input instanceof HTMLInputElement ||
       input instanceof HTMLSelectElement
-    ) {
-      input.addEventListener("input", () => validateField(input));
-      input.addEventListener("blur", () => validateField(input));
-    }
+    ) {}
   });
 }

[NoCoverage] ArrowFunction
extension/src/options.ts:306:39
       input instanceof HTMLInputElement ||
       input instanceof HTMLSelectElement
     ) {
-      input.addEventListener("input", () => validateField(input));
+      input.addEventListener("input", () => undefined);
       input.addEventListener("blur", () => validateField(input));
     }

[NoCoverage] StringLiteral
extension/src/options.ts:306:30
       input instanceof HTMLInputElement ||
       input instanceof HTMLSelectElement
     ) {
-      input.addEventListener("input", () => validateField(input));
+      input.addEventListener("", () => validateField(input));
       input.addEventListener("blur", () => validateField(input));
     }

[NoCoverage] ArrowFunction
extension/src/options.ts:307:38
       input instanceof HTMLSelectElement
     ) {
       input.addEventListener("input", () => validateField(input));
-      input.addEventListener("blur", () => validateField(input));
+      input.addEventListener("blur", () => undefined);
     }
   });

[NoCoverage] StringLiteral
extension/src/options.ts:307:30
       input instanceof HTMLSelectElement
     ) {
       input.addEventListener("input", () => validateField(input));
-      input.addEventListener("blur", () => validateField(input));
+      input.addEventListener("", () => validateField(input));
     }
   });

[Survived] MethodExpression
extension/src/options.ts:316:17
  * Validates a port number input field.
  */
 export function validatePort(input: HTMLInputElement): boolean {
-  const value = input.value.trim();
+  const value = input.value;
   const validationElement = document.getElementById("port-validation");
 

[Killed] BooleanLiteral
extension/src/options.ts:319:7
   const value = input.value.trim();
   const validationElement = document.getElementById("port-validation");
 
-  if (!value) {
+  if (value) {
     showValidationMessage(
       validationElement,
killedBy: Options Script Unit Tests Validation Functions should validate port correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
extension/src/options.ts:319:7
   const value = input.value.trim();
   const validationElement = document.getElementById("port-validation");
 
-  if (!value) {
+  if (true) {
     showValidationMessage(
       validationElement,
killedBy: Options Script Unit Tests Validation Functions should validate port correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] StringLiteral
extension/src/options.ts:323:7
     showValidationMessage(
       validationElement,
       "Port number is required",
-      "error"
+      ""
     );
     input.classList.add("invalid");

[Killed] BooleanLiteral
extension/src/options.ts:327:12
     );
     input.classList.add("invalid");
     input.classList.remove("valid");
-    return false;
+    return true;
   }
 
killedBy: Options UI Logic Tests Port Validation validates empty port as invalid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
extension/src/options.ts:331:20
   }
 
   const port = parseInt(value, 10);
-  if (isNaN(port)) {
-    showValidationMessage(
-      validationElement,
-      "Port must be a valid number",
-      "error"
-    );
-    input.classList.add("invalid");
-    input.classList.remove("valid");
-    return false;
-  }
+  if (isNaN(port)) {}
 
   const [minPort, maxPort] = getPortRange();
killedBy: Options Script Unit Tests Validation Functions should validate port correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
extension/src/options.ts:331:7
   }
 
   const port = parseInt(value, 10);
-  if (isNaN(port)) {
+  if (true) {
     showValidationMessage(
       validationElement,
killedBy: Options Script Unit Tests Validation Functions should validate port correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] StringLiteral
extension/src/options.ts:334:7
   if (isNaN(port)) {
     showValidationMessage(
       validationElement,
-      "Port must be a valid number",
+      "",
       "error"
     );

[Killed] StringLiteral
extension/src/options.ts:337:25
       "Port must be a valid number",
       "error"
     );
-    input.classList.add("invalid");
+    input.classList.add("");
     input.classList.remove("valid");
     return false;
killedBy: Options Script Unit Tests Validation Functions should validate port correctly
statusReason: SyntaxError: The token provided must not be empty.

[Killed] EqualityOperator
extension/src/options.ts:343:25
   }
 
   const [minPort, maxPort] = getPortRange();
-  if (port < minPort || port > maxPort) {
+  if (port < minPort || port <= maxPort) {
     showValidationMessage(
       validationElement,
killedBy: Options UI Logic Tests Port Validation validates port above range as invalid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
extension/src/options.ts:343:7
   }
 
   const [minPort, maxPort] = getPortRange();
-  if (port < minPort || port > maxPort) {
+  if (port < minPort && port > maxPort) {
     showValidationMessage(
       validationElement,
killedBy: Options UI Logic Tests Port Validation validates port below range as invalid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] StringLiteral
extension/src/options.ts:347:7
     showValidationMessage(
       validationElement,
       `Port must be between ${minPort} and ${maxPort}`,
-      "error"
+      ""
     );
     input.classList.add("invalid");

[Killed] StringLiteral
extension/src/options.ts:350:28
       "error"
     );
     input.classList.add("invalid");
-    input.classList.remove("valid");
+    input.classList.remove("");
     return false;
   }
killedBy: Options Script Unit Tests Validation Functions should validate port correctly
statusReason: SyntaxError: The token provided must not be empty.

[Survived] ConditionalExpression
extension/src/options.ts:356:7
 
   // Check for common port conflicts
   const commonPorts = [80, 443, 3000, 5000, 8000, 8080]; // Removed 9000 to allow 9090
-  if (commonPorts.includes(port)) {
+  if (false) {
     showValidationMessage(
       validationElement,

[Survived] ConditionalExpression
extension/src/options.ts:356:7
 
   // Check for common port conflicts
   const commonPorts = [80, 443, 3000, 5000, 8000, 8080]; // Removed 9000 to allow 9090
-  if (commonPorts.includes(port)) {
+  if (true) {
     showValidationMessage(
       validationElement,

[Survived] StringLiteral
extension/src/options.ts:359:7
   if (commonPorts.includes(port)) {
     showValidationMessage(
       validationElement,
-      "Port " + port + " is commonly used by other services",
+      "" + port + " is commonly used by other services",
       "warning"
     );

[Survived] StringLiteral
extension/src/options.ts:360:7
     showValidationMessage(
       validationElement,
       "Port " + port + " is commonly used by other services",
-      "warning"
+      ""
     );
     input.classList.add("valid");

[Killed] BooleanLiteral
extension/src/options.ts:364:12
     );
     input.classList.add("valid");
     input.classList.remove("invalid");
-    return true;
+    return false;
   }
 
killedBy: Options Script Unit Tests Validation Functions should validate port correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ConditionalExpression
extension/src/options.ts:368:7
   }
 
   // Special case for our server port
-  if (port === 9090) {
+  if (false) {
     showValidationMessage(
       validationElement,

[Survived] EqualityOperator
extension/src/options.ts:368:7
   }
 
   // Special case for our server port
-  if (port === 9090) {
+  if (port !== 9090) {
     showValidationMessage(
       validationElement,

[Survived] MethodExpression
extension/src/options.ts:389:17
  * Validates a download folder path input field.
  */
 export function validateFolder(input: HTMLInputElement): boolean {
-  const value = input.value.trim();
+  const value = input.value;
   const validationElement = document.getElementById("folder-validation");
 

[Killed] ConditionalExpression
extension/src/options.ts:392:7
   const value = input.value.trim();
   const validationElement = document.getElementById("folder-validation");
 
-  if (!value) {
+  if (false) {
     showValidationMessage(
       validationElement,
killedBy: Options UI Logic Tests Folder Validation validates empty folder path as invalid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
extension/src/options.ts:404:53
   }
 
   // Basic path validation
-  if (value.includes("..") || value.includes("//")) {
-    showValidationMessage(
-      validationElement,
-      "Invalid path format detected",
-      "error"
-    );
-    input.classList.add("invalid");
-    input.classList.remove("valid");
-    return false;
-  }
+  if (value.includes("..") || value.includes("//")) {}
 
   // Check for absolute path (basic check)
killedBy: Options UI Logic Tests Folder Validation validates path with suspicious patterns as invalid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
extension/src/options.ts:404:7
   }
 
   // Basic path validation
-  if (value.includes("..") || value.includes("//")) {
+  if (true) {
     showValidationMessage(
       validationElement,
killedBy: Options UI Logic Tests Folder Validation validates relative path with warning
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] StringLiteral
extension/src/options.ts:408:7
     showValidationMessage(
       validationElement,
       "Invalid path format detected",
-      "error"
+      ""
     );
     input.classList.add("invalid");

[Survived] BooleanLiteral
extension/src/options.ts:416:33
   }
 
   // Check for absolute path (basic check)
-  if (!value.startsWith("/") && !value.match(/^[A-Za-z]:/)) {
+  if (!value.startsWith("/") && value.match(/^[A-Za-z]:/)) {
     // This could be a folder name from the folder picker or a relative path
     // Allow it but show a warning that it should be an absolute path

[Survived] ConditionalExpression
extension/src/options.ts:416:7
   }
 
   // Check for absolute path (basic check)
-  if (!value.startsWith("/") && !value.match(/^[A-Za-z]:/)) {
+  if (false) {
     // This could be a folder name from the folder picker or a relative path
     // Allow it but show a warning that it should be an absolute path

[Survived] StringLiteral
extension/src/options.ts:421:7
     // Allow it but show a warning that it should be an absolute path
     showValidationMessage(
       validationElement,
-      "Please provide an absolute path for best compatibility",
+      "",
       "warning"
     );

[Survived] StringLiteral
extension/src/options.ts:422:7
     showValidationMessage(
       validationElement,
       "Please provide an absolute path for best compatibility",
-      "warning"
+      ""
     );
     input.classList.add("valid");

[Survived] StringLiteral
extension/src/options.ts:432:5
   showValidationMessage(
     validationElement,
     "Folder path looks valid",
-    "success"
+    ""
   );
   input.classList.add("valid");

[Survived] StringLiteral
extension/src/options.ts:444:53
  */
 export function validateLogLevel(select: HTMLSelectElement): boolean {
   const value = select.value;
-  const validationElement = document.getElementById("log-level-validation");
+  const validationElement = document.getElementById("");
 
   if (!value) {

[Survived] StringLiteral
extension/src/options.ts:449:7
   if (!value) {
     showValidationMessage(
       validationElement,
-      "Please select a log level",
+      "",
       "error"
     );

[Survived] StringLiteral
extension/src/options.ts:450:7
     showValidationMessage(
       validationElement,
       "Please select a log level",
-      "error"
+      ""
     );
     select.classList.add("invalid");

[Killed] BooleanLiteral
extension/src/options.ts:454:12
     );
     select.classList.add("invalid");
     select.classList.remove("valid");
-    return false;
+    return true;
   }
 
killedBy: Options UI Logic Tests Log Level Validation validates empty log level as invalid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] StringLiteral
extension/src/options.ts:457:41
     return false;
   }
 
-  const validLevels = ["error", "info", "debug", "ERROR", "INFO", "DEBUG"];
+  const validLevels = ["error", "info", "", "ERROR", "INFO", "DEBUG"];
   if (!validLevels.includes(value)) {
     showValidationMessage(
killedBy: Options Script Unit Tests Validation Functions should validate log level correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
extension/src/options.ts:457:59
     return false;
   }
 
-  const validLevels = ["error", "info", "debug", "ERROR", "INFO", "DEBUG"];
+  const validLevels = ["error", "info", "debug", "ERROR", "", "DEBUG"];
   if (!validLevels.includes(value)) {
     showValidationMessage(
killedBy: Options UI Logic Tests Log Level Validation validates INFO level as valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
extension/src/options.ts:458:7
   }
 
   const validLevels = ["error", "info", "debug", "ERROR", "INFO", "DEBUG"];
-  if (!validLevels.includes(value)) {
+  if (validLevels.includes(value)) {
     showValidationMessage(
       validationElement,
killedBy: Options Script Unit Tests Validation Functions should validate log level correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
extension/src/options.ts:458:7
   }
 
   const validLevels = ["error", "info", "debug", "ERROR", "INFO", "DEBUG"];
-  if (!validLevels.includes(value)) {
+  if (true) {
     showValidationMessage(
       validationElement,
killedBy: Options Script Unit Tests Validation Functions should validate log level correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[NoCoverage] StringLiteral
extension/src/options.ts:462:7
     showValidationMessage(
       validationElement,
       "Invalid log level selected",
-      "error"
+      ""
     );
     select.classList.add("invalid");

[NoCoverage] StringLiteral
extension/src/options.ts:464:26
       "Invalid log level selected",
       "error"
     );
-    select.classList.add("invalid");
+    select.classList.add("");
     select.classList.remove("valid");
     return false;

[Killed] StringLiteral
extension/src/options.ts:471:27
 
   showValidationMessage(validationElement, "Log level is valid", "success");
   select.classList.add("valid");
-  select.classList.remove("invalid");
+  select.classList.remove("");
   return true;
 }
killedBy: Options Script Unit Tests Validation Functions should validate log level correctly
statusReason: SyntaxError: The token provided must not be empty.

[Killed] BooleanLiteral
extension/src/options.ts:472:10
   showValidationMessage(validationElement, "Log level is valid", "success");
   select.classList.add("valid");
   select.classList.remove("invalid");
-  return true;
+  return false;
 }
 
killedBy: Options UI Logic Tests Log Level Validation validates ERROR level as valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] StringLiteral
extension/src/options.ts:486:7
     showValidationMessage(
       validationElement,
       "Please select a video format",
-      "error"
+      ""
     );
     select.classList.add("invalid");

[Killed] StringLiteral
extension/src/options.ts:494:5
   }
 
   const validFormats = [
-    "bestvideo+bestaudio/best",
+    "",
     "best",
     "mp4",
killedBy: Options UI Logic Tests Format Validation validates bestvideo+bestaudio/best as valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
extension/src/options.ts:495:5
 
   const validFormats = [
     "bestvideo+bestaudio/best",
-    "best",
+    "",
     "mp4",
     "webm",
killedBy: Options UI Logic Tests Format Validation validates best as valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
extension/src/options.ts:502:7
     "bestaudio[ext=opus]",
   ];
 
-  if (!validFormats.includes(value)) {
+  if (true) {
     showValidationMessage(
       validationElement,
killedBy: Options UI Logic Tests Format Validation validates bestvideo+bestaudio/best as valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
extension/src/options.ts:502:7
     "bestaudio[ext=opus]",
   ];
 
-  if (!validFormats.includes(value)) {
+  if (validFormats.includes(value)) {
     showValidationMessage(
       validationElement,
killedBy: Options UI Logic Tests Format Validation validates bestvideo+bestaudio/best as valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[NoCoverage] StringLiteral
extension/src/options.ts:509:29
       "error"
     );
     select.classList.add("invalid");
-    select.classList.remove("valid");
+    select.classList.remove("");
     return false;
   }

[NoCoverage] ConditionalExpression
extension/src/options.ts:523:21
  * Generic field validation function.
  */
 function validateField(field: HTMLInputElement | HTMLSelectElement): boolean {
-  const fieldName = field.name || field.id;
+  const fieldName = true;
 
   // Skip validation for checkboxes and hidden fields

[NoCoverage] ConditionalExpression
extension/src/options.ts:523:21
  * Generic field validation function.
  */
 function validateField(field: HTMLInputElement | HTMLSelectElement): boolean {
-  const fieldName = field.name || field.id;
+  const fieldName = false;
 
   // Skip validation for checkboxes and hidden fields

[NoCoverage] BlockStatement
extension/src/options.ts:526:61
   const fieldName = field.name || field.id;
 
   // Skip validation for checkboxes and hidden fields
-  if (field.type === "checkbox" || field.type === "hidden") {
-    return true;
-  }
+  if (field.type === "checkbox" || field.type === "hidden") {}
 
   const value = field.value.trim();

[NoCoverage] EqualityOperator
extension/src/options.ts:526:36
   const fieldName = field.name || field.id;
 
   // Skip validation for checkboxes and hidden fields
-  if (field.type === "checkbox" || field.type === "hidden") {
+  if (field.type === "checkbox" || field.type !== "hidden") {
     return true;
   }

[NoCoverage] BooleanLiteral
extension/src/options.ts:527:12
 
   // Skip validation for checkboxes and hidden fields
   if (field.type === "checkbox" || field.type === "hidden") {
-    return true;
+    return false;
   }
 

[NoCoverage] MethodExpression
extension/src/options.ts:530:17
     return true;
   }
 
-  const value = field.value.trim();
+  const value = field.value;
 
   // Required field validation

[NoCoverage] LogicalOperator
extension/src/options.ts:533:7
   const value = field.value.trim();
 
   // Required field validation
-  if (field.hasAttribute("required") && !value) {
+  if (field.hasAttribute("required") || !value) {
     showFieldValidation(field, fieldName + " is required", "error");
     return false;

[NoCoverage] BooleanLiteral
extension/src/options.ts:533:41
   const value = field.value.trim();
 
   // Required field validation
-  if (field.hasAttribute("required") && !value) {
+  if (field.hasAttribute("required") && value) {
     showFieldValidation(field, fieldName + " is required", "error");
     return false;

[NoCoverage] StringLiteral
extension/src/options.ts:534:60
 
   // Required field validation
   if (field.hasAttribute("required") && !value) {
-    showFieldValidation(field, fieldName + " is required", "error");
+    showFieldValidation(field, fieldName + " is required", "");
     return false;
   }

[NoCoverage] BooleanLiteral
extension/src/options.ts:535:12
   // Required field validation
   if (field.hasAttribute("required") && !value) {
     showFieldValidation(field, fieldName + " is required", "error");
-    return false;
+    return true;
   }
 

[NoCoverage] ConditionalExpression
extension/src/options.ts:539:7
   }
 
   // Field-specific validation
-  if (fieldName === "server-port") {
+  if (true) {
     return validatePort(field as HTMLInputElement);
   } else if (fieldName === "download-dir") {

[NoCoverage] BlockStatement
extension/src/options.ts:539:36
   }
 
   // Field-specific validation
-  if (fieldName === "server-port") {
-    return validatePort(field as HTMLInputElement);
-  } else if (fieldName === "download-dir") {
+  if (fieldName === "server-port") {} else if (fieldName === "download-dir") {
     return validateFolder(field as HTMLInputElement);
   } else if (fieldName === "log-level") {

[NoCoverage] ConditionalExpression
extension/src/options.ts:541:14
   // Field-specific validation
   if (fieldName === "server-port") {
     return validatePort(field as HTMLInputElement);
-  } else if (fieldName === "download-dir") {
+  } else if (false) {
     return validateFolder(field as HTMLInputElement);
   } else if (fieldName === "log-level") {

[NoCoverage] EqualityOperator
extension/src/options.ts:541:14
   // Field-specific validation
   if (fieldName === "server-port") {
     return validatePort(field as HTMLInputElement);
-  } else if (fieldName === "download-dir") {
+  } else if (fieldName !== "download-dir") {
     return validateFolder(field as HTMLInputElement);
   } else if (fieldName === "log-level") {

[NoCoverage] EqualityOperator
extension/src/options.ts:543:14
     return validatePort(field as HTMLInputElement);
   } else if (fieldName === "download-dir") {
     return validateFolder(field as HTMLInputElement);
-  } else if (fieldName === "log-level") {
+  } else if (fieldName !== "log-level") {
     return validateLogLevel(field as HTMLSelectElement);
   } else if (fieldName === "ytdlp-format") {

[NoCoverage] BlockStatement
extension/src/options.ts:543:41
     return validatePort(field as HTMLInputElement);
   } else if (fieldName === "download-dir") {
     return validateFolder(field as HTMLInputElement);
-  } else if (fieldName === "log-level") {
-    return validateLogLevel(field as HTMLSelectElement);
-  } else if (fieldName === "ytdlp-format") {
+  } else if (fieldName === "log-level") {} else if (fieldName === "ytdlp-format") {
     return validateFormat(field as HTMLSelectElement);
   }

[NoCoverage] BlockStatement
extension/src/options.ts:545:44
     return validateFolder(field as HTMLInputElement);
   } else if (fieldName === "log-level") {
     return validateLogLevel(field as HTMLSelectElement);
-  } else if (fieldName === "ytdlp-format") {
-    return validateFormat(field as HTMLSelectElement);
-  }
+  } else if (fieldName === "ytdlp-format") {}
 
   // Default success for other fields

[NoCoverage] ConditionalExpression
extension/src/options.ts:545:14
     return validateFolder(field as HTMLInputElement);
   } else if (fieldName === "log-level") {
     return validateLogLevel(field as HTMLSelectElement);
-  } else if (fieldName === "ytdlp-format") {
+  } else if (true) {
     return validateFormat(field as HTMLSelectElement);
   }

[NoCoverage] StringLiteral
extension/src/options.ts:550:48
   }
 
   // Default success for other fields
-  showFieldValidation(field, "Field is valid", "success");
+  showFieldValidation(field, "Field is valid", "");
   return true;
 }

[NoCoverage] BooleanLiteral
extension/src/options.ts:551:10
 
   // Default success for other fields
   showFieldValidation(field, "Field is valid", "success");
-  return true;
+  return false;
 }
 
