[NoCoverage] BlockStatement
extension/src/options.ts:561:9
   field: HTMLInputElement | HTMLSelectElement,
   message: string,
   type: "success" | "error" | "warning"
-): void {
-  const fieldId = field.id;
-  const validationElement = document.getElementById(fieldId + "-validation");
-
-  if (validationElement) {
-    showValidationMessage(validationElement, message, type);
-  }
-
-  field.classList.remove("valid", "invalid");
-  if (type === "success") {
-    field.classList.add("valid");
-  } else if (type === "error") {
-    field.classList.add("invalid");
-  }
-}
+): void {}
 
 /**

[NoCoverage] BlockStatement
extension/src/options.ts:565:26
   const fieldId = field.id;
   const validationElement = document.getElementById(fieldId + "-validation");
 
-  if (validationElement) {
-    showValidationMessage(validationElement, message, type);
-  }
+  if (validationElement) {}
 
   field.classList.remove("valid", "invalid");

[NoCoverage] ConditionalExpression
extension/src/options.ts:565:7
   const fieldId = field.id;
   const validationElement = document.getElementById(fieldId + "-validation");
 
-  if (validationElement) {
+  if (false) {
     showValidationMessage(validationElement, message, type);
   }

[NoCoverage] ConditionalExpression
extension/src/options.ts:570:7
   }
 
   field.classList.remove("valid", "invalid");
-  if (type === "success") {
+  if (true) {
     field.classList.add("valid");
   } else if (type === "error") {

[NoCoverage] ConditionalExpression
extension/src/options.ts:570:7
   }
 
   field.classList.remove("valid", "invalid");
-  if (type === "success") {
+  if (false) {
     field.classList.add("valid");
   } else if (type === "error") {

[NoCoverage] ConditionalExpression
extension/src/options.ts:572:14
   field.classList.remove("valid", "invalid");
   if (type === "success") {
     field.classList.add("valid");
-  } else if (type === "error") {
+  } else if (true) {
     field.classList.add("invalid");
   }

[NoCoverage] ConditionalExpression
extension/src/options.ts:572:14
   field.classList.remove("valid", "invalid");
   if (type === "success") {
     field.classList.add("valid");
-  } else if (type === "error") {
+  } else if (false) {
     field.classList.add("invalid");
   }

[Killed] BlockStatement
extension/src/options.ts:584:9
   element: HTMLElement | null,
   message: string,
   type: "success" | "error" | "warning"
-): void {
-  if (!element) return;
-
-  element.textContent = message;
-  element.className = "validation-message " + type;
-
-  // Auto-hide success messages after 3 seconds
-  if (type === "success") {
-    setTimeout(() => {
-      element.textContent = "";
-      element.className = "validation-message";
-    }, 3000);
-  }
-}
+): void {}
 
 /**
killedBy: Options Script Unit Tests Validation Messages should show validation message
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test message"
Received: ""

[Killed] ConditionalExpression
extension/src/options.ts:585:7
   message: string,
   type: "success" | "error" | "warning"
 ): void {
-  if (!element) return;
+  if (true) return;
 
   element.textContent = message;
killedBy: Options UI Logic Tests Validation Message Display shows validation message with correct class
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Test message"
Received: ""

[Killed] BooleanLiteral
extension/src/options.ts:585:7
   message: string,
   type: "success" | "error" | "warning"
 ): void {
-  if (!element) return;
+  if (element) return;
 
   element.textContent = message;
killedBy: Options UI Logic Tests Validation Message Display shows validation message with correct class
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Test message"
Received: ""

[Killed] EqualityOperator
extension/src/options.ts:591:7
   element.className = "validation-message " + type;
 
   // Auto-hide success messages after 3 seconds
-  if (type === "success") {
+  if (type !== "success") {
     setTimeout(() => {
       element.textContent = "";
killedBy: Options UI Logic Tests Validation Message Display auto-hides success messages after timeout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Success message"

[Killed] BlockStatement
extension/src/options.ts:591:27
   element.className = "validation-message " + type;
 
   // Auto-hide success messages after 3 seconds
-  if (type === "success") {
-    setTimeout(() => {
-      element.textContent = "";
-      element.className = "validation-message";
-    }, 3000);
-  }
+  if (type === "success") {}
 }
 
killedBy: Options UI Logic Tests Validation Message Display auto-hides success messages after timeout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Success message"

[Killed] BlockStatement
extension/src/options.ts:592:22
 
   // Auto-hide success messages after 3 seconds
   if (type === "success") {
-    setTimeout(() => {
-      element.textContent = "";
-      element.className = "validation-message";
-    }, 3000);
+    setTimeout(() => {}, 3000);
   }
 }
killedBy: Options UI Logic Tests Validation Message Display auto-hides success messages after timeout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Success message"

[Killed] StringLiteral
extension/src/options.ts:594:27
   if (type === "success") {
     setTimeout(() => {
       element.textContent = "";
-      element.className = "validation-message";
+      element.className = "";
     }, 3000);
   }
killedBy: Options UI Logic Tests Validation Message Display auto-hides success messages after timeout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "validation-message"
Received: ""

[Killed] BooleanLiteral
extension/src/options.ts:606:18
   const requiredFields = document.querySelectorAll(
     "input[required], select[required]"
   );
-  let allValid = true;
+  let allValid = false;
 
   requiredFields.forEach((field) => {
killedBy: Options Script Unit Tests Settings Management should save settings successfully
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Settings saved successfully"
Received string:    "Please fix validation errors before saving"

[NoCoverage] BlockStatement
extension/src/options.ts:608:37
   );
   let allValid = true;
 
-  requiredFields.forEach((field) => {
-    if (
-      field instanceof HTMLInputElement ||
-      field instanceof HTMLSelectElement
-    ) {
-      if (!validateField(field)) {
-        allValid = false;
-      }
-    }
-  });
+  requiredFields.forEach((field) => {});
 
   // Also validate specific fields that have custom validation

[NoCoverage] ConditionalExpression
extension/src/options.ts:610:7
 
   requiredFields.forEach((field) => {
     if (
-      field instanceof HTMLInputElement ||
-      field instanceof HTMLSelectElement
+      true
     ) {
       if (!validateField(field)) {

[NoCoverage] ConditionalExpression
extension/src/options.ts:610:7
 
   requiredFields.forEach((field) => {
     if (
-      field instanceof HTMLInputElement ||
-      field instanceof HTMLSelectElement
+      false
     ) {
       if (!validateField(field)) {

[NoCoverage] BlockStatement
extension/src/options.ts:612:7
     if (
       field instanceof HTMLInputElement ||
       field instanceof HTMLSelectElement
-    ) {
-      if (!validateField(field)) {
-        allValid = false;
-      }
-    }
+    ) {}
   });
 

[NoCoverage] ConditionalExpression
extension/src/options.ts:613:11
       field instanceof HTMLInputElement ||
       field instanceof HTMLSelectElement
     ) {
-      if (!validateField(field)) {
+      if (false) {
         allValid = false;
       }

[NoCoverage] ConditionalExpression
extension/src/options.ts:613:11
       field instanceof HTMLInputElement ||
       field instanceof HTMLSelectElement
     ) {
-      if (!validateField(field)) {
+      if (true) {
         allValid = false;
       }

[NoCoverage] BooleanLiteral
extension/src/options.ts:614:20
       field instanceof HTMLSelectElement
     ) {
       if (!validateField(field)) {
-        allValid = false;
+        allValid = true;
       }
     }

[Killed] ConditionalExpression
extension/src/options.ts:623:7
   const portInput = document.getElementById(
     "settings-server-port"
   ) as HTMLInputElement;
-  if (portInput && !validatePort(portInput)) {
+  if (false) {
     allValid = false;
   }
killedBy: Options Script Unit Tests Error Handling should handle validation errors
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Please fix validation errors"
Received string:    "Error saving settings: Storage error"

[Killed] ConditionalExpression
extension/src/options.ts:623:7
   const portInput = document.getElementById(
     "settings-server-port"
   ) as HTMLInputElement;
-  if (portInput && !validatePort(portInput)) {
+  if (true) {
     allValid = false;
   }
killedBy: Options Script Unit Tests Settings Management should save settings successfully
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Settings saved successfully"
Received string:    "Please fix validation errors before saving"

[Killed] BooleanLiteral
extension/src/options.ts:624:16
     "settings-server-port"
   ) as HTMLInputElement;
   if (portInput && !validatePort(portInput)) {
-    allValid = false;
+    allValid = true;
   }
 
killedBy: Options Script Unit Tests Error Handling should handle validation errors
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Please fix validation errors"
Received string:    "Settings saved successfully!"

[Killed] ConditionalExpression
extension/src/options.ts:630:7
   const downloadDirInput = document.getElementById(
     "settings-download-dir"
   ) as HTMLInputElement;
-  if (downloadDirInput && !validateFolder(downloadDirInput)) {
+  if (true) {
     allValid = false;
   }
killedBy: Options Script Unit Tests Settings Management should save settings successfully
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Settings saved successfully"
Received string:    "Please fix validation errors before saving"

[Killed] BooleanLiteral
extension/src/options.ts:630:27
   const downloadDirInput = document.getElementById(
     "settings-download-dir"
   ) as HTMLInputElement;
-  if (downloadDirInput && !validateFolder(downloadDirInput)) {
+  if (downloadDirInput && validateFolder(downloadDirInput)) {
     allValid = false;
   }
killedBy: Options Script Unit Tests Settings Management should save settings successfully
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Settings saved successfully"
Received string:    "Please fix validation errors before saving"

[NoCoverage] BooleanLiteral
extension/src/options.ts:631:16
     "settings-download-dir"
   ) as HTMLInputElement;
   if (downloadDirInput && !validateFolder(downloadDirInput)) {
-    allValid = false;
+    allValid = true;
   }
 

[Killed] LogicalOperator
extension/src/options.ts:637:7
   const logLevelSelect = document.getElementById(
     "settings-log-level"
   ) as HTMLSelectElement;
-  if (logLevelSelect && !validateLogLevel(logLevelSelect)) {
+  if (logLevelSelect || !validateLogLevel(logLevelSelect)) {
     allValid = false;
   }
killedBy: Options Script Unit Tests Settings Management should save settings successfully
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Settings saved successfully"
Received string:    "Please fix validation errors before saving"

[Killed] BooleanLiteral
extension/src/options.ts:637:25
   const logLevelSelect = document.getElementById(
     "settings-log-level"
   ) as HTMLSelectElement;
-  if (logLevelSelect && !validateLogLevel(logLevelSelect)) {
+  if (logLevelSelect && validateLogLevel(logLevelSelect)) {
     allValid = false;
   }
killedBy: Options Script Unit Tests Settings Management should save settings successfully
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Settings saved successfully"
Received string:    "Please fix validation errors before saving"

[NoCoverage] BooleanLiteral
extension/src/options.ts:638:16
     "settings-log-level"
   ) as HTMLSelectElement;
   if (logLevelSelect && !validateLogLevel(logLevelSelect)) {
-    allValid = false;
+    allValid = true;
   }
 

[Killed] BooleanLiteral
extension/src/options.ts:644:23
   const formatSelect = document.getElementById(
     "settings-ytdlp-format"
   ) as HTMLSelectElement;
-  if (formatSelect && !validateFormat(formatSelect)) {
+  if (formatSelect && validateFormat(formatSelect)) {
     allValid = false;
   }
killedBy: Options Script Unit Tests Settings Management should save settings successfully
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Settings saved successfully"
Received string:    "Please fix validation errors before saving"

[Killed] ConditionalExpression
extension/src/options.ts:644:7
   const formatSelect = document.getElementById(
     "settings-ytdlp-format"
   ) as HTMLSelectElement;
-  if (formatSelect && !validateFormat(formatSelect)) {
+  if (true) {
     allValid = false;
   }
killedBy: Options Script Unit Tests Settings Management should save settings successfully
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Settings saved successfully"
Received string:    "Please fix validation errors before saving"

[NoCoverage] BooleanLiteral
extension/src/options.ts:645:16
     "settings-ytdlp-format"
   ) as HTMLSelectElement;
   if (formatSelect && !validateFormat(formatSelect)) {
-    allValid = false;
+    allValid = true;
   }
 

[NoCoverage] BlockStatement
extension/src/options.ts:662:21
     "settings-log-level"
   ) as HTMLSelectElement;
 
-  if (formatSelect) {
-    formatSelect.addEventListener("change", () =>
-      updateFormatInfo(formatSelect)
-    );
-    updateFormatInfo(formatSelect); // Initial update
-  }
+  if (formatSelect) {}
 
   if (logLevelSelect) {

[NoCoverage] ArrowFunction
extension/src/options.ts:663:45
   ) as HTMLSelectElement;
 
   if (formatSelect) {
-    formatSelect.addEventListener("change", () =>
-      updateFormatInfo(formatSelect)
+    formatSelect.addEventListener("change", () => undefined
     );
     updateFormatInfo(formatSelect); // Initial update

[NoCoverage] BlockStatement
extension/src/options.ts:669:23
     updateFormatInfo(formatSelect); // Initial update
   }
 
-  if (logLevelSelect) {
-    logLevelSelect.addEventListener("change", () =>
-      updateLogLevelInfo(logLevelSelect)
-    );
-    updateLogLevelInfo(logLevelSelect); // Initial update
-  }
+  if (logLevelSelect) {}
 }
 

[NoCoverage] ArrowFunction
extension/src/options.ts:670:47
   }
 
   if (logLevelSelect) {
-    logLevelSelect.addEventListener("change", () =>
-      updateLogLevelInfo(logLevelSelect)
+    logLevelSelect.addEventListener("change", () => undefined
     );
     updateLogLevelInfo(logLevelSelect); // Initial update

[NoCoverage] BlockStatement
extension/src/options.ts:680:60
 /**
  * Updates the format info message based on selected format.
  */
-function updateFormatInfo(select: HTMLSelectElement): void {
-  const infoElement = document.getElementById("format-info");
-  if (!infoElement) return;
-
-  const infoText = infoElement.querySelector(".info-text") as HTMLElement;
-  if (!infoText) return;
-
-  const formatInfo: Record<string, string> = {
-    "bestvideo+bestaudio/best":
-      "Best quality with separate video and audio streams",
-    best: "Best available single file (may be lower quality)",
-    mp4: "MP4 format with best available quality",
-    webm: "WebM format with best available quality",
-    "bestaudio[ext=m4a]": "Audio only in M4A format",
-    "bestaudio[ext=opus]": "Audio only in Opus format",
-  };
-
-  infoText.textContent = formatInfo[select.value] || "Select a format option";
-}
+function updateFormatInfo(select: HTMLSelectElement): void {}
 
 /**

[NoCoverage] StringLiteral
extension/src/options.ts:681:47
  * Updates the format info message based on selected format.
  */
 function updateFormatInfo(select: HTMLSelectElement): void {
-  const infoElement = document.getElementById("format-info");
+  const infoElement = document.getElementById("");
   if (!infoElement) return;
 

[NoCoverage] ConditionalExpression
extension/src/options.ts:682:7
  */
 function updateFormatInfo(select: HTMLSelectElement): void {
   const infoElement = document.getElementById("format-info");
-  if (!infoElement) return;
+  if (true) return;
 
   const infoText = infoElement.querySelector(".info-text") as HTMLElement;

[NoCoverage] BooleanLiteral
extension/src/options.ts:682:7
  */
 function updateFormatInfo(select: HTMLSelectElement): void {
   const infoElement = document.getElementById("format-info");
-  if (!infoElement) return;
+  if (infoElement) return;
 
   const infoText = infoElement.querySelector(".info-text") as HTMLElement;

[NoCoverage] ConditionalExpression
extension/src/options.ts:685:7
   if (!infoElement) return;
 
   const infoText = infoElement.querySelector(".info-text") as HTMLElement;
-  if (!infoText) return;
+  if (true) return;
 
   const formatInfo: Record<string, string> = {

[NoCoverage] ConditionalExpression
extension/src/options.ts:685:7
   if (!infoElement) return;
 
   const infoText = infoElement.querySelector(".info-text") as HTMLElement;
-  if (!infoText) return;
+  if (false) return;
 
   const formatInfo: Record<string, string> = {

[NoCoverage] LogicalOperator
extension/src/options.ts:697:26
     "bestaudio[ext=opus]": "Audio only in Opus format",
   };
 
-  infoText.textContent = formatInfo[select.value] || "Select a format option";
+  infoText.textContent = formatInfo[select.value] && "Select a format option";
 }
 

[NoCoverage] ConditionalExpression
extension/src/options.ts:697:26
     "bestaudio[ext=opus]": "Audio only in Opus format",
   };
 
-  infoText.textContent = formatInfo[select.value] || "Select a format option";
+  infoText.textContent = true;
 }
 

[NoCoverage] BlockStatement
extension/src/options.ts:703:62
 /**
  * Updates the log level info message based on selected level.
  */
-function updateLogLevelInfo(select: HTMLSelectElement): void {
-  const infoElement = document.getElementById("log-level-info");
-  if (!infoElement) return;
-
-  const infoText = infoElement.querySelector(".info-text") as HTMLElement;
-  if (!infoText) return;
-
-  const levelInfo: Record<string, string> = {
-    error: "Only error messages will be logged",
-    info: "Normal level provides essential information",
-    debug: "Verbose logging for troubleshooting",
-  };
-
-  infoText.textContent = levelInfo[select.value] || "Select a log level";
-}
+function updateLogLevelInfo(select: HTMLSelectElement): void {}
 
 /**

[NoCoverage] ConditionalExpression
extension/src/options.ts:705:7
  */
 function updateLogLevelInfo(select: HTMLSelectElement): void {
   const infoElement = document.getElementById("log-level-info");
-  if (!infoElement) return;
+  if (false) return;
 
   const infoText = infoElement.querySelector(".info-text") as HTMLElement;

[NoCoverage] BooleanLiteral
extension/src/options.ts:705:7
  */
 function updateLogLevelInfo(select: HTMLSelectElement): void {
   const infoElement = document.getElementById("log-level-info");
-  if (!infoElement) return;
+  if (infoElement) return;
 
   const infoText = infoElement.querySelector(".info-text") as HTMLElement;

[NoCoverage] BooleanLiteral
extension/src/options.ts:708:7
   if (!infoElement) return;
 
   const infoText = infoElement.querySelector(".info-text") as HTMLElement;
-  if (!infoText) return;
+  if (infoText) return;
 
   const levelInfo: Record<string, string> = {

[NoCoverage] ConditionalExpression
extension/src/options.ts:716:26
     debug: "Verbose logging for troubleshooting",
   };
 
-  infoText.textContent = levelInfo[select.value] || "Select a log level";
+  infoText.textContent = true;
 }
 

[NoCoverage] ConditionalExpression
extension/src/options.ts:716:26
     debug: "Verbose logging for troubleshooting",
   };
 
-  infoText.textContent = levelInfo[select.value] || "Select a log level";
+  infoText.textContent = false;
 }
 

[NoCoverage] BlockStatement
extension/src/options.ts:727:25
   const tabs = document.querySelectorAll(".tab-button");
   const tabContents = document.querySelectorAll(".tab-content");
 
-  tabs.forEach((tab) => {
-    tab.addEventListener("click", () => {
-      // Remove active class from all tabs
-      tabs.forEach((t) => t.classList.remove("active"));
-      tabContents.forEach((content) => content.classList.remove("active"));
-
-      // Add active class to current tab
-      tab.classList.add("active");
-
-      // Show corresponding content
-      const target = tab.getAttribute("data-tab");
-      if (target) {
-        const content = document.getElementById(target);
-        if (content) content.classList.add("active");
-      }
-    });
-  });
+  tabs.forEach((tab) => {});
 }
 

[NoCoverage] BlockStatement
extension/src/options.ts:728:41
   const tabContents = document.querySelectorAll(".tab-content");
 
   tabs.forEach((tab) => {
-    tab.addEventListener("click", () => {
-      // Remove active class from all tabs
-      tabs.forEach((t) => t.classList.remove("active"));
-      tabContents.forEach((content) => content.classList.remove("active"));
-
-      // Add active class to current tab
-      tab.classList.add("active");
-
-      // Show corresponding content
-      const target = tab.getAttribute("data-tab");
-      if (target) {
-        const content = document.getElementById(target);
-        if (content) content.classList.add("active");
-      }
-    });
+    tab.addEventListener("click", () => {});
   });
 }

[NoCoverage] StringLiteral
extension/src/options.ts:728:26
   const tabContents = document.querySelectorAll(".tab-content");
 
   tabs.forEach((tab) => {
-    tab.addEventListener("click", () => {
+    tab.addEventListener("", () => {
       // Remove active class from all tabs
       tabs.forEach((t) => t.classList.remove("active"));

[NoCoverage] ArrowFunction
extension/src/options.ts:730:20
   tabs.forEach((tab) => {
     tab.addEventListener("click", () => {
       // Remove active class from all tabs
-      tabs.forEach((t) => t.classList.remove("active"));
+      tabs.forEach(() => undefined);
       tabContents.forEach((content) => content.classList.remove("active"));
 

[NoCoverage] StringLiteral
extension/src/options.ts:730:46
   tabs.forEach((tab) => {
     tab.addEventListener("click", () => {
       // Remove active class from all tabs
-      tabs.forEach((t) => t.classList.remove("active"));
+      tabs.forEach((t) => t.classList.remove(""));
       tabContents.forEach((content) => content.classList.remove("active"));
 

[NoCoverage] ArrowFunction
extension/src/options.ts:731:27
     tab.addEventListener("click", () => {
       // Remove active class from all tabs
       tabs.forEach((t) => t.classList.remove("active"));
-      tabContents.forEach((content) => content.classList.remove("active"));
+      tabContents.forEach(() => undefined);
 
       // Add active class to current tab

[NoCoverage] StringLiteral
extension/src/options.ts:731:65
     tab.addEventListener("click", () => {
       // Remove active class from all tabs
       tabs.forEach((t) => t.classList.remove("active"));
-      tabContents.forEach((content) => content.classList.remove("active"));
+      tabContents.forEach((content) => content.classList.remove(""));
 
       // Add active class to current tab

[NoCoverage] ConditionalExpression
extension/src/options.ts:738:11
 
       // Show corresponding content
       const target = tab.getAttribute("data-tab");
-      if (target) {
+      if (true) {
         const content = document.getElementById(target);
         if (content) content.classList.add("active");

[NoCoverage] BlockStatement
extension/src/options.ts:738:19
 
       // Show corresponding content
       const target = tab.getAttribute("data-tab");
-      if (target) {
-        const content = document.getElementById(target);
-        if (content) content.classList.add("active");
-      }
+      if (target) {}
     });
   });

[NoCoverage] ConditionalExpression
extension/src/options.ts:740:13
       const target = tab.getAttribute("data-tab");
       if (target) {
         const content = document.getElementById(target);
-        if (content) content.classList.add("active");
+        if (true) content.classList.add("active");
       }
     });

[NoCoverage] ConditionalExpression
extension/src/options.ts:740:13
       const target = tab.getAttribute("data-tab");
       if (target) {
         const content = document.getElementById(target);
-        if (content) content.classList.add("active");
+        if (false) content.classList.add("active");
       }
     });

[NoCoverage] BlockStatement
extension/src/options.ts:750:75
  * Sets up message listener to handle server discovery notifications.
  */
 export function setupMessageListener(): void {
-  chrome.runtime.onMessage.addListener((message, sender, sendResponse) => {
-    if (message.type === "serverDiscovered") {
-      logger.debug(
-        "Server discovered notification received, refreshing settings"
-      );
-      // Refresh settings when server is discovered
-      loadSettings();
-    } else if (message.type === "serverStatusUpdate") {
-      updateOptionsServerStatus(message.status);
-    }
-  });
+  chrome.runtime.onMessage.addListener((message, sender, sendResponse) => {});
 }
 

[NoCoverage] EqualityOperator
extension/src/options.ts:751:9
  */
 export function setupMessageListener(): void {
   chrome.runtime.onMessage.addListener((message, sender, sendResponse) => {
-    if (message.type === "serverDiscovered") {
+    if (message.type !== "serverDiscovered") {
       logger.debug(
         "Server discovered notification received, refreshing settings"

[NoCoverage] ConditionalExpression
extension/src/options.ts:751:9
  */
 export function setupMessageListener(): void {
   chrome.runtime.onMessage.addListener((message, sender, sendResponse) => {
-    if (message.type === "serverDiscovered") {
+    if (true) {
       logger.debug(
         "Server discovered notification received, refreshing settings"

[NoCoverage] StringLiteral
extension/src/options.ts:753:9
   chrome.runtime.onMessage.addListener((message, sender, sendResponse) => {
     if (message.type === "serverDiscovered") {
       logger.debug(
-        "Server discovered notification received, refreshing settings"
+        ""
       );
       // Refresh settings when server is discovered

[NoCoverage] ConditionalExpression
extension/src/options.ts:757:16
       );
       // Refresh settings when server is discovered
       loadSettings();
-    } else if (message.type === "serverStatusUpdate") {
+    } else if (true) {
       updateOptionsServerStatus(message.status);
     }

[NoCoverage] BlockStatement
extension/src/options.ts:757:55
       );
       // Refresh settings when server is discovered
       loadSettings();
-    } else if (message.type === "serverStatusUpdate") {
-      updateOptionsServerStatus(message.status);
-    }
+    } else if (message.type === "serverStatusUpdate") {}
   });
 }

[Killed] BooleanLiteral
extension/src/options.ts:770:7
   event.preventDefault();
 
   // Validate all fields before saving
-  if (!validateAllFields()) {
+  if (validateAllFields()) {
     setStatus(
       "settings-status",
killedBy: Options Script Unit Tests Settings Management should save settings successfully
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Settings saved successfully"
Received string:    "Please fix validation errors before saving"

[Killed] ConditionalExpression
extension/src/options.ts:770:7
   event.preventDefault();
 
   // Validate all fields before saving
-  if (!validateAllFields()) {
+  if (false) {
     setStatus(
       "settings-status",
killedBy: Options Script Unit Tests Error Handling should handle validation errors
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Please fix validation errors"
Received string:    "Error saving settings: Storage error"

[Killed] StringLiteral
extension/src/options.ts:772:7
   // Validate all fields before saving
   if (!validateAllFields()) {
     setStatus(
-      "settings-status",
+      "",
       "Please fix validation errors before saving",
       true
killedBy: Options Script Unit Tests Error Handling should handle validation errors
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Please fix validation errors"
Received string:    ""

[Killed] StringLiteral
extension/src/options.ts:773:7
   if (!validateAllFields()) {
     setStatus(
       "settings-status",
-      "Please fix validation errors before saving",
+      "",
       true
     );
killedBy: Options Script Unit Tests Error Handling should handle validation errors
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Please fix validation errors"
Received string:    ""

[Survived] BooleanLiteral
extension/src/options.ts:774:7
     setStatus(
       "settings-status",
       "Please fix validation errors before saving",
-      true
+      false
     );
     return;
