[Survived] BooleanLiteral
extension/src/options.ts:785:25
   const originalText = saveButton.innerHTML;
 
   // Show saving state
-  saveButton.disabled = true;
+  saveButton.disabled = false;
   saveButton.innerHTML = '<span class="btn-icon"></span>Saving...';
   setStatus("settings-status", "Saving settings...", false);

[Survived] StringLiteral
extension/src/options.ts:786:26
 
   // Show saving state
   saveButton.disabled = true;
-  saveButton.innerHTML = '<span class="btn-icon"></span>Saving...';
+  saveButton.innerHTML = "";
   setStatus("settings-status", "Saving settings...", false);
 

[Survived] BooleanLiteral
extension/src/options.ts:787:54
   // Show saving state
   saveButton.disabled = true;
   saveButton.innerHTML = '<span class="btn-icon"></span>Saving...';
-  setStatus("settings-status", "Saving settings...", false);
+  setStatus("settings-status", "Saving settings...", true);
 
   try {

[Survived] StringLiteral
extension/src/options.ts:787:13
   // Show saving state
   saveButton.disabled = true;
   saveButton.innerHTML = '<span class="btn-icon"></span>Saving...';
-  setStatus("settings-status", "Saving settings...", false);
+  setStatus("", "Saving settings...", false);
 
   try {

[Survived] ConditionalExpression
extension/src/options.ts:796:19
     const config: ServerConfig = {
       server_port: parseInt(formData.get("server-port") as string, 10),
       download_dir: formData.get("download-dir") as string,
-      debug_mode: formData.get("enable-debug") === "on",
+      debug_mode: true,
       enable_history: formData.get("enable-history") === "on",
       log_level: formData.get("log-level") as string,

[Survived] ConditionalExpression
extension/src/options.ts:796:19
     const config: ServerConfig = {
       server_port: parseInt(formData.get("server-port") as string, 10),
       download_dir: formData.get("download-dir") as string,
-      debug_mode: formData.get("enable-debug") === "on",
+      debug_mode: false,
       enable_history: formData.get("enable-history") === "on",
       log_level: formData.get("log-level") as string,

[Survived] ConditionalExpression
extension/src/options.ts:797:23
       server_port: parseInt(formData.get("server-port") as string, 10),
       download_dir: formData.get("download-dir") as string,
       debug_mode: formData.get("enable-debug") === "on",
-      enable_history: formData.get("enable-history") === "on",
+      enable_history: true,
       log_level: formData.get("log-level") as string,
       console_log_level: "info", // Default console log level

[Survived] ConditionalExpression
extension/src/options.ts:797:23
       server_port: parseInt(formData.get("server-port") as string, 10),
       download_dir: formData.get("download-dir") as string,
       debug_mode: formData.get("enable-debug") === "on",
-      enable_history: formData.get("enable-history") === "on",
+      enable_history: false,
       log_level: formData.get("log-level") as string,
       console_log_level: "info", // Default console log level

[Survived] StringLiteral
extension/src/options.ts:799:26
       debug_mode: formData.get("enable-debug") === "on",
       enable_history: formData.get("enable-history") === "on",
       log_level: formData.get("log-level") as string,
-      console_log_level: "info", // Default console log level
+      console_log_level: "", // Default console log level
       yt_dlp_options: {
         format: formData.get("ytdlp-format") as string,

[Survived] ConditionalExpression
extension/src/options.ts:803:24
       yt_dlp_options: {
         format: formData.get("ytdlp-format") as string,
       },
-      allow_playlists: formData.get("allow-playlists") === "on",
+      allow_playlists: false,
     };
 

[Survived] EqualityOperator
extension/src/options.ts:803:24
       yt_dlp_options: {
         format: formData.get("ytdlp-format") as string,
       },
-      allow_playlists: formData.get("allow-playlists") === "on",
+      allow_playlists: formData.get("allow-playlists") !== "on",
     };
 

[Timeout] BlockStatement
extension/src/options.ts:807:50
     };
 
     // Save to local storage first
-    await new Promise<void>((resolve, reject) => {
-      chrome.storage.local.set({ serverConfig: config }, () => {
-        if (chrome.runtime.lastError) {
-          reject(new Error(chrome.runtime.lastError.message));
-        } else {
-          resolve();
-        }
-      });
-    });
+    await new Promise<void>((resolve, reject) => {});
 
     // Send to server

[Timeout] BlockStatement
extension/src/options.ts:808:64
 
     // Save to local storage first
     await new Promise<void>((resolve, reject) => {
-      chrome.storage.local.set({ serverConfig: config }, () => {
-        if (chrome.runtime.lastError) {
-          reject(new Error(chrome.runtime.lastError.message));
-        } else {
-          resolve();
-        }
-      });
+      chrome.storage.local.set({ serverConfig: config }, () => {});
     });
 

[Survived] ObjectLiteral
extension/src/options.ts:808:32
 
     // Save to local storage first
     await new Promise<void>((resolve, reject) => {
-      chrome.storage.local.set({ serverConfig: config }, () => {
+      chrome.storage.local.set({}, () => {
         if (chrome.runtime.lastError) {
           reject(new Error(chrome.runtime.lastError.message));

[Killed] ConditionalExpression
extension/src/options.ts:809:13
     // Save to local storage first
     await new Promise<void>((resolve, reject) => {
       chrome.storage.local.set({ serverConfig: config }, () => {
-        if (chrome.runtime.lastError) {
+        if (true) {
           reject(new Error(chrome.runtime.lastError.message));
         } else {
killedBy: Options Script Unit Tests Settings Management should save settings successfully
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Settings saved successfully"
Received string:    "Error saving settings: Cannot read properties of null (reading 'message')"

[Survived] ConditionalExpression
extension/src/options.ts:809:13
     // Save to local storage first
     await new Promise<void>((resolve, reject) => {
       chrome.storage.local.set({ serverConfig: config }, () => {
-        if (chrome.runtime.lastError) {
+        if (false) {
           reject(new Error(chrome.runtime.lastError.message));
         } else {

[Killed] BlockStatement
extension/src/options.ts:811:16
       chrome.storage.local.set({ serverConfig: config }, () => {
         if (chrome.runtime.lastError) {
           reject(new Error(chrome.runtime.lastError.message));
-        } else {
-          resolve();
-        }
+        } else {}
       });
     });
killedBy: Options Script Unit Tests Settings Management should save settings successfully
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
extension/src/options.ts:818:66
     });
 
     // Send to server
-    const response = await new Promise<any>((resolve, reject) => {
-      chrome.runtime.sendMessage({ type: "setConfig", config }, (response) => {
-        if (chrome.runtime.lastError) {
-          reject(new Error(chrome.runtime.lastError.message));
-        } else {
-          resolve(response);
-        }
-      });
-    });
+    const response = await new Promise<any>((resolve, reject) => {});
 
     if (response && response.status === "success") {
killedBy: Options Script Unit Tests Settings Management should save settings successfully
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Timeout] BlockStatement
extension/src/options.ts:819:79
 
     // Send to server
     const response = await new Promise<any>((resolve, reject) => {
-      chrome.runtime.sendMessage({ type: "setConfig", config }, (response) => {
-        if (chrome.runtime.lastError) {
-          reject(new Error(chrome.runtime.lastError.message));
-        } else {
-          resolve(response);
-        }
-      });
+      chrome.runtime.sendMessage({ type: "setConfig", config }, (response) => {});
     });
 

[Killed] ConditionalExpression
extension/src/options.ts:820:13
     // Send to server
     const response = await new Promise<any>((resolve, reject) => {
       chrome.runtime.sendMessage({ type: "setConfig", config }, (response) => {
-        if (chrome.runtime.lastError) {
+        if (true) {
           reject(new Error(chrome.runtime.lastError.message));
         } else {
killedBy: Options Script Unit Tests Settings Management should save settings successfully
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Settings saved successfully"
Received string:    "Error saving settings: Cannot read properties of null (reading 'message')"

[NoCoverage] BlockStatement
extension/src/options.ts:820:39
     // Send to server
     const response = await new Promise<any>((resolve, reject) => {
       chrome.runtime.sendMessage({ type: "setConfig", config }, (response) => {
-        if (chrome.runtime.lastError) {
-          reject(new Error(chrome.runtime.lastError.message));
-        } else {
+        if (chrome.runtime.lastError) {} else {
           resolve(response);
         }

[Timeout] BlockStatement
extension/src/options.ts:822:16
       chrome.runtime.sendMessage({ type: "setConfig", config }, (response) => {
         if (chrome.runtime.lastError) {
           reject(new Error(chrome.runtime.lastError.message));
-        } else {
-          resolve(response);
-        }
+        } else {}
       });
     });

[Killed] BlockStatement
extension/src/options.ts:828:52
       });
     });
 
-    if (response && response.status === "success") {
-      // Show success state with enhanced visual feedback
-      showSaveSuccess();
-      setStatus("settings-status", "Settings saved successfully!", false);
-
-      // Log the successful save
-      logger.log("Settings saved successfully", { config });
-    } else {
+    if (response && response.status === "success") {} else {
       throw new Error(response?.message || "Failed to save settings to server");
     }
killedBy: Options Script Unit Tests Settings Management should save settings successfully
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Settings saved successfully"
Received string:    "Saving settings..."

[Killed] EqualityOperator
extension/src/options.ts:828:21
       });
     });
 
-    if (response && response.status === "success") {
+    if (response && response.status !== "success") {
       // Show success state with enhanced visual feedback
       showSaveSuccess();
killedBy: Options Script Unit Tests Settings Management should save settings successfully
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Settings saved successfully"
Received string:    "Error saving settings: Failed to save settings to server"

[Survived] BooleanLiteral
extension/src/options.ts:831:68
     if (response && response.status === "success") {
       // Show success state with enhanced visual feedback
       showSaveSuccess();
-      setStatus("settings-status", "Settings saved successfully!", false);
+      setStatus("settings-status", "Settings saved successfully!", true);
 
       // Log the successful save

[Survived] ObjectLiteral
extension/src/options.ts:834:49
       setStatus("settings-status", "Settings saved successfully!", false);
 
       // Log the successful save
-      logger.log("Settings saved successfully", { config });
+      logger.log("Settings saved successfully", {});
     } else {
       throw new Error(response?.message || "Failed to save settings to server");

[NoCoverage] BlockStatement
extension/src/options.ts:835:12
 
       // Log the successful save
       logger.log("Settings saved successfully", { config });
-    } else {
-      throw new Error(response?.message || "Failed to save settings to server");
-    }
+    } else {}
   } catch (error) {
     logger.error("Failed to save settings:", error);

[NoCoverage] OptionalChaining
extension/src/options.ts:836:23
       // Log the successful save
       logger.log("Settings saved successfully", { config });
     } else {
-      throw new Error(response?.message || "Failed to save settings to server");
+      throw new Error(response.message || "Failed to save settings to server");
     }
   } catch (error) {

[NoCoverage] LogicalOperator
extension/src/options.ts:836:23
       // Log the successful save
       logger.log("Settings saved successfully", { config });
     } else {
-      throw new Error(response?.message || "Failed to save settings to server");
+      throw new Error(response?.message && "Failed to save settings to server");
     }
   } catch (error) {

[Killed] BlockStatement
extension/src/options.ts:838:19
     } else {
       throw new Error(response?.message || "Failed to save settings to server");
     }
-  } catch (error) {
-    logger.error("Failed to save settings:", error);
-    setStatus(
-      "settings-status",
-      "Error saving settings: " +
-        (error instanceof Error ? error.message : "Unknown error"),
-      true
-    );
-
-    // Show error state
-    showSaveError();
-  } finally {
+  } catch (error) {} finally {
     // Restore button state
     saveButton.disabled = false;
killedBy: Options Script Unit Tests Settings Management should handle save errors gracefully
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Error saving settings"
Received string:    "Saving settings..."

[Survived] StringLiteral
extension/src/options.ts:839:18
       throw new Error(response?.message || "Failed to save settings to server");
     }
   } catch (error) {
-    logger.error("Failed to save settings:", error);
+    logger.error("", error);
     setStatus(
       "settings-status",

[NoCoverage] StringLiteral
extension/src/options.ts:843:51
     setStatus(
       "settings-status",
       "Error saving settings: " +
-        (error instanceof Error ? error.message : "Unknown error"),
+        (error instanceof Error ? error.message : ""),
       true
     );

[Survived] BooleanLiteral
extension/src/options.ts:844:7
       "settings-status",
       "Error saving settings: " +
         (error instanceof Error ? error.message : "Unknown error"),
-      true
+      false
     );
 

[Survived] BlockStatement
extension/src/options.ts:849:13
 
     // Show error state
     showSaveError();
-  } finally {
-    // Restore button state
-    saveButton.disabled = false;
-    saveButton.innerHTML = originalText;
-  }
+  } finally {}
 }
 

[Survived] BooleanLiteral
extension/src/options.ts:851:27
     showSaveError();
   } finally {
     // Restore button state
-    saveButton.disabled = false;
+    saveButton.disabled = true;
     saveButton.innerHTML = originalText;
   }

[Killed] BooleanLiteral
extension/src/options.ts:863:7
   const container = document.querySelector(
     ".settings-container"
   ) as HTMLElement;
-  if (!container) return;
+  if (container) return;
 
   // Add success animation class
killedBy: Options Script Unit Tests Settings Management should save settings successfully
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Settings saved successfully"
Received string:    "Error saving settings: Cannot read properties of null (reading 'classList')"

[Killed] ConditionalExpression
extension/src/options.ts:863:7
   const container = document.querySelector(
     ".settings-container"
   ) as HTMLElement;
-  if (!container) return;
+  if (false) return;
 
   // Add success animation class
killedBy: Options Script Unit Tests Settings Management should save settings successfully
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Settings saved successfully"
Received string:    "Error saving settings: Cannot read properties of null (reading 'classList')"

[NoCoverage] StringLiteral
extension/src/options.ts:869:47
   container.classList.add("settings-saved");
 
   // Create success notification
-  const notification = document.createElement("div");
+  const notification = document.createElement("");
   notification.className = "save-notification success";
   notification.innerHTML =

[NoCoverage] StringLiteral
extension/src/options.ts:872:5
   const notification = document.createElement("div");
   notification.className = "save-notification success";
   notification.innerHTML =
-    '<div class="notification-content">' +
+    "" +
     '<span class="notification-icon">Success</span>' +
     '<div class="notification-text">' +

[NoCoverage] StringLiteral
extension/src/options.ts:877:5
     '<div class="notification-text">' +
     "<h4>Settings Saved!</h4>" +
     "<p>Your configuration has been updated successfully.</p>" +
-    "</div>" +
+    "" +
     "</div>";
 

[NoCoverage] BlockStatement
extension/src/options.ts:884:20
   document.body.appendChild(notification);
 
   // Animate in
-  setTimeout(() => {
-    notification.classList.add("show");
-  }, 100);
+  setTimeout(() => {}, 100);
 
   // Remove after 4 seconds

[NoCoverage] StringLiteral
extension/src/options.ts:885:32
 
   // Animate in
   setTimeout(() => {
-    notification.classList.add("show");
+    notification.classList.add("");
   }, 100);
 

[NoCoverage] BlockStatement
extension/src/options.ts:889:20
   }, 100);
 
   // Remove after 4 seconds
-  setTimeout(() => {
-    notification.classList.remove("show");
-    setTimeout(() => {
-      if (notification.parentNode) {
-        notification.parentNode.removeChild(notification);
-      }
-    }, 300);
-  }, 4000);
+  setTimeout(() => {}, 4000);
 
   // Remove animation class after animation completes

[NoCoverage] BlockStatement
extension/src/options.ts:891:22
   // Remove after 4 seconds
   setTimeout(() => {
     notification.classList.remove("show");
-    setTimeout(() => {
-      if (notification.parentNode) {
-        notification.parentNode.removeChild(notification);
-      }
-    }, 300);
+    setTimeout(() => {}, 300);
   }, 4000);
 

[NoCoverage] ConditionalExpression
extension/src/options.ts:892:11
   setTimeout(() => {
     notification.classList.remove("show");
     setTimeout(() => {
-      if (notification.parentNode) {
+      if (false) {
         notification.parentNode.removeChild(notification);
       }

[NoCoverage] ConditionalExpression
extension/src/options.ts:892:11
   setTimeout(() => {
     notification.classList.remove("show");
     setTimeout(() => {
-      if (notification.parentNode) {
+      if (true) {
         notification.parentNode.removeChild(notification);
       }

[NoCoverage] BlockStatement
extension/src/options.ts:899:20
   }, 4000);
 
   // Remove animation class after animation completes
-  setTimeout(() => {
-    container.classList.remove("settings-saved");
-  }, 1000);
+  setTimeout(() => {}, 1000);
 }
 

[NoCoverage] StringLiteral
extension/src/options.ts:900:32
 
   // Remove animation class after animation completes
   setTimeout(() => {
-    container.classList.remove("settings-saved");
+    container.classList.remove("");
   }, 1000);
 }

[Survived] StringLiteral
extension/src/options.ts:909:28
  */
 function showSaveError(): void {
   const notification = document.createElement("div");
-  notification.className = "save-notification error";
+  notification.className = "";
   notification.innerHTML =
     '<div class="notification-content">' +

[Survived] StringLiteral
extension/src/options.ts:913:5
   notification.innerHTML =
     '<div class="notification-content">' +
     '<span class="notification-icon">Error</span>' +
-    '<div class="notification-text">' +
+    "" +
     "<h4>Save Failed</h4>" +
     "<p>There was an error saving your settings. Please try again.</p>" +

[Survived] StringLiteral
extension/src/options.ts:918:5
     "<p>There was an error saving your settings. Please try again.</p>" +
     "</div>" +
     '<button class="notification-close" onclick="this.parentElement.parentElement.remove()"></button>' +
-    "</div>";
+    "";
 
   // Add to page

[NoCoverage] BlockStatement
extension/src/options.ts:929:20
   }, 100);
 
   // Auto-remove after 6 seconds (longer for errors)
-  setTimeout(() => {
-    notification.classList.remove("show");
-    setTimeout(() => {
-      if (notification.parentNode) {
-        notification.parentNode.removeChild(notification);
-      }
-    }, 300);
-  }, 6000);
+  setTimeout(() => {}, 6000);
 }
 

[NoCoverage] BlockStatement
extension/src/options.ts:932:36
   setTimeout(() => {
     notification.classList.remove("show");
     setTimeout(() => {
-      if (notification.parentNode) {
-        notification.parentNode.removeChild(notification);
-      }
+      if (notification.parentNode) {}
     }, 300);
   }, 6000);

[NoCoverage] BlockStatement
extension/src/options.ts:949:36
   ) as HTMLInputElement;
 
   // @ts-expect-error showDirectoryPicker is not available on all browsers
-  if (!window.showDirectoryPicker) {
-    setStatus(
-      "settings-status",
-      "Your browser does not support directory selection. Please manually enter the path.",
-      true
-    );
-    return;
-  }
+  if (!window.showDirectoryPicker) {}
 
   try {

[NoCoverage] ConditionalExpression
extension/src/options.ts:949:7
   ) as HTMLInputElement;
 
   // @ts-expect-error showDirectoryPicker is not available on all browsers
-  if (!window.showDirectoryPicker) {
+  if (true) {
     setStatus(
       "settings-status",

[NoCoverage] BooleanLiteral
extension/src/options.ts:953:7
     setStatus(
       "settings-status",
       "Your browser does not support directory selection. Please manually enter the path.",
-      true
+      false
     );
     return;

[NoCoverage] BlockStatement
extension/src/options.ts:958:7
     return;
   }
 
-  try {
-    // @ts-expect-error showDirectoryPicker is not available on all browsers
-    const dirHandle = await window.showDirectoryPicker();
-    if (downloadDirInput) {
-      // Note: This returns a handle, not a path. For security, browsers don't
-      // expose the full path. We'll use the name as a display placeholder.
-      // The actual path is handled internally by the browser.
-      downloadDirInput.value = dirHandle.name;
-      validateFolder(downloadDirInput);
-
-      // Provide user feedback about the limitation
-      setStatus(
-        "settings-status",
-        "Selected folder: " +
-          dirHandle.name +
-          ". For full compatibility, please manually enter the absolute path to this folder.",
-        false
-      );
-    }
-  } catch (error) {
+  try {} catch (error) {
     if (error instanceof DOMException && error.name === "AbortError") {
       logger.log("User aborted directory selection.");

[NoCoverage] ConditionalExpression
extension/src/options.ts:961:9
   try {
     // @ts-expect-error showDirectoryPicker is not available on all browsers
     const dirHandle = await window.showDirectoryPicker();
-    if (downloadDirInput) {
+    if (false) {
       // Note: This returns a handle, not a path. For security, browsers don't
       // expose the full path. We'll use the name as a display placeholder.

[NoCoverage] ConditionalExpression
extension/src/options.ts:961:9
   try {
     // @ts-expect-error showDirectoryPicker is not available on all browsers
     const dirHandle = await window.showDirectoryPicker();
-    if (downloadDirInput) {
+    if (true) {
       // Note: This returns a handle, not a path. For security, browsers don't
       // expose the full path. We'll use the name as a display placeholder.

[NoCoverage] StringLiteral
extension/src/options.ts:973:11
         "settings-status",
         "Selected folder: " +
           dirHandle.name +
-          ". For full compatibility, please manually enter the absolute path to this folder.",
+          "",
         false
       );

[NoCoverage] BooleanLiteral
extension/src/options.ts:974:9
         "Selected folder: " +
           dirHandle.name +
           ". For full compatibility, please manually enter the absolute path to this folder.",
-        false
+        true
       );
     }

[NoCoverage] BlockStatement
extension/src/options.ts:977:19
         false
       );
     }
-  } catch (error) {
-    if (error instanceof DOMException && error.name === "AbortError") {
-      logger.log("User aborted directory selection.");
-    } else {
-      logger.error("Error selecting directory:", error);
-      setStatus(
-        "settings-status",
-        "Failed to select directory. Please manually enter the path.",
-        true
-      );
-    }
-  }
+  } catch (error) {}
 }
 

[NoCoverage] ConditionalExpression
extension/src/options.ts:978:9
       );
     }
   } catch (error) {
-    if (error instanceof DOMException && error.name === "AbortError") {
+    if (false) {
       logger.log("User aborted directory selection.");
     } else {

[NoCoverage] EqualityOperator
extension/src/options.ts:978:42
       );
     }
   } catch (error) {
-    if (error instanceof DOMException && error.name === "AbortError") {
+    if (error instanceof DOMException && error.name !== "AbortError") {
       logger.log("User aborted directory selection.");
     } else {

[NoCoverage] StringLiteral
extension/src/options.ts:979:18
     }
   } catch (error) {
     if (error instanceof DOMException && error.name === "AbortError") {
-      logger.log("User aborted directory selection.");
+      logger.log("");
     } else {
       logger.error("Error selecting directory:", error);

[NoCoverage] BlockStatement
extension/src/options.ts:980:12
   } catch (error) {
     if (error instanceof DOMException && error.name === "AbortError") {
       logger.log("User aborted directory selection.");
-    } else {
-      logger.error("Error selecting directory:", error);
-      setStatus(
-        "settings-status",
-        "Failed to select directory. Please manually enter the path.",
-        true
-      );
-    }
+    } else {}
   }
 }

[NoCoverage] BooleanLiteral
extension/src/options.ts:985:9
       setStatus(
         "settings-status",
         "Failed to select directory. Please manually enter the path.",
-        true
+        false
       );
     }

[NoCoverage] BlockStatement
extension/src/options.ts:998:22
   const restartButton = document.getElementById(
     "restart-server"
   ) as HTMLButtonElement;
-  if (restartButton) {
-    restartButton.disabled = true;
-    restartButton.innerHTML = "Restarting...";
-  }
+  if (restartButton) {}
 
   chrome.runtime.sendMessage({ type: "restartServer" }, (response) => {

[NoCoverage] ConditionalExpression
extension/src/options.ts:998:7
   const restartButton = document.getElementById(
     "restart-server"
   ) as HTMLButtonElement;
-  if (restartButton) {
+  if (false) {
     restartButton.disabled = true;
     restartButton.innerHTML = "Restarting...";

[NoCoverage] BooleanLiteral
extension/src/options.ts:999:30
     "restart-server"
   ) as HTMLButtonElement;
   if (restartButton) {
-    restartButton.disabled = true;
+    restartButton.disabled = false;
     restartButton.innerHTML = "Restarting...";
   }

[NoCoverage] BlockStatement
extension/src/options.ts:1003:71
     restartButton.innerHTML = "Restarting...";
   }
 
-  chrome.runtime.sendMessage({ type: "restartServer" }, (response) => {
-    if (restartButton) {
-      restartButton.disabled = false;
-      restartButton.innerHTML = "Restart Server";
-    }
-
-    if (response && response.status === "success") {
-      setStatus("settings-status", "Server restarted successfully!");
-    } else {
-      setStatus(
-        "settings-status",
-        "Error: " + (response?.message || "Failed to restart server"),
-        true
-      );
-    }
-  });
+  chrome.runtime.sendMessage({ type: "restartServer" }, (response) => {});
 }
 

[NoCoverage] ObjectLiteral
extension/src/options.ts:1003:30
     restartButton.innerHTML = "Restarting...";
   }
 
-  chrome.runtime.sendMessage({ type: "restartServer" }, (response) => {
+  chrome.runtime.sendMessage({}, (response) => {
     if (restartButton) {
       restartButton.disabled = false;

[NoCoverage] ConditionalExpression
extension/src/options.ts:1004:9
   }
 
   chrome.runtime.sendMessage({ type: "restartServer" }, (response) => {
-    if (restartButton) {
+    if (false) {
       restartButton.disabled = false;
       restartButton.innerHTML = "Restart Server";

[NoCoverage] ConditionalExpression
extension/src/options.ts:1004:9
   }
 
   chrome.runtime.sendMessage({ type: "restartServer" }, (response) => {
-    if (restartButton) {
+    if (true) {
       restartButton.disabled = false;
       restartButton.innerHTML = "Restart Server";

[NoCoverage] BooleanLiteral
extension/src/options.ts:1005:32
 
   chrome.runtime.sendMessage({ type: "restartServer" }, (response) => {
     if (restartButton) {
-      restartButton.disabled = false;
+      restartButton.disabled = true;
       restartButton.innerHTML = "Restart Server";
     }

[NoCoverage] ConditionalExpression
extension/src/options.ts:1009:9
       restartButton.innerHTML = "Restart Server";
     }
 
-    if (response && response.status === "success") {
+    if (false) {
       setStatus("settings-status", "Server restarted successfully!");
     } else {

[NoCoverage] StringLiteral
extension/src/options.ts:1010:36
     }
 
     if (response && response.status === "success") {
-      setStatus("settings-status", "Server restarted successfully!");
+      setStatus("settings-status", "");
     } else {
       setStatus(
