[NoCoverage] BlockStatement
extension/src/options.ts:1011:12
 
     if (response && response.status === "success") {
       setStatus("settings-status", "Server restarted successfully!");
-    } else {
-      setStatus(
-        "settings-status",
-        "Error: " + (response?.message || "Failed to restart server"),
-        true
-      );
-    }
+    } else {}
   });
 }

[NoCoverage] LogicalOperator
extension/src/options.ts:1014:22
     } else {
       setStatus(
         "settings-status",
-        "Error: " + (response?.message || "Failed to restart server"),
+        "Error: " + (response?.message && "Failed to restart server"),
         true
       );

[NoCoverage] ConditionalExpression
extension/src/options.ts:1014:22
     } else {
       setStatus(
         "settings-status",
-        "Error: " + (response?.message || "Failed to restart server"),
+        "Error: " + (false),
         true
       );

[NoCoverage] BooleanLiteral
extension/src/options.ts:1015:9
       setStatus(
         "settings-status",
         "Error: " + (response?.message || "Failed to restart server"),
-        true
+        false
       );
     }

[Killed] BlockStatement
extension/src/options.ts:1026:79
  * @param page Page number for pagination
  * @param perPage Items per page
  */
-export async function loadErrorHistory(page = 1, perPage = 25): Promise<void> {
-  const { history, totalItems } = await fetchHistory(page, perPage);
-  const errorEntries = history.filter((item) => item.status === "error");
-  const listEl = document.getElementById("error-history-list");
-  if (!listEl) return;
-  // Render only error entries
-  renderHistoryItems(errorEntries, page, perPage, errorEntries.length, listEl);
-}
+export async function loadErrorHistory(page = 1, perPage = 25): Promise<void> {}
 
 /**
killedBy: loadErrorHistory fetches history and renders only error entries
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 2, 5

Number of calls: 0

[Killed] ConditionalExpression
extension/src/options.ts:1028:49
  */
 export async function loadErrorHistory(page = 1, perPage = 25): Promise<void> {
   const { history, totalItems } = await fetchHistory(page, perPage);
-  const errorEntries = history.filter((item) => item.status === "error");
+  const errorEntries = history.filter((item) => false);
   const listEl = document.getElementById("error-history-list");
   if (!listEl) return;
killedBy: loadErrorHistory fetches history and renders only error entries
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Array [
-   Object {
-     "status": "error",

[Killed] ArrowFunction
extension/src/options.ts:1028:39
  */
 export async function loadErrorHistory(page = 1, perPage = 25): Promise<void> {
   const { history, totalItems } = await fetchHistory(page, perPage);
-  const errorEntries = history.filter((item) => item.status === "error");
+  const errorEntries = history.filter(() => undefined);
   const listEl = document.getElementById("error-history-list");
   if (!listEl) return;
killedBy: loadErrorHistory fetches history and renders only error entries
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Array [
-   Object {
-     "status": "error",

[Killed] BooleanLiteral
extension/src/options.ts:1030:7
   const { history, totalItems } = await fetchHistory(page, perPage);
   const errorEntries = history.filter((item) => item.status === "error");
   const listEl = document.getElementById("error-history-list");
-  if (!listEl) return;
+  if (listEl) return;
   // Render only error entries
   renderHistoryItems(errorEntries, page, perPage, errorEntries.length, listEl);
killedBy: loadErrorHistory fetches history and renders only error entries
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [{"status": "error"}], 2, 5, 1, <ul id="error-history-list" />

Number of calls: 0

[Killed] ConditionalExpression
extension/src/options.ts:1030:7
   const { history, totalItems } = await fetchHistory(page, perPage);
   const errorEntries = history.filter((item) => item.status === "error");
   const listEl = document.getElementById("error-history-list");
-  if (!listEl) return;
+  if (true) return;
   // Render only error entries
   renderHistoryItems(errorEntries, page, perPage, errorEntries.length, listEl);
killedBy: loadErrorHistory fetches history and renders only error entries
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [{"status": "error"}], 2, 5, 1, <ul id="error-history-list" />

Number of calls: 0

[Killed] ConditionalExpression
extension/src/options.ts:1042:5
  */
 export function applyOptionsTheme(forceTheme?: Theme): void {
   const isDark =
-    forceTheme === "dark" ||
-    (!forceTheme && window.matchMedia("(prefers-color-scheme: dark)").matches);
+    true;
 
   // Applying theme
killedBy: Options Script Unit Tests Theme Management applyOptionsTheme should apply theme classes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
extension/src/options.ts:1042:5
  */
 export function applyOptionsTheme(forceTheme?: Theme): void {
   const isDark =
-    forceTheme === "dark" ||
-    (!forceTheme && window.matchMedia("(prefers-color-scheme: dark)").matches);
+    false;
 
   // Applying theme
killedBy: Options Script Unit Tests Theme Management applyOptionsTheme should apply theme classes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] BooleanLiteral
extension/src/options.ts:1043:6
 export function applyOptionsTheme(forceTheme?: Theme): void {
   const isDark =
     forceTheme === "dark" ||
-    (!forceTheme && window.matchMedia("(prefers-color-scheme: dark)").matches);
+    (forceTheme && window.matchMedia("(prefers-color-scheme: dark)").matches);
 
   // Applying theme

[Survived] ConditionalExpression
extension/src/options.ts:1043:6
 export function applyOptionsTheme(forceTheme?: Theme): void {
   const isDark =
     forceTheme === "dark" ||
-    (!forceTheme && window.matchMedia("(prefers-color-scheme: dark)").matches);
+    (false);
 
   // Applying theme

[Killed] StringLiteral
extension/src/options.ts:1047:34
 
   // Applying theme
 
-  document.body.classList.toggle("dark-theme", isDark);
+  document.body.classList.toggle("", isDark);
 
   // Update header icon based on theme
killedBy: Options Script Unit Tests Theme Management applyOptionsTheme should apply theme classes
statusReason: SyntaxError: The token provided must not be empty.

[Killed] ConditionalExpression
extension/src/options.ts:1053:7
   const headerIcon = document.getElementById(
     "options-header-icon"
   ) as HTMLImageElement;
-  if (headerIcon) {
+  if (true) {
     const currentSrc = headerIcon.src;
     const isCurrentlyDark = currentSrc.includes("darkicon");
killedBy: Options Script Unit Tests Theme Management applyOptionsTheme should apply theme classes
statusReason: TypeError: Cannot read properties of null (reading 'src')

[NoCoverage] BlockStatement
extension/src/options.ts:1053:19
   const headerIcon = document.getElementById(
     "options-header-icon"
   ) as HTMLImageElement;
-  if (headerIcon) {
-    const currentSrc = headerIcon.src;
-    const isCurrentlyDark = currentSrc.includes("darkicon");
-    // Header icon update
-
-    if (isDark !== isCurrentlyDark) {
-      const newSrc = currentSrc.replace(
-        isCurrentlyDark ? "darkicon48.png" : "icon48.png",
-        isDark ? "darkicon48.png" : "icon48.png"
-      );
-      // Updating icon
-      headerIcon.src = newSrc;
-    }
-  }
+  if (headerIcon) {}
 }
 

[NoCoverage] StringLiteral
extension/src/options.ts:1055:49
   ) as HTMLImageElement;
   if (headerIcon) {
     const currentSrc = headerIcon.src;
-    const isCurrentlyDark = currentSrc.includes("darkicon");
+    const isCurrentlyDark = currentSrc.includes("");
     // Header icon update
 

[NoCoverage] ConditionalExpression
extension/src/options.ts:1058:9
     const isCurrentlyDark = currentSrc.includes("darkicon");
     // Header icon update
 
-    if (isDark !== isCurrentlyDark) {
+    if (true) {
       const newSrc = currentSrc.replace(
         isCurrentlyDark ? "darkicon48.png" : "icon48.png",

[NoCoverage] ConditionalExpression
extension/src/options.ts:1058:9
     const isCurrentlyDark = currentSrc.includes("darkicon");
     // Header icon update
 
-    if (isDark !== isCurrentlyDark) {
+    if (false) {
       const newSrc = currentSrc.replace(
         isCurrentlyDark ? "darkicon48.png" : "icon48.png",

[NoCoverage] StringLiteral
extension/src/options.ts:1061:37
     if (isDark !== isCurrentlyDark) {
       const newSrc = currentSrc.replace(
         isCurrentlyDark ? "darkicon48.png" : "icon48.png",
-        isDark ? "darkicon48.png" : "icon48.png"
+        isDark ? "darkicon48.png" : ""
       );
       // Updating icon

[NoCoverage] StringLiteral
extension/src/options.ts:1061:18
     if (isDark !== isCurrentlyDark) {
       const newSrc = currentSrc.replace(
         isCurrentlyDark ? "darkicon48.png" : "icon48.png",
-        isDark ? "darkicon48.png" : "icon48.png"
+        isDark ? "" : "icon48.png"
       );
       // Updating icon

[Killed] ConditionalExpression
extension/src/options.ts:1084:9
 
     // Determine new theme
     let newTheme: Theme;
-    if (currentTheme === "dark") {
+    if (true) {
       newTheme = "light";
     } else if (currentTheme === "light") {
killedBy: Options Script Unit Tests Theme Management handleThemeToggle should toggle theme
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "dark"
Received: "light"

[Killed] EqualityOperator
extension/src/options.ts:1084:9
 
     // Determine new theme
     let newTheme: Theme;
-    if (currentTheme === "dark") {
+    if (currentTheme !== "dark") {
       newTheme = "light";
     } else if (currentTheme === "light") {
killedBy: Options Script Unit Tests Theme Management handleThemeToggle should toggle theme
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "dark"
Received: "light"

[Killed] BlockStatement
extension/src/options.ts:1086:42
     let newTheme: Theme;
     if (currentTheme === "dark") {
       newTheme = "light";
-    } else if (currentTheme === "light") {
-      newTheme = "dark";
-    } else {
+    } else if (currentTheme === "light") {} else {
       // If no theme is stored, check system preference and invert it
       const systemPrefersDark = window.matchMedia(
killedBy: Options Script Unit Tests Theme Management handleThemeToggle should toggle theme
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "dark"
Received: undefined

[Survived] EqualityOperator
extension/src/options.ts:1086:16
     let newTheme: Theme;
     if (currentTheme === "dark") {
       newTheme = "light";
-    } else if (currentTheme === "light") {
+    } else if (currentTheme !== "light") {
       newTheme = "dark";
     } else {

[Timeout] StringLiteral
extension/src/options.ts:1087:18
     if (currentTheme === "dark") {
       newTheme = "light";
     } else if (currentTheme === "light") {
-      newTheme = "dark";
+      newTheme = "";
     } else {
       // If no theme is stored, check system preference and invert it

[NoCoverage] BlockStatement
extension/src/options.ts:1088:12
       newTheme = "light";
     } else if (currentTheme === "light") {
       newTheme = "dark";
-    } else {
-      // If no theme is stored, check system preference and invert it
-      const systemPrefersDark = window.matchMedia(
-        "(prefers-color-scheme: dark)"
-      ).matches;
-      newTheme = systemPrefersDark ? "light" : "dark";
-    }
+    } else {}
 
     // New theme will be

[NoCoverage] StringLiteral
extension/src/options.ts:1091:9
     } else {
       // If no theme is stored, check system preference and invert it
       const systemPrefersDark = window.matchMedia(
-        "(prefers-color-scheme: dark)"
+        ""
       ).matches;
       newTheme = systemPrefersDark ? "light" : "dark";

[NoCoverage] BlockStatement
extension/src/options.ts:1106:19
 
     // Log the theme change
     // Theme changed
-  } catch (error) {
-    console.error("Error toggling theme:", error);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
extension/src/options.ts:1121:22
     const result = await chrome.storage.local.get("theme");
     const storedTheme = result.theme as Theme | undefined;
 
-    if (storedTheme) {
-      // Use stored preference
-      applyOptionsTheme(storedTheme);
-    } else {
+    if (storedTheme) {} else {
       // Use system preference
       applyOptionsTheme();

[NoCoverage] BlockStatement
extension/src/options.ts:1128:19
       // Use system preference
       applyOptionsTheme();
     }
-  } catch (error) {
-    console.error("Error initializing theme:", error);
-    // Fallback to system preference
-    applyOptionsTheme();
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
extension/src/options.ts:1137:40
 
 // Initialize options page when loaded
 // In a test environment, DOMContentLoaded may have already fired.
-if (document.readyState === "loading") {
-  document.addEventListener("DOMContentLoaded", initOptionsPage);
-} else if (typeof initOptionsPage === "function") {
+if (document.readyState === "loading") {} else if (typeof initOptionsPage === "function") {
   // If used in tests or after page load, init directly
   initOptionsPage();
