[Survived] BlockStatement
extension/src/popup.ts:41:22
   isError = false,
   duration = 3000
 ): ReturnType<typeof setTimeout> | null {
-  if (statusTimeout) {
-    clearTimeout(statusTimeout);
-  }
+  if (statusTimeout) {}
 
   const statusEl = document.getElementById("status");

[Survived] ConditionalExpression
extension/src/popup.ts:41:7
   isError = false,
   duration = 3000
 ): ReturnType<typeof setTimeout> | null {
-  if (statusTimeout) {
+  if (false) {
     clearTimeout(statusTimeout);
   }

[Killed] ConditionalExpression
extension/src/popup.ts:46:7
   }
 
   const statusEl = document.getElementById("status");
-  if (statusEl) {
+  if (false) {
     statusEl.textContent = message;
     statusEl.className = isError ? "status-error" : "status-success";
killedBy: Popup Script Tests Status Management should set status message
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Test message"
Received: ""

[Survived] ConditionalExpression
extension/src/popup.ts:46:7
   }
 
   const statusEl = document.getElementById("status");
-  if (statusEl) {
+  if (true) {
     statusEl.textContent = message;
     statusEl.className = isError ? "status-error" : "status-success";

[Killed] StringLiteral
extension/src/popup.ts:48:36
   const statusEl = document.getElementById("status");
   if (statusEl) {
     statusEl.textContent = message;
-    statusEl.className = isError ? "status-error" : "status-success";
+    statusEl.className = isError ? "" : "status-success";
 
     if (isError) {
killedBy: Popup Script Tests Status Management should set error status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "status-error"
Received: ""

[Killed] BlockStatement
extension/src/popup.ts:50:18
     statusEl.textContent = message;
     statusEl.className = isError ? "status-error" : "status-success";
 
-    if (isError) {
-      const tip = document.createElement("div");
-      tip.className = "error-tip";
-      tip.textContent = "Tip: check your network connection and try again";
-      statusEl.appendChild(tip);
-    }
+    if (isError) {}
 
     statusTimeout = setTimeout(() => {
killedBy: Popup Script Tests Status Management should set error status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Error messageTip: check your network connection and try again"
Received: "Error message"

[Killed] ConditionalExpression
extension/src/popup.ts:50:9
     statusEl.textContent = message;
     statusEl.className = isError ? "status-error" : "status-success";
 
-    if (isError) {
+    if (true) {
       const tip = document.createElement("div");
       tip.className = "error-tip";
killedBy: Popup Script Tests Status Management should set status message
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Test message"
Received: "Test messageTip: check your network connection and try again"

[Killed] StringLiteral
extension/src/popup.ts:51:42
     statusEl.className = isError ? "status-error" : "status-success";
 
     if (isError) {
-      const tip = document.createElement("div");
+      const tip = document.createElement("");
       tip.className = "error-tip";
       tip.textContent = "Tip: check your network connection and try again";
killedBy: Popup Script Tests Status Management should set error status
statusReason: InvalidCharacterError: "" did not match the Name production

[Killed] BlockStatement
extension/src/popup.ts:57:38
       statusEl.appendChild(tip);
     }
 
-    statusTimeout = setTimeout(() => {
-      statusEl.textContent = "";
-      statusEl.className = "";
-      statusTimeout = null;
-    }, duration);
+    statusTimeout = setTimeout(() => {}, duration);
     return statusTimeout;
   }
killedBy: Popup Util Functions setStatus should display error message with prefix and tip and clear after timeout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "fail<div class=\"error-tip\">Tip: check your network connection and try again</div>"

[Survived] StringLiteral
extension/src/popup.ts:59:28
 
     statusTimeout = setTimeout(() => {
       statusEl.textContent = "";
-      statusEl.className = "";
+      statusEl.className = "Stryker was here!";
       statusTimeout = null;
     }, duration);

[Killed] BlockStatement
extension/src/popup.ts:78:19
 ): Promise<void> {
   let isDark: boolean;
 
-  if (forceTheme) {
-    isDark = forceTheme === "dark";
-  } else {
+  if (forceTheme) {} else {
     // Get stored theme preference
     const result = await chrome.storage.local.get("theme");
killedBy: Popup Script Tests Theme Management should apply dark theme
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Timeout] ConditionalExpression
extension/src/popup.ts:78:7
 ): Promise<void> {
   let isDark: boolean;
 
-  if (forceTheme) {
+  if (true) {
     isDark = forceTheme === "dark";
   } else {

[Timeout] ConditionalExpression
extension/src/popup.ts:79:14
   let isDark: boolean;
 
   if (forceTheme) {
-    isDark = forceTheme === "dark";
+    isDark = true;
   } else {
     // Get stored theme preference

[Timeout] ConditionalExpression
extension/src/popup.ts:79:14
   let isDark: boolean;
 
   if (forceTheme) {
-    isDark = forceTheme === "dark";
+    isDark = false;
   } else {
     // Get stored theme preference

[Survived] BlockStatement
extension/src/popup.ts:80:10
 
   if (forceTheme) {
     isDark = forceTheme === "dark";
-  } else {
-    // Get stored theme preference
-    const result = await chrome.storage.local.get("theme");
-    const storedTheme = result.theme as "light" | "dark" | undefined;
-
-    if (storedTheme) {
-      isDark = storedTheme === "dark";
-    } else {
-      // Fallback to system preference
-      isDark = window.matchMedia("(prefers-color-scheme: dark)").matches;
-    }
-  }
+  } else {}
 
   document.body.classList.toggle("dark-theme", isDark);

[Survived] StringLiteral
extension/src/popup.ts:82:51
     isDark = forceTheme === "dark";
   } else {
     // Get stored theme preference
-    const result = await chrome.storage.local.get("theme");
+    const result = await chrome.storage.local.get("");
     const storedTheme = result.theme as "light" | "dark" | undefined;
 

[Timeout] ConditionalExpression
extension/src/popup.ts:85:9
     const result = await chrome.storage.local.get("theme");
     const storedTheme = result.theme as "light" | "dark" | undefined;
 
-    if (storedTheme) {
+    if (false) {
       isDark = storedTheme === "dark";
     } else {

[Survived] EqualityOperator
extension/src/popup.ts:86:16
     const storedTheme = result.theme as "light" | "dark" | undefined;
 
     if (storedTheme) {
-      isDark = storedTheme === "dark";
+      isDark = storedTheme !== "dark";
     } else {
       // Fallback to system preference

[Timeout] ConditionalExpression
extension/src/popup.ts:86:16
     const storedTheme = result.theme as "light" | "dark" | undefined;
 
     if (storedTheme) {
-      isDark = storedTheme === "dark";
+      isDark = true;
     } else {
       // Fallback to system preference

[NoCoverage] BlockStatement
extension/src/popup.ts:87:12
 
     if (storedTheme) {
       isDark = storedTheme === "dark";
-    } else {
-      // Fallback to system preference
-      isDark = window.matchMedia("(prefers-color-scheme: dark)").matches;
-    }
+    } else {}
   }
 

[NoCoverage] StringLiteral
extension/src/popup.ts:89:34
       isDark = storedTheme === "dark";
     } else {
       // Fallback to system preference
-      isDark = window.matchMedia("(prefers-color-scheme: dark)").matches;
+      isDark = window.matchMedia("").matches;
     }
   }

[Killed] BlockStatement
extension/src/popup.ts:97:13
 
   // Update logo src based on theme
   const logo = document.querySelector("img[src*='icon']") as HTMLImageElement;
-  if (logo) {
-    const currentSrc = logo.src;
-    const isCurrentlyDark = currentSrc.includes("darkicon");
-    if (isDark !== isCurrentlyDark) {
-      logo.src = currentSrc.replace(
-        isCurrentlyDark ? "darkicon" : "icon",
-        isDark ? "darkicon" : "icon"
-      );
-    }
-  }
+  if (logo) {}
 }
 
killedBy: Popup Util Functions applyPopupTheme should toggle dark theme on and off
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /darkicons\/icon48\.png$/
Received string:  "http://localhost/extension/icons/icon48.png"

[Timeout] ConditionalExpression
extension/src/popup.ts:97:7
 
   // Update logo src based on theme
   const logo = document.querySelector("img[src*='icon']") as HTMLImageElement;
-  if (logo) {
+  if (false) {
     const currentSrc = logo.src;
     const isCurrentlyDark = currentSrc.includes("darkicon");

[Killed] BlockStatement
extension/src/popup.ts:100:37
   if (logo) {
     const currentSrc = logo.src;
     const isCurrentlyDark = currentSrc.includes("darkicon");
-    if (isDark !== isCurrentlyDark) {
-      logo.src = currentSrc.replace(
-        isCurrentlyDark ? "darkicon" : "icon",
-        isDark ? "darkicon" : "icon"
-      );
-    }
+    if (isDark !== isCurrentlyDark) {}
   }
 }
killedBy: Popup Util Functions applyPopupTheme should toggle dark theme on and off
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /darkicons\/icon48\.png$/
Received string:  "http://localhost/extension/icons/icon48.png"

[Killed] EqualityOperator
extension/src/popup.ts:100:9
   if (logo) {
     const currentSrc = logo.src;
     const isCurrentlyDark = currentSrc.includes("darkicon");
-    if (isDark !== isCurrentlyDark) {
+    if (isDark === isCurrentlyDark) {
       logo.src = currentSrc.replace(
         isCurrentlyDark ? "darkicon" : "icon",
killedBy: Popup Util Functions applyPopupTheme should toggle dark theme on and off
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /darkicons\/icon48\.png$/
Received string:  "http://localhost/extension/icons/icon48.png"

[NoCoverage] ConditionalExpression
extension/src/popup.ts:126:7
   let isDisabled: boolean | undefined;
 
   // Handle the overloaded function signature
-  if (typeof buttonIdOrState === "boolean") {
+  if (false) {
     // First parameter is the state
     isActive = buttonIdOrState;

[NoCoverage] ConditionalExpression
extension/src/popup.ts:126:7
   let isDisabled: boolean | undefined;
 
   // Handle the overloaded function signature
-  if (typeof buttonIdOrState === "boolean") {
+  if (true) {
     // First parameter is the state
     isActive = buttonIdOrState;

[NoCoverage] ConditionalExpression
extension/src/popup.ts:130:7
     // First parameter is the state
     isActive = buttonIdOrState;
     buttonId =
-      (isActiveOrButtonId as string) || "toggle-enhanced-download-button";
+      true;
   } else if (
     typeof buttonIdOrState === "string" &&

[NoCoverage] LogicalOperator
extension/src/popup.ts:130:7
     // First parameter is the state
     isActive = buttonIdOrState;
     buttonId =
-      (isActiveOrButtonId as string) || "toggle-enhanced-download-button";
+      isActiveOrButtonId as string && "toggle-enhanced-download-button";
   } else if (
     typeof buttonIdOrState === "string" &&

[NoCoverage] LogicalOperator
extension/src/popup.ts:132:5
     buttonId =
       (isActiveOrButtonId as string) || "toggle-enhanced-download-button";
   } else if (
-    typeof buttonIdOrState === "string" &&
-    typeof isActiveOrButtonId === "string"
+    typeof buttonIdOrState === "string" || typeof isActiveOrButtonId === "string"
   ) {
     // First parameter is the button text, second is also a string (button ID)

[NoCoverage] ConditionalExpression
extension/src/popup.ts:132:5
     buttonId =
       (isActiveOrButtonId as string) || "toggle-enhanced-download-button";
   } else if (
-    typeof buttonIdOrState === "string" &&
-    typeof isActiveOrButtonId === "string"
+    false
   ) {
     // First parameter is the button text, second is also a string (button ID)

[NoCoverage] ConditionalExpression
extension/src/popup.ts:133:5
       (isActiveOrButtonId as string) || "toggle-enhanced-download-button";
   } else if (
     typeof buttonIdOrState === "string" &&
-    typeof isActiveOrButtonId === "string"
+    true
   ) {
     // First parameter is the button text, second is also a string (button ID)

[NoCoverage] EqualityOperator
extension/src/popup.ts:133:5
       (isActiveOrButtonId as string) || "toggle-enhanced-download-button";
   } else if (
     typeof buttonIdOrState === "string" &&
-    typeof isActiveOrButtonId === "string"
+    typeof isActiveOrButtonId !== "string"
   ) {
     // First parameter is the button text, second is also a string (button ID)

[NoCoverage] BlockStatement
extension/src/popup.ts:134:5
   } else if (
     typeof buttonIdOrState === "string" &&
     typeof isActiveOrButtonId === "string"
-  ) {
-    // First parameter is the button text, second is also a string (button ID)
-    buttonText = buttonIdOrState;
-    buttonId = isActiveOrButtonId;
-    isActive = false; // Custom text mode disables the button
-    isDisabled = true;
-  } else {
+  ) {} else {
     // First parameter is the button ID, second is the state
     buttonId = buttonIdOrState;

[NoCoverage] BooleanLiteral
extension/src/popup.ts:138:16
     // First parameter is the button text, second is also a string (button ID)
     buttonText = buttonIdOrState;
     buttonId = isActiveOrButtonId;
-    isActive = false; // Custom text mode disables the button
+    isActive = true; // Custom text mode disables the button
     isDisabled = true;
   } else {

[NoCoverage] BooleanLiteral
extension/src/popup.ts:139:18
     buttonText = buttonIdOrState;
     buttonId = isActiveOrButtonId;
     isActive = false; // Custom text mode disables the button
-    isDisabled = true;
+    isDisabled = false;
   } else {
     // First parameter is the button ID, second is the state

[NoCoverage] BlockStatement
extension/src/popup.ts:140:10
     buttonId = isActiveOrButtonId;
     isActive = false; // Custom text mode disables the button
     isDisabled = true;
-  } else {
-    // First parameter is the button ID, second is the state
-    buttonId = buttonIdOrState;
-    isActive = (isActiveOrButtonId as boolean) || false;
-  }
+  } else {}
 
   const button = document.getElementById(buttonId) as HTMLButtonElement;

[NoCoverage] BooleanLiteral
extension/src/popup.ts:143:51
   } else {
     // First parameter is the button ID, second is the state
     buttonId = buttonIdOrState;
-    isActive = (isActiveOrButtonId as boolean) || false;
+    isActive = (isActiveOrButtonId as boolean) || true;
   }
 

[NoCoverage] LogicalOperator
extension/src/popup.ts:143:16
   } else {
     // First parameter is the button ID, second is the state
     buttonId = buttonIdOrState;
-    isActive = (isActiveOrButtonId as boolean) || false;
+    isActive = isActiveOrButtonId as boolean && false;
   }
 

[NoCoverage] ConditionalExpression
extension/src/popup.ts:147:7
   }
 
   const button = document.getElementById(buttonId) as HTMLButtonElement;
-  if (!button) {
+  if (false) {
     logger.error("Toggle button with ID " + buttonId + " not found");
     return;

[NoCoverage] BooleanLiteral
extension/src/popup.ts:147:7
   }
 
   const button = document.getElementById(buttonId) as HTMLButtonElement;
-  if (!button) {
+  if (button) {
     logger.error("Toggle button with ID " + buttonId + " not found");
     return;

[NoCoverage] StringLiteral
extension/src/popup.ts:148:18
 
   const button = document.getElementById(buttonId) as HTMLButtonElement;
   if (!button) {
-    logger.error("Toggle button with ID " + buttonId + " not found");
+    logger.error("" + buttonId + " not found");
     return;
   }

[NoCoverage] StringLiteral
extension/src/popup.ts:153:27
   }
 
   // Update button state
-  button.classList.toggle("active", isActive);
+  button.classList.toggle("", isActive);
   button.setAttribute("aria-pressed", isActive.toString());
 

[NoCoverage] StringLiteral
extension/src/popup.ts:154:23
 
   // Update button state
   button.classList.toggle("active", isActive);
-  button.setAttribute("aria-pressed", isActive.toString());
+  button.setAttribute("", isActive.toString());
 
   // Update button text based on state

[NoCoverage] EqualityOperator
extension/src/popup.ts:157:7
   button.setAttribute("aria-pressed", isActive.toString());
 
   // Update button text based on state
-  if (buttonText !== undefined) {
+  if (buttonText === undefined) {
     button.textContent = buttonText;
   } else {

[NoCoverage] ConditionalExpression
extension/src/popup.ts:157:7
   button.setAttribute("aria-pressed", isActive.toString());
 
   // Update button text based on state
-  if (buttonText !== undefined) {
+  if (true) {
     button.textContent = buttonText;
   } else {

[NoCoverage] BlockStatement
extension/src/popup.ts:159:10
   // Update button text based on state
   if (buttonText !== undefined) {
     button.textContent = buttonText;
-  } else {
-    button.textContent = isActive ? "HIDE" : "SHOW";
-  }
+  } else {}
 
   // Update disabled state if specified

[NoCoverage] ConditionalExpression
extension/src/popup.ts:164:7
   }
 
   // Update disabled state if specified
-  if (isDisabled !== undefined) {
+  if (true) {
     button.disabled = isDisabled;
   }

[NoCoverage] BlockStatement
extension/src/popup.ts:164:33
   }
 
   // Update disabled state if specified
-  if (isDisabled !== undefined) {
-    button.disabled = isDisabled;
-  }
+  if (isDisabled !== undefined) {}
 }
 

[Survived] ConditionalExpression
extension/src/popup.ts:182:7
   limit: number = 5
 ): void {
   const container = document.getElementById(containerId);
-  if (!container) {
+  if (true) {
     logger.error("History container with ID " + containerId + " not found");
     return;

[Survived] ConditionalExpression
extension/src/popup.ts:182:7
   limit: number = 5
 ): void {
   const container = document.getElementById(containerId);
-  if (!container) {
+  if (false) {
     logger.error("History container with ID " + containerId + " not found");
     return;

[Survived] StringLiteral
extension/src/popup.ts:188:25
   }
 
   // Clear existing history items
-  container.innerHTML = "";
+  container.innerHTML = "Stryker was here!";
 
   // Fetch history entries from storage

[Survived] StringLiteral
extension/src/popup.ts:191:29
   container.innerHTML = "";
 
   // Fetch history entries from storage
-  chrome.storage.local.get(["downloadHistory"], (result) => {
+  chrome.storage.local.get([""], (result) => {
     const history: HistoryEntry[] = result.downloadHistory || [];
     const recentEntries = history.slice(0, limit);

[Killed] ConditionalExpression
extension/src/popup.ts:192:37
 
   // Fetch history entries from storage
   chrome.storage.local.get(["downloadHistory"], (result) => {
-    const history: HistoryEntry[] = result.downloadHistory || [];
+    const history: HistoryEntry[] = false;
     const recentEntries = history.slice(0, limit);
 
killedBy: Popup Script Tests History Management should handle storage errors gracefully
statusReason: TypeError: history.slice is not a function

[Killed] LogicalOperator
extension/src/popup.ts:192:37
 
   // Fetch history entries from storage
   chrome.storage.local.get(["downloadHistory"], (result) => {
-    const history: HistoryEntry[] = result.downloadHistory || [];
+    const history: HistoryEntry[] = result.downloadHistory && [];
     const recentEntries = history.slice(0, limit);
 
killedBy: Popup Script Tests History Management should handle storage errors gracefully
statusReason: TypeError: Cannot read properties of undefined (reading 'slice')

[Survived] MethodExpression
extension/src/popup.ts:193:27
   // Fetch history entries from storage
   chrome.storage.local.get(["downloadHistory"], (result) => {
     const history: HistoryEntry[] = result.downloadHistory || [];
-    const recentEntries = history.slice(0, limit);
+    const recentEntries = history;
 
     if (recentEntries.length === 0) {

[Survived] EqualityOperator
extension/src/popup.ts:195:9
     const history: HistoryEntry[] = result.downloadHistory || [];
     const recentEntries = history.slice(0, limit);
 
-    if (recentEntries.length === 0) {
+    if (recentEntries.length !== 0) {
       // Display message when no history exists
       const emptyMessage = document.createElement("div");

[Survived] ConditionalExpression
extension/src/popup.ts:195:9
     const history: HistoryEntry[] = result.downloadHistory || [];
     const recentEntries = history.slice(0, limit);
 
-    if (recentEntries.length === 0) {
+    if (true) {
       // Display message when no history exists
       const emptyMessage = document.createElement("div");

[Killed] StringLiteral
extension/src/popup.ts:197:51
 
     if (recentEntries.length === 0) {
       // Display message when no history exists
-      const emptyMessage = document.createElement("div");
+      const emptyMessage = document.createElement("");
       emptyMessage.className = "history-empty";
       emptyMessage.textContent = "No download history yet";
killedBy: Popup Script Tests History Management should handle storage errors gracefully
statusReason: InvalidCharacterError: "" did not match the Name production

[NoCoverage] BlockStatement
extension/src/popup.ts:205:38
     }
 
     // Create history items
-    recentEntries.forEach((entry) => {
-      const item = document.createElement("div");
-      item.className = "history-item status-" + entry.status;
-
-      const title = document.createElement("div");
-      title.className = "history-title";
-      title.textContent = entry.page_title || "Unknown video";
-
-      const meta = document.createElement("div");
-      meta.className = "history-meta";
-      meta.textContent =
-        entry.status +
-        "  " +
-        new Date(entry.timestamp || Date.now()).toLocaleString();
-
-      item.appendChild(title);
-      item.appendChild(meta);
-      container.appendChild(item);
-    });
+    recentEntries.forEach((entry) => {});
 
     logger.debug("Rendered " + recentEntries.length + " history entries");

[NoCoverage] StringLiteral
extension/src/popup.ts:206:43
 
     // Create history items
     recentEntries.forEach((entry) => {
-      const item = document.createElement("div");
+      const item = document.createElement("");
       item.className = "history-item status-" + entry.status;
 

[NoCoverage] StringLiteral
extension/src/popup.ts:207:24
     // Create history items
     recentEntries.forEach((entry) => {
       const item = document.createElement("div");
-      item.className = "history-item status-" + entry.status;
+      item.className = "" + entry.status;
 
       const title = document.createElement("div");

[NoCoverage] StringLiteral
extension/src/popup.ts:209:44
       const item = document.createElement("div");
       item.className = "history-item status-" + entry.status;
 
-      const title = document.createElement("div");
+      const title = document.createElement("");
       title.className = "history-title";
       title.textContent = entry.page_title || "Unknown video";

[NoCoverage] StringLiteral
extension/src/popup.ts:210:25
       item.className = "history-item status-" + entry.status;
 
       const title = document.createElement("div");
-      title.className = "history-title";
+      title.className = "";
       title.textContent = entry.page_title || "Unknown video";
 

[NoCoverage] ConditionalExpression
extension/src/popup.ts:211:27
 
       const title = document.createElement("div");
       title.className = "history-title";
-      title.textContent = entry.page_title || "Unknown video";
+      title.textContent = true;
 
       const meta = document.createElement("div");

[NoCoverage] LogicalOperator
extension/src/popup.ts:211:27
 
       const title = document.createElement("div");
       title.className = "history-title";
-      title.textContent = entry.page_title || "Unknown video";
+      title.textContent = entry.page_title && "Unknown video";
 
       const meta = document.createElement("div");

[NoCoverage] LogicalOperator
extension/src/popup.ts:218:18
       meta.textContent =
         entry.status +
         "  " +
-        new Date(entry.timestamp || Date.now()).toLocaleString();
+        new Date(entry.timestamp && Date.now()).toLocaleString();
 
       item.appendChild(title);

[NoCoverage] ConditionalExpression
extension/src/popup.ts:218:18
       meta.textContent =
         entry.status +
         "  " +
-        new Date(entry.timestamp || Date.now()).toLocaleString();
+        new Date(false).toLocaleString();
 
       item.appendChild(title);

[Killed] BlockStatement
extension/src/popup.ts:230:50
 }
 
 // Load configuration from server or fallback to local storage
-export async function loadConfig(): Promise<any> {
-  return new Promise((resolve) => {
-    chrome.runtime.sendMessage({ type: "getConfig" }, (response: any) => {
-      if (!chrome.runtime.lastError && response && response.serverConfig) {
-        resolve(response.serverConfig);
-      } else {
-        chrome.storage.local.get("extensionConfig", (result: any) => {
-          resolve(result.extensionConfig);
-        });
-      }
-    });
-  });
-}
+export async function loadConfig(): Promise<any> {}
 
 // Update download directory display element
killedBy: loadConfig resolves serverConfig on success
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"test": true}
Received: undefined

[Timeout] BlockStatement
extension/src/popup.ts:231:35
 
 // Load configuration from server or fallback to local storage
 export async function loadConfig(): Promise<any> {
-  return new Promise((resolve) => {
-    chrome.runtime.sendMessage({ type: "getConfig" }, (response: any) => {
-      if (!chrome.runtime.lastError && response && response.serverConfig) {
-        resolve(response.serverConfig);
-      } else {
-        chrome.storage.local.get("extensionConfig", (result: any) => {
-          resolve(result.extensionConfig);
-        });
-      }
-    });
-  });
+  return new Promise((resolve) => {});
 }
 

[Timeout] BlockStatement
extension/src/popup.ts:232:74
 // Load configuration from server or fallback to local storage
 export async function loadConfig(): Promise<any> {
   return new Promise((resolve) => {
-    chrome.runtime.sendMessage({ type: "getConfig" }, (response: any) => {
-      if (!chrome.runtime.lastError && response && response.serverConfig) {
-        resolve(response.serverConfig);
-      } else {
-        chrome.storage.local.get("extensionConfig", (result: any) => {
-          resolve(result.extensionConfig);
-        });
-      }
-    });
+    chrome.runtime.sendMessage({ type: "getConfig" }, (response: any) => {});
   });
 }

[Timeout] ObjectLiteral
extension/src/popup.ts:232:32
 // Load configuration from server or fallback to local storage
 export async function loadConfig(): Promise<any> {
   return new Promise((resolve) => {
-    chrome.runtime.sendMessage({ type: "getConfig" }, (response: any) => {
+    chrome.runtime.sendMessage({}, (response: any) => {
       if (!chrome.runtime.lastError && response && response.serverConfig) {
         resolve(response.serverConfig);

[Killed] LogicalOperator
extension/src/popup.ts:233:11
 export async function loadConfig(): Promise<any> {
   return new Promise((resolve) => {
     chrome.runtime.sendMessage({ type: "getConfig" }, (response: any) => {
-      if (!chrome.runtime.lastError && response && response.serverConfig) {
+      if (!chrome.runtime.lastError || response && response.serverConfig) {
         resolve(response.serverConfig);
       } else {
killedBy: loadConfig falls back to storage when runtime.lastError set
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "foo": "bar",
+   "test": true,

[Killed] ConditionalExpression
extension/src/popup.ts:233:11
 export async function loadConfig(): Promise<any> {
   return new Promise((resolve) => {
     chrome.runtime.sendMessage({ type: "getConfig" }, (response: any) => {
-      if (!chrome.runtime.lastError && response && response.serverConfig) {
+      if (true) {
         resolve(response.serverConfig);
       } else {
killedBy: loadConfig falls back to storage when runtime.lastError set
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "foo": "bar",
+   "test": true,

[Timeout] BlockStatement
extension/src/popup.ts:235:14
     chrome.runtime.sendMessage({ type: "getConfig" }, (response: any) => {
       if (!chrome.runtime.lastError && response && response.serverConfig) {
         resolve(response.serverConfig);
-      } else {
-        chrome.storage.local.get("extensionConfig", (result: any) => {
-          resolve(result.extensionConfig);
-        });
-      }
+      } else {}
     });
   });

[Timeout] BlockStatement
extension/src/popup.ts:236:70
       if (!chrome.runtime.lastError && response && response.serverConfig) {
         resolve(response.serverConfig);
       } else {
-        chrome.storage.local.get("extensionConfig", (result: any) => {
-          resolve(result.extensionConfig);
-        });
+        chrome.storage.local.get("extensionConfig", (result: any) => {});
       }
     });
