[Killed] BlockStatement
extension/src/popup.ts:245:65
 }
 
 // Update download directory display element
-export async function updateDownloadDirDisplay(): Promise<void> {
-  const el = document.getElementById("download-dir-display");
-  if (!el) return;
-  return new Promise((resolve) => {
-    chrome.runtime.sendMessage({ type: "getConfig" }, (response: any) => {
-      if (!chrome.runtime.lastError && response && response.serverConfig) {
-        el.textContent = "Saving to: " + response.serverConfig.download_dir;
-        resolve();
-      } else {
-        chrome.storage.local.get("extensionConfig", (result: any) => {
-          const cfg = result.extensionConfig || {};
-          el.textContent = "Saving to: " + (cfg.download_dir || "");
-          resolve();
-        });
-      }
-    });
-  });
-}
+export async function updateDownloadDirDisplay(): Promise<void> {}
 
 // Update server port display element
killedBy: updateDownloadDirDisplay updates text when element present
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Saving to: /tmp"
Received: ""

[Killed] ConditionalExpression
extension/src/popup.ts:247:7
 // Update download directory display element
 export async function updateDownloadDirDisplay(): Promise<void> {
   const el = document.getElementById("download-dir-display");
-  if (!el) return;
+  if (false) return;
   return new Promise((resolve) => {
     chrome.runtime.sendMessage({ type: "getConfig" }, (response: any) => {
killedBy: updateDownloadDirDisplay no-op when element missing
statusReason: Error: expect(received).resolves.toBeUndefined()

Received promise rejected instead of resolved
Rejected to value: [TypeError: Cannot set properties of null (setting 'textContent')]

[Killed] ConditionalExpression
extension/src/popup.ts:247:7
 // Update download directory display element
 export async function updateDownloadDirDisplay(): Promise<void> {
   const el = document.getElementById("download-dir-display");
-  if (!el) return;
+  if (true) return;
   return new Promise((resolve) => {
     chrome.runtime.sendMessage({ type: "getConfig" }, (response: any) => {
killedBy: updateDownloadDirDisplay updates text when element present
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Saving to: /tmp"
Received: ""

[Killed] BlockStatement
extension/src/popup.ts:248:35
 export async function updateDownloadDirDisplay(): Promise<void> {
   const el = document.getElementById("download-dir-display");
   if (!el) return;
-  return new Promise((resolve) => {
-    chrome.runtime.sendMessage({ type: "getConfig" }, (response: any) => {
-      if (!chrome.runtime.lastError && response && response.serverConfig) {
-        el.textContent = "Saving to: " + response.serverConfig.download_dir;
-        resolve();
-      } else {
-        chrome.storage.local.get("extensionConfig", (result: any) => {
-          const cfg = result.extensionConfig || {};
-          el.textContent = "Saving to: " + (cfg.download_dir || "");
-          resolve();
-        });
-      }
-    });
-  });
+  return new Promise((resolve) => {});
 }
 
killedBy: updateDownloadDirDisplay updates text when element present
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
extension/src/popup.ts:249:74
   const el = document.getElementById("download-dir-display");
   if (!el) return;
   return new Promise((resolve) => {
-    chrome.runtime.sendMessage({ type: "getConfig" }, (response: any) => {
-      if (!chrome.runtime.lastError && response && response.serverConfig) {
-        el.textContent = "Saving to: " + response.serverConfig.download_dir;
-        resolve();
-      } else {
-        chrome.storage.local.get("extensionConfig", (result: any) => {
-          const cfg = result.extensionConfig || {};
-          el.textContent = "Saving to: " + (cfg.download_dir || "");
-          resolve();
-        });
-      }
-    });
+    chrome.runtime.sendMessage({ type: "getConfig" }, (response: any) => {});
   });
 }
killedBy: updateDownloadDirDisplay updates text when element present
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] StringLiteral
extension/src/popup.ts:249:40
   const el = document.getElementById("download-dir-display");
   if (!el) return;
   return new Promise((resolve) => {
-    chrome.runtime.sendMessage({ type: "getConfig" }, (response: any) => {
+    chrome.runtime.sendMessage({ type: "" }, (response: any) => {
       if (!chrome.runtime.lastError && response && response.serverConfig) {
         el.textContent = "Saving to: " + response.serverConfig.download_dir;

[Survived] LogicalOperator
extension/src/popup.ts:250:11
   if (!el) return;
   return new Promise((resolve) => {
     chrome.runtime.sendMessage({ type: "getConfig" }, (response: any) => {
-      if (!chrome.runtime.lastError && response && response.serverConfig) {
+      if (!chrome.runtime.lastError && response || response.serverConfig) {
         el.textContent = "Saving to: " + response.serverConfig.download_dir;
         resolve();

[Killed] BlockStatement
extension/src/popup.ts:253:14
       if (!chrome.runtime.lastError && response && response.serverConfig) {
         el.textContent = "Saving to: " + response.serverConfig.download_dir;
         resolve();
-      } else {
-        chrome.storage.local.get("extensionConfig", (result: any) => {
-          const cfg = result.extensionConfig || {};
-          el.textContent = "Saving to: " + (cfg.download_dir || "");
-          resolve();
-        });
-      }
+      } else {}
     });
   });
killedBy: updateDownloadDirDisplay updates text when element present
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Timeout] BlockStatement
extension/src/popup.ts:254:70
         el.textContent = "Saving to: " + response.serverConfig.download_dir;
         resolve();
       } else {
-        chrome.storage.local.get("extensionConfig", (result: any) => {
-          const cfg = result.extensionConfig || {};
-          el.textContent = "Saving to: " + (cfg.download_dir || "");
-          resolve();
-        });
+        chrome.storage.local.get("extensionConfig", (result: any) => {});
       }
     });

[Killed] ConditionalExpression
extension/src/popup.ts:255:23
         resolve();
       } else {
         chrome.storage.local.get("extensionConfig", (result: any) => {
-          const cfg = result.extensionConfig || {};
+          const cfg = false;
           el.textContent = "Saving to: " + (cfg.download_dir || "");
           resolve();
killedBy: updateDownloadDirDisplay updates text when element present
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Saving to: /tmp"
Received: "Saving to: "

[Killed] ConditionalExpression
extension/src/popup.ts:255:23
         resolve();
       } else {
         chrome.storage.local.get("extensionConfig", (result: any) => {
-          const cfg = result.extensionConfig || {};
+          const cfg = true;
           el.textContent = "Saving to: " + (cfg.download_dir || "");
           resolve();
killedBy: updateDownloadDirDisplay updates text when element present
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Saving to: /tmp"
Received: "Saving to: "

[Killed] LogicalOperator
extension/src/popup.ts:256:45
       } else {
         chrome.storage.local.get("extensionConfig", (result: any) => {
           const cfg = result.extensionConfig || {};
-          el.textContent = "Saving to: " + (cfg.download_dir || "");
+          el.textContent = "Saving to: " + (cfg.download_dir && "");
           resolve();
         });
killedBy: updateDownloadDirDisplay updates text when element present
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Saving to: /tmp"
Received: "Saving to: "

[Killed] ConditionalExpression
extension/src/popup.ts:256:45
       } else {
         chrome.storage.local.get("extensionConfig", (result: any) => {
           const cfg = result.extensionConfig || {};
-          el.textContent = "Saving to: " + (cfg.download_dir || "");
+          el.textContent = "Saving to: " + (false);
           resolve();
         });
killedBy: updateDownloadDirDisplay updates text when element present
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Saving to: /tmp"
Received: "Saving to: false"

[Killed] BlockStatement
extension/src/popup.ts:265:58
 }
 
 // Update server port display element
-export async function updatePortDisplay(): Promise<void> {
-  const el = document.getElementById("server-port-display");
-  if (!el) return;
-  return new Promise((resolve) => {
-    chrome.runtime.sendMessage({ type: "getConfig" }, (response: any) => {
-      if (!chrome.runtime.lastError && response && response.serverConfig) {
-        el.textContent = "Server Port: " + response.serverConfig.server_port;
-      }
-      resolve();
-    });
-  });
-}
+export async function updatePortDisplay(): Promise<void> {}
 
 // Show configuration error if present in local storage
killedBy: updatePortDisplay updates text on presence
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Server Port: 1234"
Received: ""

[Killed] StringLiteral
extension/src/popup.ts:266:38
 
 // Update server port display element
 export async function updatePortDisplay(): Promise<void> {
-  const el = document.getElementById("server-port-display");
+  const el = document.getElementById("");
   if (!el) return;
   return new Promise((resolve) => {
killedBy: updatePortDisplay updates text on presence
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Server Port: 1234"
Received: ""

[Killed] BooleanLiteral
extension/src/popup.ts:267:7
 // Update server port display element
 export async function updatePortDisplay(): Promise<void> {
   const el = document.getElementById("server-port-display");
-  if (!el) return;
+  if (el) return;
   return new Promise((resolve) => {
     chrome.runtime.sendMessage({ type: "getConfig" }, (response: any) => {
killedBy: updatePortDisplay updates text on presence
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Server Port: 1234"
Received: ""

[Killed] ConditionalExpression
extension/src/popup.ts:267:7
 // Update server port display element
 export async function updatePortDisplay(): Promise<void> {
   const el = document.getElementById("server-port-display");
-  if (!el) return;
+  if (true) return;
   return new Promise((resolve) => {
     chrome.runtime.sendMessage({ type: "getConfig" }, (response: any) => {
killedBy: updatePortDisplay updates text on presence
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Server Port: 1234"
Received: ""

[Timeout] BlockStatement
extension/src/popup.ts:268:35
 export async function updatePortDisplay(): Promise<void> {
   const el = document.getElementById("server-port-display");
   if (!el) return;
-  return new Promise((resolve) => {
-    chrome.runtime.sendMessage({ type: "getConfig" }, (response: any) => {
-      if (!chrome.runtime.lastError && response && response.serverConfig) {
-        el.textContent = "Server Port: " + response.serverConfig.server_port;
-      }
-      resolve();
-    });
-  });
+  return new Promise((resolve) => {});
 }
 

[Timeout] BlockStatement
extension/src/popup.ts:269:74
   const el = document.getElementById("server-port-display");
   if (!el) return;
   return new Promise((resolve) => {
-    chrome.runtime.sendMessage({ type: "getConfig" }, (response: any) => {
-      if (!chrome.runtime.lastError && response && response.serverConfig) {
-        el.textContent = "Server Port: " + response.serverConfig.server_port;
-      }
-      resolve();
-    });
+    chrome.runtime.sendMessage({ type: "getConfig" }, (response: any) => {});
   });
 }

[Killed] ConditionalExpression
extension/src/popup.ts:270:11
   if (!el) return;
   return new Promise((resolve) => {
     chrome.runtime.sendMessage({ type: "getConfig" }, (response: any) => {
-      if (!chrome.runtime.lastError && response && response.serverConfig) {
+      if (false) {
         el.textContent = "Server Port: " + response.serverConfig.server_port;
       }
killedBy: updatePortDisplay updates text on presence
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Server Port: 1234"
Received: ""

[Killed] BooleanLiteral
extension/src/popup.ts:270:11
   if (!el) return;
   return new Promise((resolve) => {
     chrome.runtime.sendMessage({ type: "getConfig" }, (response: any) => {
-      if (!chrome.runtime.lastError && response && response.serverConfig) {
+      if (chrome.runtime.lastError && response && response.serverConfig) {
         el.textContent = "Server Port: " + response.serverConfig.server_port;
       }
killedBy: updatePortDisplay updates text on presence
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Server Port: 1234"
Received: ""

[Killed] BlockStatement
extension/src/popup.ts:279:50
 }
 
 // Show configuration error if present in local storage
-export function showConfigErrorIfPresent(): void {
-  const el = document.getElementById("config-error-display");
-  if (!el) return;
-  chrome.storage.local.get("configError", (result: any) => {
-    if (result.configError) {
-      el.textContent = "Configuration Error: " + result.configError;
-      el.style.display = "block";
-    }
-  });
-}
+export function showConfigErrorIfPresent(): void {}
 
 // Create a list item for errors with a toggle for details
killedBy: showConfigErrorIfPresent displays error when configError set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Configuration Error: oops"
Received: ""

[Killed] ConditionalExpression
extension/src/popup.ts:281:7
 // Show configuration error if present in local storage
 export function showConfigErrorIfPresent(): void {
   const el = document.getElementById("config-error-display");
-  if (!el) return;
+  if (true) return;
   chrome.storage.local.get("configError", (result: any) => {
     if (result.configError) {
killedBy: showConfigErrorIfPresent displays error when configError set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Configuration Error: oops"
Received: ""

[Killed] BooleanLiteral
extension/src/popup.ts:281:7
 // Show configuration error if present in local storage
 export function showConfigErrorIfPresent(): void {
   const el = document.getElementById("config-error-display");
-  if (!el) return;
+  if (el) return;
   chrome.storage.local.get("configError", (result: any) => {
     if (result.configError) {
killedBy: showConfigErrorIfPresent displays error when configError set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Configuration Error: oops"
Received: ""

[Killed] BlockStatement
extension/src/popup.ts:282:60
 export function showConfigErrorIfPresent(): void {
   const el = document.getElementById("config-error-display");
   if (!el) return;
-  chrome.storage.local.get("configError", (result: any) => {
-    if (result.configError) {
-      el.textContent = "Configuration Error: " + result.configError;
-      el.style.display = "block";
-    }
-  });
+  chrome.storage.local.get("configError", (result: any) => {});
 }
 
killedBy: showConfigErrorIfPresent displays error when configError set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Configuration Error: oops"
Received: ""

[Killed] BlockStatement
extension/src/popup.ts:283:29
   const el = document.getElementById("config-error-display");
   if (!el) return;
   chrome.storage.local.get("configError", (result: any) => {
-    if (result.configError) {
-      el.textContent = "Configuration Error: " + result.configError;
-      el.style.display = "block";
-    }
+    if (result.configError) {}
   });
 }
killedBy: showConfigErrorIfPresent displays error when configError set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Configuration Error: oops"
Received: ""

[Killed] ConditionalExpression
extension/src/popup.ts:283:9
   const el = document.getElementById("config-error-display");
   if (!el) return;
   chrome.storage.local.get("configError", (result: any) => {
-    if (result.configError) {
+    if (false) {
       el.textContent = "Configuration Error: " + result.configError;
       el.style.display = "block";
killedBy: showConfigErrorIfPresent displays error when configError set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Configuration Error: oops"
Received: ""

[Killed] StringLiteral
extension/src/popup.ts:285:26
   chrome.storage.local.get("configError", (result: any) => {
     if (result.configError) {
       el.textContent = "Configuration Error: " + result.configError;
-      el.style.display = "block";
+      el.style.display = "";
     }
   });
killedBy: showConfigErrorIfPresent displays error when configError set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "block"
Received: ""

[Killed] MethodExpression
extension/src/popup.ts:300:20
 ): HTMLLIElement {
   const li = document.createElement("li");
   // Add CSS classes for severity-based styling
-  const severity = info.errorInfo.type.toLowerCase();
+  const severity = info.errorInfo.type.toUpperCase();
   li.classList.add("status-" + severity);
   li.classList.add("severity-" + severity);
killedBy: Popup Script Tests List Item Creation should create error list item
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
extension/src/popup.ts:304:40
   li.classList.add("status-" + severity);
   li.classList.add("severity-" + severity);
   li.dataset.downloadId = downloadId;
-  const title = document.createElement("div");
+  const title = document.createElement("");
   title.className = "item-title";
   title.textContent = info.filename;
killedBy: createErrorListItem builds list item with semantic details element and help link
statusReason: InvalidCharacterError: "" did not match the Name production

[Timeout] StringLiteral
extension/src/popup.ts:311:42
   // Use semantic <details> for error details
   const detailsEl = document.createElement("details");
   detailsEl.className = "error-details";
-  const summary = document.createElement("summary");
+  const summary = document.createElement("");
   summary.textContent = "Details";
   detailsEl.appendChild(summary);

[Killed] StringLiteral
extension/src/popup.ts:315:23
   summary.textContent = "Details";
   detailsEl.appendChild(summary);
   const content = document.createElement("div");
-  content.className = "error-details-content";
+  content.className = "";
   content.textContent =
     info.errorInfo.type +
killedBy: createErrorListItem builds list item with semantic details element and help link
statusReason: TypeError: Cannot read properties of null (reading 'textContent')

[Killed] StringLiteral
extension/src/popup.ts:318:5
   content.className = "error-details-content";
   content.textContent =
     info.errorInfo.type +
-    ": " +
+    "" +
     info.errorInfo.message +
     " (" +
killedBy: createErrorListItem builds list item with semantic details element and help link
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "TypeX: msg (orig)"
Received string:    "TypeXmsg (orig)"

[Killed] StringLiteral
extension/src/popup.ts:320:5
     info.errorInfo.type +
     ": " +
     info.errorInfo.message +
-    " (" +
+    "" +
     info.errorInfo.original +
     ")";
killedBy: createErrorListItem builds list item with semantic details element and help link
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "TypeX: msg (orig)"
Received string:    "TypeX: msgorig)"

[Killed] StringLiteral
extension/src/popup.ts:325:42
     ")";
   detailsEl.appendChild(content);
   // Add contextual help/troubleshooting link
-  const helpBtn = document.createElement("button");
+  const helpBtn = document.createElement("");
   helpBtn.className = "error-help-link";
   helpBtn.textContent = "Help";
killedBy: createErrorListItem builds list item with semantic details element and help link
statusReason: InvalidCharacterError: "" did not match the Name production

[Killed] StringLiteral
extension/src/popup.ts:326:23
   detailsEl.appendChild(content);
   // Add contextual help/troubleshooting link
   const helpBtn = document.createElement("button");
-  helpBtn.className = "error-help-link";
+  helpBtn.className = "";
   helpBtn.textContent = "Help";
   helpBtn.addEventListener("click", (): void => {
killedBy: createErrorListItem builds list item with semantic details element and help link
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BlockStatement
extension/src/popup.ts:328:49
   const helpBtn = document.createElement("button");
   helpBtn.className = "error-help-link";
   helpBtn.textContent = "Help";
-  helpBtn.addEventListener("click", (): void => {
-    // Open extension options page for troubleshooting
-    (chrome.runtime as any).openOptionsPage();
-  });
+  helpBtn.addEventListener("click", (): void => {});
   detailsEl.appendChild(helpBtn);
   li.appendChild(detailsEl);
killedBy: createErrorListItem builds list item with semantic details element and help link
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
extension/src/popup.ts:341:18
 export function createGenericListItem(
   downloadId: string,
   item: { status: string }
-): HTMLLIElement {
-  const li = document.createElement("li");
-  li.classList.add("status-" + item.status);
-  const statusText = document.createElement("div");
-  statusText.className = "item-status";
-  statusText.textContent = item.status;
-  li.appendChild(statusText);
-  li.dataset.downloadId = downloadId;
-  const btn = document.createElement("button");
-  btn.className = "resume-button";
-  btn.textContent = "Resume";
-  li.appendChild(btn);
-  return li;
-}
+): HTMLLIElement {}
 
 // Create a queued list item with a cancel button
killedBy: createGenericListItem renders paused status with resume button
statusReason: TypeError: Cannot read properties of undefined (reading 'classList')

[Killed] StringLiteral
extension/src/popup.ts:343:20
   item: { status: string }
 ): HTMLLIElement {
   const li = document.createElement("li");
-  li.classList.add("status-" + item.status);
+  li.classList.add("" + item.status);
   const statusText = document.createElement("div");
   statusText.className = "item-status";
killedBy: createGenericListItem renders paused status with resume button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
extension/src/popup.ts:357:75
 }
 
 // Create a queued list item with a cancel button
-export function createQueuedListItem(item: { id: string }): HTMLLIElement {
-  const li = document.createElement("li");
-  li.classList.add("queued-item");
-  li.dataset.downloadId = item.id;
-  const queuedText = document.createElement("div");
-  queuedText.className = "item-status";
-  queuedText.textContent = "Queued: " + item.id;
-  li.appendChild(queuedText);
-  const btn = document.createElement("button");
-  btn.className = "cancel-button";
-  btn.textContent = "Cancel";
-  btn.addEventListener("click", () => {
-    chrome.runtime.sendMessage(
-      { type: "cancelDownload", downloadId: item.id },
-      () => {}
-    );
-  });
-  li.appendChild(btn);
-  return li;
-}
+export function createQueuedListItem(item: { id: string }): HTMLLIElement {}
 
 // Create an active download list item with a pause button
killedBy: createQueuedListItem renders cancel button and sends message
statusReason: TypeError: Cannot read properties of undefined (reading 'querySelector')

[Survived] StringLiteral
extension/src/popup.ts:363:28
   li.dataset.downloadId = item.id;
   const queuedText = document.createElement("div");
   queuedText.className = "item-status";
-  queuedText.textContent = "Queued: " + item.id;
+  queuedText.textContent = "" + item.id;
   li.appendChild(queuedText);
   const btn = document.createElement("button");

[Killed] StringLiteral
extension/src/popup.ts:365:38
   queuedText.className = "item-status";
   queuedText.textContent = "Queued: " + item.id;
   li.appendChild(queuedText);
-  const btn = document.createElement("button");
+  const btn = document.createElement("");
   btn.className = "cancel-button";
   btn.textContent = "Cancel";
killedBy: Popup Script Tests List Item Creation should create queued list item
statusReason: InvalidCharacterError: "" did not match the Name production

[Survived] StringLiteral
extension/src/popup.ts:367:21
   li.appendChild(queuedText);
   const btn = document.createElement("button");
   btn.className = "cancel-button";
-  btn.textContent = "Cancel";
+  btn.textContent = "";
   btn.addEventListener("click", () => {
     chrome.runtime.sendMessage(

[Killed] BlockStatement
extension/src/popup.ts:368:39
   const btn = document.createElement("button");
   btn.className = "cancel-button";
   btn.textContent = "Cancel";
-  btn.addEventListener("click", () => {
-    chrome.runtime.sendMessage(
-      { type: "cancelDownload", downloadId: item.id },
-      () => {}
-    );
-  });
+  btn.addEventListener("click", () => {});
   li.appendChild(btn);
   return li;
killedBy: createQueuedListItem renders cancel button and sends message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"downloadId": "id3", "type": "cancelDownload"}, Any<Function>

Number of calls: 0

[Killed] StringLiteral
extension/src/popup.ts:370:15
   btn.textContent = "Cancel";
   btn.addEventListener("click", () => {
     chrome.runtime.sendMessage(
-      { type: "cancelDownload", downloadId: item.id },
+      { type: "", downloadId: item.id },
       () => {}
     );
killedBy: createQueuedListItem renders cancel button and sends message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "downloadId": "id3",
-   "type": "cancelDownload",

[Killed] StringLiteral
extension/src/popup.ts:389:37
     message?: string;
   }
 ): HTMLLIElement {
-  const li = document.createElement("li");
+  const li = document.createElement("");
   li.classList.add("active-item");
   li.classList.add("status-" + statusObj.status);
killedBy: Popup Queue Controls createActiveListItem pause button calls pauseDownload
statusReason: InvalidCharacterError: "" did not match the Name production

[Survived] StringLiteral
extension/src/popup.ts:391:20
 ): HTMLLIElement {
   const li = document.createElement("li");
   li.classList.add("active-item");
-  li.classList.add("status-" + statusObj.status);
+  li.classList.add("" + statusObj.status);
   li.dataset.downloadId = downloadId;
   const title = document.createElement("div");

[Survived] ConditionalExpression
extension/src/popup.ts:394:23
   li.classList.add("status-" + statusObj.status);
   li.dataset.downloadId = downloadId;
   const title = document.createElement("div");
-  title.textContent = statusObj.filename || downloadId;
+  title.textContent = true;
   li.appendChild(title);
   const progress = document.createElement("progress");

[Survived] LogicalOperator
extension/src/popup.ts:394:23
   li.classList.add("status-" + statusObj.status);
   li.dataset.downloadId = downloadId;
   const title = document.createElement("div");
-  title.textContent = statusObj.filename || downloadId;
+  title.textContent = statusObj.filename && downloadId;
   li.appendChild(title);
   const progress = document.createElement("progress");

[Survived] StringLiteral
extension/src/popup.ts:402:59
   li.appendChild(progress);
   const percentLabel = document.createElement("span");
   percentLabel.className = "item-percent";
-  percentLabel.textContent = String(statusObj.progress) + "%";
+  percentLabel.textContent = String(statusObj.progress) + "";
   li.appendChild(percentLabel);
   const statusText = document.createElement("div");

[Survived] StringLiteral
extension/src/popup.ts:410:21
   li.appendChild(statusText);
   const btn = document.createElement("button");
   btn.className = "pause-button";
-  btn.textContent = "Pause";
+  btn.textContent = "";
   btn.addEventListener("click", () => {
     chrome.runtime.sendMessage({ type: "pauseDownload", downloadId }, () => {});

[Killed] BlockStatement
extension/src/popup.ts:411:39
   const btn = document.createElement("button");
   btn.className = "pause-button";
   btn.textContent = "Pause";
-  btn.addEventListener("click", () => {
-    chrome.runtime.sendMessage({ type: "pauseDownload", downloadId }, () => {});
-  });
+  btn.addEventListener("click", () => {});
   li.appendChild(btn);
   return li;
killedBy: Popup Queue Controls createActiveListItem pause button calls pauseDownload
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"downloadId": "idPause", "type": "pauseDownload"}, Any<Function>

Number of calls: 0
