[NoCoverage] BlockStatement
extension/src/popup.ts:419:53
 }
 
 // Drag-and-drop queue reordering handlers
-export function handleDragStart(e: DragEvent): void {
-  const li = e.currentTarget as HTMLLIElement;
-  dragSrcIndex = Array.from(li.parentElement!.children).indexOf(li);
-  e.dataTransfer!.effectAllowed = "move";
-  e.dataTransfer!.setData("text/plain", li.dataset.downloadId!);
-  li.classList.add("dragging");
-}
+export function handleDragStart(e: DragEvent): void {}
 
 export function handleDragOver(e: DragEvent): void {

[NoCoverage] BlockStatement
extension/src/popup.ts:427:52
   li.classList.add("dragging");
 }
 
-export function handleDragOver(e: DragEvent): void {
-  e.preventDefault();
-  const li = e.currentTarget as HTMLLIElement;
-  li.classList.add("drag-over");
-  e.dataTransfer!.dropEffect = "move";
-}
+export function handleDragOver(e: DragEvent): void {}
 
 export function handleDragLeave(e: DragEvent): void {

[NoCoverage] BlockStatement
extension/src/popup.ts:434:53
   e.dataTransfer!.dropEffect = "move";
 }
 
-export function handleDragLeave(e: DragEvent): void {
-  const li = e.currentTarget as HTMLLIElement;
-  li.classList.remove("drag-over");
-}
+export function handleDragLeave(e: DragEvent): void {}
 
 export function handleDrop(e: DragEvent): void {

[NoCoverage] StringLiteral
extension/src/popup.ts:436:23
 
 export function handleDragLeave(e: DragEvent): void {
   const li = e.currentTarget as HTMLLIElement;
-  li.classList.remove("drag-over");
+  li.classList.remove("");
 }
 

[NoCoverage] BlockStatement
extension/src/popup.ts:439:48
   li.classList.remove("drag-over");
 }
 
-export function handleDrop(e: DragEvent): void {
-  e.preventDefault();
-  const li = e.currentTarget as HTMLLIElement;
-  li.classList.remove("drag-over");
-  if (dragSrcIndex === null) return;
-  const dropIndex = Array.from(li.parentElement!.children).indexOf(li);
-  // Collect current ids
-  const listEls = Array.from(li.parentElement!.children) as HTMLLIElement[];
-  const ids = listEls.map((el) => el.dataset.downloadId!);
-  // Reorder array
-  const reordered = [...ids];
-  const [moved] = reordered.splice(dragSrcIndex, 1);
-  reordered.splice(dropIndex, 0, moved);
-  // Notify background of new queue order
-  chrome.runtime.sendMessage({ type: "reorderQueue", queue: reordered });
-}
+export function handleDrop(e: DragEvent): void {}
 
 export function handleDragEnd(e: DragEvent): void {

[NoCoverage] ConditionalExpression
extension/src/popup.ts:443:7
   e.preventDefault();
   const li = e.currentTarget as HTMLLIElement;
   li.classList.remove("drag-over");
-  if (dragSrcIndex === null) return;
+  if (false) return;
   const dropIndex = Array.from(li.parentElement!.children).indexOf(li);
   // Collect current ids

[NoCoverage] EqualityOperator
extension/src/popup.ts:443:7
   e.preventDefault();
   const li = e.currentTarget as HTMLLIElement;
   li.classList.remove("drag-over");
-  if (dragSrcIndex === null) return;
+  if (dragSrcIndex !== null) return;
   const dropIndex = Array.from(li.parentElement!.children).indexOf(li);
   // Collect current ids

[NoCoverage] ArrowFunction
extension/src/popup.ts:447:27
   const dropIndex = Array.from(li.parentElement!.children).indexOf(li);
   // Collect current ids
   const listEls = Array.from(li.parentElement!.children) as HTMLLIElement[];
-  const ids = listEls.map((el) => el.dataset.downloadId!);
+  const ids = listEls.map(() => undefined);
   // Reorder array
   const reordered = [...ids];

[NoCoverage] BlockStatement
extension/src/popup.ts:456:51
   chrome.runtime.sendMessage({ type: "reorderQueue", queue: reordered });
 }
 
-export function handleDragEnd(e: DragEvent): void {
-  (e.currentTarget as HTMLLIElement).classList.remove("dragging");
-}
+export function handleDragEnd(e: DragEvent): void {}
 
 // Render current downloads and queued items

[NoCoverage] StringLiteral
extension/src/popup.ts:457:55
 }
 
 export function handleDragEnd(e: DragEvent): void {
-  (e.currentTarget as HTMLLIElement).classList.remove("dragging");
+  (e.currentTarget as HTMLLIElement).classList.remove("");
 }
 

[Killed] StringLiteral
extension/src/popup.ts:465:45
   active: Record<string, any>;
   queue: string[];
 }): void {
-  const container = document.getElementById("download-status");
+  const container = document.getElementById("");
   if (!container) return;
   container.innerHTML = "";
killedBy: Popup Queue Controls renderDownloadStatus resume button calls resumeDownload for paused items
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] ConditionalExpression
extension/src/popup.ts:466:7
   queue: string[];
 }): void {
   const container = document.getElementById("download-status");
-  if (!container) return;
+  if (true) return;
   container.innerHTML = "";
   const activeIds = Object.keys(data.active || {});
killedBy: Popup Queue Controls renderDownloadStatus resume button calls resumeDownload for paused items
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BooleanLiteral
extension/src/popup.ts:466:7
   queue: string[];
 }): void {
   const container = document.getElementById("download-status");
-  if (!container) return;
+  if (container) return;
   container.innerHTML = "";
   const activeIds = Object.keys(data.active || {});
killedBy: Popup Queue Controls renderDownloadStatus resume button calls resumeDownload for paused items
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] LogicalOperator
extension/src/popup.ts:468:33
   const container = document.getElementById("download-status");
   if (!container) return;
   container.innerHTML = "";
-  const activeIds = Object.keys(data.active || {});
+  const activeIds = Object.keys(data.active && {});
   const queuedIds = data.queue || [];
   if (activeIds.length === 0 && queuedIds.length === 0) {
killedBy: Popup Queue Controls renderDownloadStatus resume button calls resumeDownload for paused items
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] ConditionalExpression
extension/src/popup.ts:468:33
   const container = document.getElementById("download-status");
   if (!container) return;
   container.innerHTML = "";
-  const activeIds = Object.keys(data.active || {});
+  const activeIds = Object.keys(false);
   const queuedIds = data.queue || [];
   if (activeIds.length === 0 && queuedIds.length === 0) {
killedBy: Popup Queue Controls renderDownloadStatus resume button calls resumeDownload for paused items
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Survived] ConditionalExpression
extension/src/popup.ts:469:21
   if (!container) return;
   container.innerHTML = "";
   const activeIds = Object.keys(data.active || {});
-  const queuedIds = data.queue || [];
+  const queuedIds = true;
   if (activeIds.length === 0 && queuedIds.length === 0) {
     const li = document.createElement("li");

[Survived] ConditionalExpression
extension/src/popup.ts:469:21
   if (!container) return;
   container.innerHTML = "";
   const activeIds = Object.keys(data.active || {});
-  const queuedIds = data.queue || [];
+  const queuedIds = false;
   if (activeIds.length === 0 && queuedIds.length === 0) {
     const li = document.createElement("li");

[Killed] EqualityOperator
extension/src/popup.ts:470:7
   container.innerHTML = "";
   const activeIds = Object.keys(data.active || {});
   const queuedIds = data.queue || [];
-  if (activeIds.length === 0 && queuedIds.length === 0) {
+  if (activeIds.length !== 0 && queuedIds.length === 0) {
     const li = document.createElement("li");
     li.textContent = "No active or queued downloads.";
killedBy: Popup Queue Controls renderDownloadStatus resume button calls resumeDownload for paused items
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] LogicalOperator
extension/src/popup.ts:470:7
   container.innerHTML = "";
   const activeIds = Object.keys(data.active || {});
   const queuedIds = data.queue || [];
-  if (activeIds.length === 0 && queuedIds.length === 0) {
+  if (activeIds.length === 0 || queuedIds.length === 0) {
     const li = document.createElement("li");
     li.textContent = "No active or queued downloads.";
killedBy: Popup Queue Controls renderDownloadStatus resume button calls resumeDownload for paused items
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] EqualityOperator
extension/src/popup.ts:477:7
     return;
   }
   // Grouped active and queued items into collapsible sections
-  if (activeIds.length > 0) {
+  if (activeIds.length <= 0) {
     const activeDetails = document.createElement("details");
     activeDetails.open = true;
killedBy: Popup Queue Controls renderDownloadStatus resume button calls resumeDownload for paused items
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] ConditionalExpression
extension/src/popup.ts:477:7
     return;
   }
   // Grouped active and queued items into collapsible sections
-  if (activeIds.length > 0) {
+  if (false) {
     const activeDetails = document.createElement("details");
     activeDetails.open = true;
killedBy: Popup Queue Controls renderDownloadStatus resume button calls resumeDownload for paused items
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Survived] BooleanLiteral
extension/src/popup.ts:479:26
   // Grouped active and queued items into collapsible sections
   if (activeIds.length > 0) {
     const activeDetails = document.createElement("details");
-    activeDetails.open = true;
+    activeDetails.open = false;
     const activeSummary = document.createElement("summary");
     activeSummary.textContent = "Active Downloads";

[Killed] StringLiteral
extension/src/popup.ts:483:45
     const activeSummary = document.createElement("summary");
     activeSummary.textContent = "Active Downloads";
     activeDetails.appendChild(activeSummary);
-    const activeUl = document.createElement("ul");
+    const activeUl = document.createElement("");
     activeIds.forEach((id) => {
       const statusObj = data.active[id];
killedBy: Popup Queue Controls renderDownloadStatus resume button calls resumeDownload for paused items
statusReason: InvalidCharacterError: "" did not match the Name production

[Killed] ConditionalExpression
extension/src/popup.ts:487:11
     activeIds.forEach((id) => {
       const statusObj = data.active[id];
       let liEl: HTMLLIElement;
-      if (statusObj.status === "error") {
+      if (true) {
         liEl = createErrorListItem(id, {
           filename: statusObj.filename || id,
killedBy: Popup Queue Controls renderDownloadStatus resume button calls resumeDownload for paused items
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] EqualityOperator
extension/src/popup.ts:487:11
     activeIds.forEach((id) => {
       const statusObj = data.active[id];
       let liEl: HTMLLIElement;
-      if (statusObj.status === "error") {
+      if (statusObj.status !== "error") {
         liEl = createErrorListItem(id, {
           filename: statusObj.filename || id,
killedBy: Popup Queue Controls renderDownloadStatus resume button calls resumeDownload for paused items
statusReason: Error: expect(received).not.toBeNull()

Received: null

[NoCoverage] ConditionalExpression
extension/src/popup.ts:489:21
       let liEl: HTMLLIElement;
       if (statusObj.status === "error") {
         liEl = createErrorListItem(id, {
-          filename: statusObj.filename || id,
+          filename: true,
           errorInfo: {
             type: "Error",

[NoCoverage] LogicalOperator
extension/src/popup.ts:489:21
       let liEl: HTMLLIElement;
       if (statusObj.status === "error") {
         liEl = createErrorListItem(id, {
-          filename: statusObj.filename || id,
+          filename: statusObj.filename && id,
           errorInfo: {
             type: "Error",

[NoCoverage] StringLiteral
extension/src/popup.ts:491:19
         liEl = createErrorListItem(id, {
           filename: statusObj.filename || id,
           errorInfo: {
-            type: "Error",
+            type: "",
             message: statusObj.error || "Error",
             original: statusObj.message || "",

[NoCoverage] ConditionalExpression
extension/src/popup.ts:492:22
           filename: statusObj.filename || id,
           errorInfo: {
             type: "Error",
-            message: statusObj.error || "Error",
+            message: true,
             original: statusObj.message || "",
           },

[NoCoverage] ConditionalExpression
extension/src/popup.ts:492:22
           filename: statusObj.filename || id,
           errorInfo: {
             type: "Error",
-            message: statusObj.error || "Error",
+            message: false,
             original: statusObj.message || "",
           },

[NoCoverage] LogicalOperator
extension/src/popup.ts:493:23
           errorInfo: {
             type: "Error",
             message: statusObj.error || "Error",
-            original: statusObj.message || "",
+            original: statusObj.message && "",
           },
         });

[NoCoverage] ConditionalExpression
extension/src/popup.ts:493:23
           errorInfo: {
             type: "Error",
             message: statusObj.error || "Error",
-            original: statusObj.message || "",
+            original: false,
           },
         });

[Killed] EqualityOperator
extension/src/popup.ts:496:18
             original: statusObj.message || "",
           },
         });
-      } else if (statusObj.status === "paused") {
+      } else if (statusObj.status !== "paused") {
         liEl = createGenericListItem(id, { status: "paused" });
         liEl
killedBy: Popup Queue Controls renderDownloadStatus resume button calls resumeDownload for paused items
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BlockStatement
extension/src/popup.ts:496:49
             original: statusObj.message || "",
           },
         });
-      } else if (statusObj.status === "paused") {
-        liEl = createGenericListItem(id, { status: "paused" });
-        liEl
-          .querySelector("button.resume-button")
-          ?.addEventListener("click", () => {
-            chrome.runtime.sendMessage(
-              { type: "resumeDownload", downloadId: id },
-              () => {}
-            );
-          });
-      } else {
+      } else if (statusObj.status === "paused") {} else {
         liEl = createActiveListItem(id, statusObj);
       }
killedBy: Popup Queue Controls renderDownloadStatus resume button calls resumeDownload for paused items
statusReason: TypeError: Failed to execute 'appendChild' on 'Node': parameter 1 is not of type 'Node'.

[Survived] StringLiteral
extension/src/popup.ts:497:52
           },
         });
       } else if (statusObj.status === "paused") {
-        liEl = createGenericListItem(id, { status: "paused" });
+        liEl = createGenericListItem(id, { status: "" });
         liEl
           .querySelector("button.resume-button")

[Survived] OptionalChaining
extension/src/popup.ts:498:9
         });
       } else if (statusObj.status === "paused") {
         liEl = createGenericListItem(id, { status: "paused" });
-        liEl
-          .querySelector("button.resume-button")
-          ?.addEventListener("click", () => {
+        liEl.querySelector("button.resume-button").addEventListener("click", () => {
             chrome.runtime.sendMessage(
               { type: "resumeDownload", downloadId: id },

[Killed] BlockStatement
extension/src/popup.ts:500:45
         liEl = createGenericListItem(id, { status: "paused" });
         liEl
           .querySelector("button.resume-button")
-          ?.addEventListener("click", () => {
-            chrome.runtime.sendMessage(
-              { type: "resumeDownload", downloadId: id },
-              () => {}
-            );
-          });
+          ?.addEventListener("click", () => {});
       } else {
         liEl = createActiveListItem(id, statusObj);
killedBy: Popup Queue Controls renderDownloadStatus resume button calls resumeDownload for paused items
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"downloadId": "idResume", "type": "resumeDownload"}, Any<Function>

Number of calls: 0

[Killed] BlockStatement
extension/src/popup.ts:506:14
               () => {}
             );
           });
-      } else {
-        liEl = createActiveListItem(id, statusObj);
-      }
+      } else {}
       activeUl.appendChild(liEl);
     });
killedBy: Popup Script Tests Download Status Rendering should render download status
statusReason: TypeError: Failed to execute 'appendChild' on 'Node': parameter 1 is not of type 'Node'.

[Survived] ConditionalExpression
extension/src/popup.ts:514:7
     activeDetails.appendChild(activeUl);
     container.appendChild(activeDetails);
   }
-  if (queuedIds.length > 0) {
+  if (true) {
     const queueDetails = document.createElement("details");
     queueDetails.open = true;

[Survived] EqualityOperator
extension/src/popup.ts:514:7
     activeDetails.appendChild(activeUl);
     container.appendChild(activeDetails);
   }
-  if (queuedIds.length > 0) {
+  if (queuedIds.length >= 0) {
     const queueDetails = document.createElement("details");
     queueDetails.open = true;

[Survived] BooleanLiteral
extension/src/popup.ts:516:25
   }
   if (queuedIds.length > 0) {
     const queueDetails = document.createElement("details");
-    queueDetails.open = true;
+    queueDetails.open = false;
     const queueSummary = document.createElement("summary");
     queueSummary.textContent = "Queued Downloads";

[Survived] BlockStatement
extension/src/popup.ts:521:31
     queueSummary.textContent = "Queued Downloads";
     queueDetails.appendChild(queueSummary);
     const queueUl = document.createElement("ul");
-    queuedIds.forEach((id) => {
-      const li = createQueuedListItem({ id });
-      // Enable drag-and-drop reordering for queued items
-      li.setAttribute("draggable", "true");
-      li.addEventListener("dragstart", handleDragStart);
-      li.addEventListener("dragover", handleDragOver);
-      li.addEventListener("dragleave", handleDragLeave);
-      li.addEventListener("drop", handleDrop);
-      li.addEventListener("dragend", handleDragEnd);
-      queueUl.appendChild(li);
-    });
+    queuedIds.forEach((id) => {});
     queueDetails.appendChild(queueUl);
     container.appendChild(queueDetails);

[Killed] StringLiteral
extension/src/popup.ts:524:23
     queuedIds.forEach((id) => {
       const li = createQueuedListItem({ id });
       // Enable drag-and-drop reordering for queued items
-      li.setAttribute("draggable", "true");
+      li.setAttribute("", "true");
       li.addEventListener("dragstart", handleDragStart);
       li.addEventListener("dragover", handleDragOver);
killedBy: Popup Script Tests Download Status Rendering should render download status
statusReason: InvalidCharacterError: "" did not match the Name production

[Timeout] StringLiteral
extension/src/popup.ts:525:27
       const li = createQueuedListItem({ id });
       // Enable drag-and-drop reordering for queued items
       li.setAttribute("draggable", "true");
-      li.addEventListener("dragstart", handleDragStart);
+      li.addEventListener("", handleDragStart);
       li.addEventListener("dragover", handleDragOver);
       li.addEventListener("dragleave", handleDragLeave);

[Survived] StringLiteral
extension/src/popup.ts:527:27
       li.setAttribute("draggable", "true");
       li.addEventListener("dragstart", handleDragStart);
       li.addEventListener("dragover", handleDragOver);
-      li.addEventListener("dragleave", handleDragLeave);
+      li.addEventListener("", handleDragLeave);
       li.addEventListener("drop", handleDrop);
       li.addEventListener("dragend", handleDragEnd);

[Survived] StringLiteral
extension/src/popup.ts:529:27
       li.addEventListener("dragover", handleDragOver);
       li.addEventListener("dragleave", handleDragLeave);
       li.addEventListener("drop", handleDrop);
-      li.addEventListener("dragend", handleDragEnd);
+      li.addEventListener("", handleDragEnd);
       queueUl.appendChild(li);
     });

[NoCoverage] StringLiteral
extension/src/popup.ts:544:45
 export function updatePopupServerStatus(
   status: "connected" | "disconnected" | "checking"
 ): void {
-  const indicator = document.getElementById("server-status-indicator");
+  const indicator = document.getElementById("");
   const text = document.getElementById("server-status-text");
 

[NoCoverage] StringLiteral
extension/src/popup.ts:545:40
   status: "connected" | "disconnected" | "checking"
 ): void {
   const indicator = document.getElementById("server-status-indicator");
-  const text = document.getElementById("server-status-text");
+  const text = document.getElementById("");
 
   if (indicator && text) {

[NoCoverage] LogicalOperator
extension/src/popup.ts:547:7
   const indicator = document.getElementById("server-status-indicator");
   const text = document.getElementById("server-status-text");
 
-  if (indicator && text) {
+  if (indicator || text) {
     // Remove all status classes
     indicator.classList.remove("connected", "disconnected");

[NoCoverage] ConditionalExpression
extension/src/popup.ts:547:7
   const indicator = document.getElementById("server-status-indicator");
   const text = document.getElementById("server-status-text");
 
-  if (indicator && text) {
+  if (false) {
     // Remove all status classes
     indicator.classList.remove("connected", "disconnected");

[NoCoverage] StringLiteral
extension/src/popup.ts:553:33
 
     switch (status) {
       case "connected":
-        indicator.classList.add("connected");
+        indicator.classList.add("");
         text.textContent = "Connected";
         break;

[Killed] BlockStatement
extension/src/popup.ts:577:23
 
   // Set up settings button click handler
   const settingsButton = document.getElementById("open-settings");
-  if (settingsButton) {
-    settingsButton.addEventListener("click", () => {
-      (chrome.runtime as any).openOptionsPage();
-    });
-  }
+  if (settingsButton) {}
 
   // Initialize download status
killedBy: popup settings button should call chrome.runtime.openOptionsPage on settings click
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
extension/src/popup.ts:577:7
 
   // Set up settings button click handler
   const settingsButton = document.getElementById("open-settings");
-  if (settingsButton) {
+  if (false) {
     settingsButton.addEventListener("click", () => {
       (chrome.runtime as any).openOptionsPage();
killedBy: popup settings button should call chrome.runtime.openOptionsPage on settings click
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
extension/src/popup.ts:578:52
   // Set up settings button click handler
   const settingsButton = document.getElementById("open-settings");
   if (settingsButton) {
-    settingsButton.addEventListener("click", () => {
-      (chrome.runtime as any).openOptionsPage();
-    });
+    settingsButton.addEventListener("click", () => {});
   }
 
killedBy: popup settings button should call chrome.runtime.openOptionsPage on settings click
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
extension/src/popup.ts:578:37
   // Set up settings button click handler
   const settingsButton = document.getElementById("open-settings");
   if (settingsButton) {
-    settingsButton.addEventListener("click", () => {
+    settingsButton.addEventListener("", () => {
       (chrome.runtime as any).openOptionsPage();
     });
killedBy: popup settings button should call chrome.runtime.openOptionsPage on settings click
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[NoCoverage] BlockStatement
extension/src/popup.ts:584:71
   }
 
   // Initialize download status
-  chrome.runtime.sendMessage({ type: "getQueue" }, (response: any) => {
-    renderDownloadStatus(response || { active: {}, queue: [] });
-  });
+  chrome.runtime.sendMessage({ type: "getQueue" }, (response: any) => {});
 
   // Set up message listeners

[Survived] ObjectLiteral
extension/src/popup.ts:584:30
   }
 
   // Initialize download status
-  chrome.runtime.sendMessage({ type: "getQueue" }, (response: any) => {
+  chrome.runtime.sendMessage({}, (response: any) => {
     renderDownloadStatus(response || { active: {}, queue: [] });
   });

[NoCoverage] ConditionalExpression
extension/src/popup.ts:585:26
 
   // Initialize download status
   chrome.runtime.sendMessage({ type: "getQueue" }, (response: any) => {
-    renderDownloadStatus(response || { active: {}, queue: [] });
+    renderDownloadStatus(false);
   });
 

[NoCoverage] ConditionalExpression
extension/src/popup.ts:585:26
 
   // Initialize download status
   chrome.runtime.sendMessage({ type: "getQueue" }, (response: any) => {
-    renderDownloadStatus(response || { active: {}, queue: [] });
+    renderDownloadStatus(true);
   });
 

[NoCoverage] BlockStatement
extension/src/popup.ts:589:54
   });
 
   // Set up message listeners
-  chrome.runtime.onMessage.addListener((msg: any) => {
-    if (msg.type === "downloadStatusUpdate") {
-      renderDownloadStatus(msg.data);
-    } else if (msg.type === "queueUpdated") {
-      renderDownloadStatus({ active: msg.active, queue: msg.queue });
-    } else if (msg.type === "serverStatusUpdate") {
-      updatePopupServerStatus(msg.status);
-    }
-  });
+  chrome.runtime.onMessage.addListener((msg: any) => {});
 }
 

[NoCoverage] ConditionalExpression
extension/src/popup.ts:590:9
 
   // Set up message listeners
   chrome.runtime.onMessage.addListener((msg: any) => {
-    if (msg.type === "downloadStatusUpdate") {
+    if (true) {
       renderDownloadStatus(msg.data);
     } else if (msg.type === "queueUpdated") {

[NoCoverage] BlockStatement
extension/src/popup.ts:590:46
 
   // Set up message listeners
   chrome.runtime.onMessage.addListener((msg: any) => {
-    if (msg.type === "downloadStatusUpdate") {
-      renderDownloadStatus(msg.data);
-    } else if (msg.type === "queueUpdated") {
+    if (msg.type === "downloadStatusUpdate") {} else if (msg.type === "queueUpdated") {
       renderDownloadStatus({ active: msg.active, queue: msg.queue });
     } else if (msg.type === "serverStatusUpdate") {

[NoCoverage] ConditionalExpression
extension/src/popup.ts:592:16
   chrome.runtime.onMessage.addListener((msg: any) => {
     if (msg.type === "downloadStatusUpdate") {
       renderDownloadStatus(msg.data);
-    } else if (msg.type === "queueUpdated") {
+    } else if (true) {
       renderDownloadStatus({ active: msg.active, queue: msg.queue });
     } else if (msg.type === "serverStatusUpdate") {

[NoCoverage] BlockStatement
extension/src/popup.ts:592:45
   chrome.runtime.onMessage.addListener((msg: any) => {
     if (msg.type === "downloadStatusUpdate") {
       renderDownloadStatus(msg.data);
-    } else if (msg.type === "queueUpdated") {
-      renderDownloadStatus({ active: msg.active, queue: msg.queue });
-    } else if (msg.type === "serverStatusUpdate") {
+    } else if (msg.type === "queueUpdated") {} else if (msg.type === "serverStatusUpdate") {
       updatePopupServerStatus(msg.status);
     }

[NoCoverage] ObjectLiteral
extension/src/popup.ts:593:28
     if (msg.type === "downloadStatusUpdate") {
       renderDownloadStatus(msg.data);
     } else if (msg.type === "queueUpdated") {
-      renderDownloadStatus({ active: msg.active, queue: msg.queue });
+      renderDownloadStatus({});
     } else if (msg.type === "serverStatusUpdate") {
       updatePopupServerStatus(msg.status);

[NoCoverage] BlockStatement
extension/src/popup.ts:594:51
       renderDownloadStatus(msg.data);
     } else if (msg.type === "queueUpdated") {
       renderDownloadStatus({ active: msg.active, queue: msg.queue });
-    } else if (msg.type === "serverStatusUpdate") {
-      updatePopupServerStatus(msg.status);
-    }
+    } else if (msg.type === "serverStatusUpdate") {}
   });
 }

[NoCoverage] EqualityOperator
extension/src/popup.ts:594:16
       renderDownloadStatus(msg.data);
     } else if (msg.type === "queueUpdated") {
       renderDownloadStatus({ active: msg.active, queue: msg.queue });
-    } else if (msg.type === "serverStatusUpdate") {
+    } else if (msg.type !== "serverStatusUpdate") {
       updatePopupServerStatus(msg.status);
     }

[NoCoverage] BlockStatement
extension/src/popup.ts:601:53
 }
 
 // Initialize popup when DOM is ready
-document.addEventListener("DOMContentLoaded", () => {
-  initPopup().catch((error) => {
-    console.error("Error initializing popup:", error);
-  });
-});
+document.addEventListener("DOMContentLoaded", () => {});
 

[NoCoverage] BlockStatement
extension/src/popup.ts:602:32
 
 // Initialize popup when DOM is ready
 document.addEventListener("DOMContentLoaded", () => {
-  initPopup().catch((error) => {
-    console.error("Error initializing popup:", error);
-  });
+  initPopup().catch((error) => {});
 });
 
