[Killed] BlockStatement
extension/src/lib/event-manager.ts:18:11
     type: string,
     handler: EventListener,
     options?: AddEventListenerOptions
-  ): void {
-    const key = `${element.tagName}-${type}-${Date.now()}-${++this.counter}`;
-    this.listeners.set(key, { element, type, handler });
-    element.addEventListener(type, handler, options);
-  }
+  ): void {}
 
   removeListener(key: string): void {
killedBy: Event Manager Tests Event Registration should add listeners
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Survived] UpdateOperator
extension/src/lib/event-manager.ts:19:61
     handler: EventListener,
     options?: AddEventListenerOptions
   ): void {
-    const key = `${element.tagName}-${type}-${Date.now()}-${++this.counter}`;
+    const key = `${element.tagName}-${type}-${Date.now()}-${--this.counter}`;
     this.listeners.set(key, { element, type, handler });
     element.addEventListener(type, handler, options);

[Killed] StringLiteral
extension/src/lib/event-manager.ts:19:17
     handler: EventListener,
     options?: AddEventListenerOptions
   ): void {
-    const key = `${element.tagName}-${type}-${Date.now()}-${++this.counter}`;
+    const key = ``;
     this.listeners.set(key, { element, type, handler });
     element.addEventListener(type, handler, options);
killedBy: Event Manager Tests Event Registration should add multiple listeners
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] BlockStatement
extension/src/lib/event-manager.ts:24:37
     element.addEventListener(type, handler, options);
   }
 
-  removeListener(key: string): void {
-    const listener = this.listeners.get(key);
-    if (listener) {
-      listener.element.removeEventListener(listener.type, listener.handler);
-      this.listeners.delete(key);
-    }
-  }
+  removeListener(key: string): void {}
 
   removeAllListeners(): void {
killedBy: Event Manager Tests Event Removal should remove specific listeners
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
extension/src/lib/event-manager.ts:26:9
 
   removeListener(key: string): void {
     const listener = this.listeners.get(key);
-    if (listener) {
+    if (false) {
       listener.element.removeEventListener(listener.type, listener.handler);
       this.listeners.delete(key);
killedBy: Event Manager Tests Event Removal should remove specific listeners
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BlockStatement
extension/src/lib/event-manager.ts:26:19
 
   removeListener(key: string): void {
     const listener = this.listeners.get(key);
-    if (listener) {
-      listener.element.removeEventListener(listener.type, listener.handler);
-      this.listeners.delete(key);
-    }
+    if (listener) {}
   }
 
killedBy: Event Manager Tests Event Removal should remove specific listeners
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BlockStatement
extension/src/lib/event-manager.ts:32:30
     }
   }
 
-  removeAllListeners(): void {
-    this.listeners.forEach((listener, key) => {
-      listener.element.removeEventListener(listener.type, listener.handler);
-    });
-    this.listeners.clear();
-  }
+  removeAllListeners(): void {}
 
   getListenerCount(): number {
killedBy: Event Manager Tests Event Removal should remove all listeners
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 2

[Killed] BlockStatement
extension/src/lib/event-manager.ts:33:47
   }
 
   removeAllListeners(): void {
-    this.listeners.forEach((listener, key) => {
-      listener.element.removeEventListener(listener.type, listener.handler);
-    });
+    this.listeners.forEach((listener, key) => {});
     this.listeners.clear();
   }
killedBy: Event Manager Tests Cleanup should cleanup listeners properly
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"isTrusted": false}

[Killed] BlockStatement
extension/src/lib/event-manager.ts:39:30
     this.listeners.clear();
   }
 
-  getListenerCount(): number {
-    return this.listeners.size;
-  }
+  getListenerCount(): number {}
 }
 
killedBy: Event Manager Tests Event Registration should add listeners
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined
