[Killed] BlockStatement
extension/src/lib/performance-utils.ts:12:37
 export function debounce<T extends (...args: any[]) => any>(
   func: T,
   wait: number
-): (...args: Parameters<T>) => void {
-  let timeoutId: ReturnType<typeof setTimeout>;
-  return (...args: Parameters<T>) => {
-    clearTimeout(timeoutId);
-    timeoutId = setTimeout(() => func(...args), wait);
-  };
-}
+): (...args: Parameters<T>) => void {}
 
 /**
killedBy: Performance Utils Tests Debounce Function should debounce function calls
statusReason: TypeError: debouncedFunction is not a function

[Killed] BlockStatement
extension/src/lib/performance-utils.ts:14:38
   wait: number
 ): (...args: Parameters<T>) => void {
   let timeoutId: ReturnType<typeof setTimeout>;
-  return (...args: Parameters<T>) => {
-    clearTimeout(timeoutId);
-    timeoutId = setTimeout(() => func(...args), wait);
-  };
+  return (...args: Parameters<T>) => {};
 }
 
killedBy: Performance Utils Tests Debounce Function should debounce function calls
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ArrowFunction
extension/src/lib/performance-utils.ts:16:28
   let timeoutId: ReturnType<typeof setTimeout>;
   return (...args: Parameters<T>) => {
     clearTimeout(timeoutId);
-    timeoutId = setTimeout(() => func(...args), wait);
+    timeoutId = setTimeout(() => undefined, wait);
   };
 }
killedBy: Performance Utils Tests Debounce Function should debounce function calls
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
extension/src/lib/performance-utils.ts:26:37
 export function throttle<T extends (...args: any[]) => any>(
   func: T,
   limit: number
-): (...args: Parameters<T>) => void {
-  let inThrottle: boolean;
-  return (...args: Parameters<T>) => {
-    if (!inThrottle) {
-      func(...args);
-      inThrottle = true;
-      setTimeout(() => (inThrottle = false), limit);
-    }
-  };
-}
+): (...args: Parameters<T>) => void {}
 
 /**
killedBy: Performance Utils Tests Throttle Function should throttle function calls
statusReason: TypeError: throttledFunction is not a function

[Killed] BlockStatement
extension/src/lib/performance-utils.ts:28:38
   limit: number
 ): (...args: Parameters<T>) => void {
   let inThrottle: boolean;
-  return (...args: Parameters<T>) => {
-    if (!inThrottle) {
-      func(...args);
-      inThrottle = true;
-      setTimeout(() => (inThrottle = false), limit);
-    }
-  };
+  return (...args: Parameters<T>) => {};
 }
 
killedBy: Performance Utils Tests Throttle Function should throttle function calls
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
extension/src/lib/performance-utils.ts:29:9
 ): (...args: Parameters<T>) => void {
   let inThrottle: boolean;
   return (...args: Parameters<T>) => {
-    if (!inThrottle) {
+    if (true) {
       func(...args);
       inThrottle = true;
killedBy: Performance Utils Tests Throttle Function should throttle function calls
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 3

[Killed] BooleanLiteral
extension/src/lib/performance-utils.ts:29:9
 ): (...args: Parameters<T>) => void {
   let inThrottle: boolean;
   return (...args: Parameters<T>) => {
-    if (!inThrottle) {
+    if (inThrottle) {
       func(...args);
       inThrottle = true;
killedBy: Performance Utils Tests Throttle Function should throttle function calls
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Timeout] BooleanLiteral
extension/src/lib/performance-utils.ts:31:20
   return (...args: Parameters<T>) => {
     if (!inThrottle) {
       func(...args);
-      inThrottle = true;
+      inThrottle = false;
       setTimeout(() => (inThrottle = false), limit);
     }

[Killed] ArrowFunction
extension/src/lib/performance-utils.ts:32:18
     if (!inThrottle) {
       func(...args);
       inThrottle = true;
-      setTimeout(() => (inThrottle = false), limit);
+      setTimeout(() => undefined, limit);
     }
   };
killedBy: Performance Utils Tests Throttle Function should throttle function calls
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Killed] BooleanLiteral
extension/src/lib/performance-utils.ts:32:38
     if (!inThrottle) {
       func(...args);
       inThrottle = true;
-      setTimeout(() => (inThrottle = false), limit);
+      setTimeout(() => (inThrottle = true), limit);
     }
   };
killedBy: Performance Utils Tests Throttle Function should throttle function calls
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Killed] BlockStatement
extension/src/lib/performance-utils.ts:40:72
 /**
  * Memoize function results
  */
-export function memoize<T extends (...args: any[]) => any>(func: T): T {
-  const cache = new Map();
-  return ((...args: Parameters<T>) => {
-    const key = JSON.stringify(args);
-    if (cache.has(key)) {
-      return cache.get(key);
-    }
-    const result = func(...args);
-    cache.set(key, result);
-    return result;
-  }) as T;
-}
+export function memoize<T extends (...args: any[]) => any>(func: T): T {}
 
 /**
killedBy: Performance Utils Tests Memoize Function should memoize function results
statusReason: TypeError: memoizedFunction is not a function

[Timeout] BooleanLiteral
extension/src/lib/performance-utils.ts:58:23
  */
 export class DOMBatcher {
   private operations: (() => void)[] = [];
-  private scheduled = false;
+  private scheduled = true;
 
   add(operation: () => void): void {

[Timeout] BlockStatement
extension/src/lib/performance-utils.ts:60:36
   private operations: (() => void)[] = [];
   private scheduled = false;
 
-  add(operation: () => void): void {
-    this.operations.push(operation);
-    if (!this.scheduled) {
-      this.scheduled = true;
-      requestAnimationFrame(() => this.flush());
-    }
-  }
+  add(operation: () => void): void {}
 
   private flush(): void {

[Timeout] BlockStatement
extension/src/lib/performance-utils.ts:62:26
 
   add(operation: () => void): void {
     this.operations.push(operation);
-    if (!this.scheduled) {
-      this.scheduled = true;
-      requestAnimationFrame(() => this.flush());
-    }
+    if (!this.scheduled) {}
   }
 

[Survived] ConditionalExpression
extension/src/lib/performance-utils.ts:62:9
 
   add(operation: () => void): void {
     this.operations.push(operation);
-    if (!this.scheduled) {
+    if (true) {
       this.scheduled = true;
       requestAnimationFrame(() => this.flush());

[Survived] BooleanLiteral
extension/src/lib/performance-utils.ts:63:24
   add(operation: () => void): void {
     this.operations.push(operation);
     if (!this.scheduled) {
-      this.scheduled = true;
+      this.scheduled = false;
       requestAnimationFrame(() => this.flush());
     }

[Timeout] ArrowFunction
extension/src/lib/performance-utils.ts:64:29
     this.operations.push(operation);
     if (!this.scheduled) {
       this.scheduled = true;
-      requestAnimationFrame(() => this.flush());
+      requestAnimationFrame(() => undefined);
     }
   }

[Timeout] BlockStatement
extension/src/lib/performance-utils.ts:68:25
     }
   }
 
-  private flush(): void {
-    this.operations.forEach((op) => op());
-    this.operations = [];
-    this.scheduled = false;
-  }
+  private flush(): void {}
 }
 

[Timeout] ArrowFunction
extension/src/lib/performance-utils.ts:69:29
   }
 
   private flush(): void {
-    this.operations.forEach((op) => op());
+    this.operations.forEach(() => undefined);
     this.operations = [];
     this.scheduled = false;

[Survived] BooleanLiteral
extension/src/lib/performance-utils.ts:71:22
   private flush(): void {
     this.operations.forEach((op) => op());
     this.operations = [];
-    this.scheduled = false;
+    this.scheduled = true;
   }
 }

[Killed] ArithmeticOperator
extension/src/lib/performance-utils.ts:82:34
   private cache = new Map<string, { value: T; timestamp: number }>();
   private maxAge: number;
 
-  constructor(maxAgeMs: number = 5 * 60 * 1000) {
+  constructor(maxAgeMs: number = 5 * 60 / 1000) {
     this.maxAge = maxAgeMs;
   }
killedBy: Performance Utils Tests Cache should handle different value types
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 42
Received: undefined

[Killed] BlockStatement
extension/src/lib/performance-utils.ts:82:49
   private cache = new Map<string, { value: T; timestamp: number }>();
   private maxAge: number;
 
-  constructor(maxAgeMs: number = 5 * 60 * 1000) {
-    this.maxAge = maxAgeMs;
-  }
+  constructor(maxAgeMs: number = 5 * 60 * 1000) {}
 
   get(key: string): T | undefined {
killedBy: Performance Utils Tests Cache should handle cache expiration
statusReason: Error: expect(received).toBeUndefined()

Received: "value"

[Killed] BlockStatement
extension/src/lib/performance-utils.ts:86:35
     this.maxAge = maxAgeMs;
   }
 
-  get(key: string): T | undefined {
-    const entry = this.cache.get(key);
-    if (!entry) return undefined;
-
-    if (Date.now() - entry.timestamp > this.maxAge) {
-      this.cache.delete(key);
-      return undefined;
-    }
-
-    return entry.value;
-  }
+  get(key: string): T | undefined {}
 
   set(key: string, value: T): void {
killedBy: Performance Utils Tests Cache should store and retrieve values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "value1"
Received: undefined

[Killed] ConditionalExpression
extension/src/lib/performance-utils.ts:88:9
 
   get(key: string): T | undefined {
     const entry = this.cache.get(key);
-    if (!entry) return undefined;
+    if (true) return undefined;
 
     if (Date.now() - entry.timestamp > this.maxAge) {
killedBy: Performance Utils Tests Cache should store and retrieve values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "value1"
Received: undefined

[Killed] BooleanLiteral
extension/src/lib/performance-utils.ts:88:9
 
   get(key: string): T | undefined {
     const entry = this.cache.get(key);
-    if (!entry) return undefined;
+    if (entry) return undefined;
 
     if (Date.now() - entry.timestamp > this.maxAge) {
killedBy: Performance Utils Tests Cache should store and retrieve values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "value1"
Received: undefined

[Killed] ArithmeticOperator
extension/src/lib/performance-utils.ts:90:9
     const entry = this.cache.get(key);
     if (!entry) return undefined;
 
-    if (Date.now() - entry.timestamp > this.maxAge) {
+    if (Date.now() + entry.timestamp > this.maxAge) {
       this.cache.delete(key);
       return undefined;
killedBy: Performance Utils Tests Cache should store and retrieve values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "value1"
Received: undefined

[Killed] EqualityOperator
extension/src/lib/performance-utils.ts:90:9
     const entry = this.cache.get(key);
     if (!entry) return undefined;
 
-    if (Date.now() - entry.timestamp > this.maxAge) {
+    if (Date.now() - entry.timestamp <= this.maxAge) {
       this.cache.delete(key);
       return undefined;
killedBy: Performance Utils Tests Cache should store and retrieve values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "value1"
Received: undefined

[Killed] BlockStatement
extension/src/lib/performance-utils.ts:98:36
     return entry.value;
   }
 
-  set(key: string, value: T): void {
-    this.cache.set(key, { value, timestamp: Date.now() });
-  }
+  set(key: string, value: T): void {}
 
   clear(): void {
killedBy: Performance Utils Tests Cache should store and retrieve values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "value1"
Received: undefined

[Killed] ObjectLiteral
extension/src/lib/performance-utils.ts:99:25
   }
 
   set(key: string, value: T): void {
-    this.cache.set(key, { value, timestamp: Date.now() });
+    this.cache.set(key, {});
   }
 
killedBy: Performance Utils Tests Cache should store and retrieve values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "value1"
Received: undefined

[Killed] BlockStatement
extension/src/lib/performance-utils.ts:102:17
     this.cache.set(key, { value, timestamp: Date.now() });
   }
 
-  clear(): void {
-    this.cache.clear();
-  }
+  clear(): void {}
 }
 
killedBy: Performance Utils Tests Cache should clear cache
statusReason: Error: expect(received).toBeUndefined()

Received: "value1"
