[Killed] ConditionalExpression
extension/src/youtube_enhance.ts:17:7
   btn: HTMLElement | null | undefined
 ): void {
   // Handle null/undefined button
-  if (!btn) {
+  if (false) {
     return;
   }
killedBy: youtube_enhance enhanceYouTubeButton edge cases handles null button element gracefully
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "Cannot read properties of null (reading 'classList')"

      93 |
      94 |         // Add CSS class for enhanced YouTube styling
    > 95 |         btn.classList.add(stryMutAct_9fa48("3892") ? "" : (stryCov_9fa48("3892"), "youtube-enhanced"));

[Killed] ConditionalExpression
extension/src/youtube_enhance.ts:17:7
   btn: HTMLElement | null | undefined
 ): void {
   // Handle null/undefined button
-  if (!btn) {
+  if (true) {
     return;
   }
killedBy: youtube_enhance enhanceYouTubeButton YouTube domain detection enhances button styles for youtube.com
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
extension/src/youtube_enhance.ts:24:7
   const hostname = getHostname();
 
   // Handle null/undefined hostname
-  if (!hostname) {
+  if (true) {
     return;
   }
killedBy: youtube_enhance enhanceYouTubeButton YouTube domain detection enhances button styles for youtube.com
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
extension/src/youtube_enhance.ts:24:7
   const hostname = getHostname();
 
   // Handle null/undefined hostname
-  if (!hostname) {
+  if (hostname) {
     return;
   }
killedBy: youtube_enhance enhanceYouTubeButton YouTube domain detection enhances button styles for youtube.com
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
extension/src/youtube_enhance.ts:30:5
 
   // More precise YouTube domain detection
   const isYouTubeDomain =
-    hostname === "youtube.com" ||
-    hostname === "www.youtube.com" ||
-    hostname === "m.youtube.com" ||
-    hostname === "music.youtube.com" ||
+    (hostname === "youtube.com" || hostname === "www.youtube.com" || hostname === "m.youtube.com") && hostname === "music.youtube.com" ||
     hostname.endsWith(".youtube.com");
 
killedBy: youtube_enhance enhanceYouTubeButton YouTube domain detection enhances button styles for youtube.com
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
extension/src/youtube_enhance.ts:30:5
 
   // More precise YouTube domain detection
   const isYouTubeDomain =
-    hostname === "youtube.com" ||
-    hostname === "www.youtube.com" ||
-    hostname === "m.youtube.com" ||
-    hostname === "music.youtube.com" ||
-    hostname.endsWith(".youtube.com");
+    (hostname === "youtube.com" || hostname === "www.youtube.com" || hostname === "m.youtube.com" || hostname === "music.youtube.com") && hostname.endsWith(".youtube.com");
 
   if (isYouTubeDomain) {
killedBy: youtube_enhance enhanceYouTubeButton YouTube domain detection enhances button styles for youtube.com
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
extension/src/youtube_enhance.ts:31:5
   // More precise YouTube domain detection
   const isYouTubeDomain =
     hostname === "youtube.com" ||
-    hostname === "www.youtube.com" ||
+    hostname !== "www.youtube.com" ||
     hostname === "m.youtube.com" ||
     hostname === "music.youtube.com" ||
killedBy: youtube_enhance enhanceYouTubeButton YouTube domain detection does nothing for non-YouTube domains
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] ConditionalExpression
extension/src/youtube_enhance.ts:31:5
   // More precise YouTube domain detection
   const isYouTubeDomain =
     hostname === "youtube.com" ||
-    hostname === "www.youtube.com" ||
+    false ||
     hostname === "m.youtube.com" ||
     hostname === "music.youtube.com" ||

[Killed] EqualityOperator
extension/src/youtube_enhance.ts:32:5
   const isYouTubeDomain =
     hostname === "youtube.com" ||
     hostname === "www.youtube.com" ||
-    hostname === "m.youtube.com" ||
+    hostname !== "m.youtube.com" ||
     hostname === "music.youtube.com" ||
     hostname.endsWith(".youtube.com");
killedBy: Content script button behaviors createOrUpdateButton positioning positions main button at stored x/y on generic host
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "50px"
Received: "924px"

[Survived] ConditionalExpression
extension/src/youtube_enhance.ts:32:5
   const isYouTubeDomain =
     hostname === "youtube.com" ||
     hostname === "www.youtube.com" ||
-    hostname === "m.youtube.com" ||
+    false ||
     hostname === "music.youtube.com" ||
     hostname.endsWith(".youtube.com");

[Killed] EqualityOperator
extension/src/youtube_enhance.ts:33:5
     hostname === "youtube.com" ||
     hostname === "www.youtube.com" ||
     hostname === "m.youtube.com" ||
-    hostname === "music.youtube.com" ||
+    hostname !== "music.youtube.com" ||
     hostname.endsWith(".youtube.com");
 
killedBy: Content script button behaviors createOrUpdateButton positioning positions main button at stored x/y on generic host
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "50px"
Received: "924px"

[Survived] ConditionalExpression
extension/src/youtube_enhance.ts:33:5
     hostname === "youtube.com" ||
     hostname === "www.youtube.com" ||
     hostname === "m.youtube.com" ||
-    hostname === "music.youtube.com" ||
+    false ||
     hostname.endsWith(".youtube.com");
 

[Survived] MethodExpression
extension/src/youtube_enhance.ts:34:5
     hostname === "www.youtube.com" ||
     hostname === "m.youtube.com" ||
     hostname === "music.youtube.com" ||
-    hostname.endsWith(".youtube.com");
+    hostname.startsWith(".youtube.com");
 
   if (isYouTubeDomain) {

[Killed] ConditionalExpression
extension/src/youtube_enhance.ts:36:7
     hostname === "music.youtube.com" ||
     hostname.endsWith(".youtube.com");
 
-  if (isYouTubeDomain) {
+  if (true) {
     // Enhancing YouTube button visibility
 
killedBy: Content script button behaviors createOrUpdateButton positioning positions main button at stored x/y on generic host
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "50px"
Received: "924px"

[Killed] ConditionalExpression
extension/src/youtube_enhance.ts:36:7
     hostname === "music.youtube.com" ||
     hostname.endsWith(".youtube.com");
 
-  if (isYouTubeDomain) {
+  if (false) {
     // Enhancing YouTube button visibility
 
killedBy: youtube_enhance enhanceYouTubeButton YouTube domain detection enhances button styles for youtube.com
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
extension/src/youtube_enhance.ts:40:23
     // Enhancing YouTube button visibility
 
     // Add CSS class for enhanced YouTube styling
-    btn.classList.add("youtube-enhanced");
+    btn.classList.add("");
 
     // Position in a more visible area for YouTube if not specifically placed by user
killedBy: youtube_enhance enhanceYouTubeButton YouTube domain detection enhances button styles for youtube.com
statusReason: SyntaxError: The token provided must not be empty.

[Killed] LogicalOperator
extension/src/youtube_enhance.ts:43:9
     btn.classList.add("youtube-enhanced");
 
     // Position in a more visible area for YouTube if not specifically placed by user
-    if (!btn.style.top || btn.style.top === "10px") {
+    if (!btn.style.top && btn.style.top === "10px") {
       // Move button to a more visible position if it's at the default
       btn.style.top = "70px"; // Below the YouTube header
killedBy: youtube_enhance enhanceYouTubeButton button positioning positions button at default location when no top style is set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "70px"
Received: ""

[Killed] BlockStatement
extension/src/youtube_enhance.ts:43:53
     btn.classList.add("youtube-enhanced");
 
     // Position in a more visible area for YouTube if not specifically placed by user
-    if (!btn.style.top || btn.style.top === "10px") {
-      // Move button to a more visible position if it's at the default
-      btn.style.top = "70px"; // Below the YouTube header
-      btn.style.left = String(window.innerWidth - 100) + "px"; // Right side with margin
-    } else {
+    if (!btn.style.top || btn.style.top === "10px") {} else {
       // If button has a custom top position, still set the left position
       btn.style.left = String(window.innerWidth - 100) + "px"; // Right side with margin
killedBy: youtube_enhance enhanceYouTubeButton button positioning positions button at default location when no top style is set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "70px"
Received: ""

[Killed] ArithmeticOperator
extension/src/youtube_enhance.ts:46:31
     if (!btn.style.top || btn.style.top === "10px") {
       // Move button to a more visible position if it's at the default
       btn.style.top = "70px"; // Below the YouTube header
-      btn.style.left = String(window.innerWidth - 100) + "px"; // Right side with margin
+      btn.style.left = String(window.innerWidth + 100) + "px"; // Right side with margin
     } else {
       // If button has a custom top position, still set the left position
killedBy: youtube_enhance enhanceYouTubeButton button positioning positions button at default location when no top style is set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1820px"
Received: "2020px"

[Killed] StringLiteral
extension/src/youtube_enhance.ts:46:58
     if (!btn.style.top || btn.style.top === "10px") {
       // Move button to a more visible position if it's at the default
       btn.style.top = "70px"; // Below the YouTube header
-      btn.style.left = String(window.innerWidth - 100) + "px"; // Right side with margin
+      btn.style.left = String(window.innerWidth - 100) + ""; // Right side with margin
     } else {
       // If button has a custom top position, still set the left position
killedBy: youtube_enhance enhanceYouTubeButton button positioning positions button at default location when no top style is set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1820px"
Received: ""

[Killed] BlockStatement
extension/src/youtube_enhance.ts:47:12
       // Move button to a more visible position if it's at the default
       btn.style.top = "70px"; // Below the YouTube header
       btn.style.left = String(window.innerWidth - 100) + "px"; // Right side with margin
-    } else {
-      // If button has a custom top position, still set the left position
-      btn.style.left = String(window.innerWidth - 100) + "px"; // Right side with margin
-    }
+    } else {}
   }
 }
killedBy: youtube_enhance enhanceYouTubeButton button positioning preserves custom top position when not 10px
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1820px"
Received: ""

[Killed] ArithmeticOperator
extension/src/youtube_enhance.ts:49:31
       btn.style.left = String(window.innerWidth - 100) + "px"; // Right side with margin
     } else {
       // If button has a custom top position, still set the left position
-      btn.style.left = String(window.innerWidth - 100) + "px"; // Right side with margin
+      btn.style.left = String(window.innerWidth + 100) + "px"; // Right side with margin
     }
   }
killedBy: youtube_enhance enhanceYouTubeButton button positioning preserves custom top position when not 10px
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1820px"
Received: "2020px"

[Killed] StringLiteral
extension/src/youtube_enhance.ts:49:58
       btn.style.left = String(window.innerWidth - 100) + "px"; // Right side with margin
     } else {
       // If button has a custom top position, still set the left position
-      btn.style.left = String(window.innerWidth - 100) + "px"; // Right side with margin
+      btn.style.left = String(window.innerWidth - 100) + ""; // Right side with margin
     }
   }
killedBy: youtube_enhance enhanceYouTubeButton button positioning preserves custom top position when not 10px
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1820px"
Received: ""
